{
    "metadata": {},
    "content": "{\n    \"source_filename\": \"analytics.md\",\n    \"metadata\": {\n        \"title\": \"Matchmaking analytics\",\n        \"description\": \"Use matchmaking analytics to analyze your matchmaking configurations.\"\n    },\n    \"content\": \"Use the matchmaking analytics dashboard metrics to analyze the impact of individual matchmaking configurations and monitor signal performance over different periods of time.\\n\\n## Access the dashboard\\n\\nTo access the matchmaking analytics dashboard:\\n\\n1. In the **Creator Dashboard**, navigate to **Creations**, then select an experience.\\n2. In the lefthand navigation, navigate to the **Configure** section, then select **Custom Matchmaking**.\\n3. In the horizontal navigation, select the **Analytics** tab.\\n\\n## See metrics for a specific place\\n\\nThe analytics dashboard includes charts for Roblox signals and custom signals. If a matchmaking configuration has one numerical custom signal and one categorical custom signal, data is populated in both the numerical and categorical signal charts. If a configuration has two of the same type of custom signal (as in, two numerical or two categorical), only one of the charts is populated with two lines representing data for both. Categorical charts represent a similarity ratio, while numerical charts represent the difference.\\n\\nTo see matchmaking metrics for a specific place in your experience:\\n\\n1. In the **Analytics** tab, click the **Date Range** dropdown and select a date range between the previous day and the last 90 days.\\n2. Click the **Place** dropdown and select the place you want to see metrics for. The **Current Configuration** updates with the name of the matchmaking configuration applied to the place you selected.\\n\\n<img src=\\\"../assets/matchmaking/MatchmakingAnalytics.png\\\" width=\\\"80%\\\" alt=\\\"Matchmaking analytics charts for several different ratios.\\\" />\\n\\nIf the selected place doesn't have a custom matchmaking configuration applied to it, the dashboard shows metrics for the default Roblox matchmaking configuration.\\n\\n## Filter by percentile values\\n\\nIn the **Analytics** tab, select the **Filter By** menu to swap signal charts between averages and the following percentile values:\\n\\n- **P90** to filter by the number of values that fall within the 90th percentile.\\n- **P10** to filter by the number of values that fall within the 10th percentile.\\n- **P50** to filter by the median, with half of all values falling above it and half below it.\\n\\nThe filter applies to all signal charts.\\n\\n<Alert severity=\\\"info\\\">\\n  Percentile values are calculated smallest to largest, so for metrics where lower numbers are better, P10 represents the \\\"best case\\\" and P90 the \\\"worst case\\\" rather than the other way around.\\n</Alert>\\n\\n## Signal charts\\n\\nThe **Analytics** tab includes the following signal charts:\\n\\n<table>\\n<thead>\\n  <tr>\\n    <th>**Chart**</th>\\n    <th>**Description**</th>\\n  </tr>\\n</thead>\\n<tbody>\\n  <tr>\\n    <td>**Occupancy Ratio**</td>\\n    <td>The average/P10/P50/P90 occupancy ratio of the chosen server.</td>\\n  </tr>\\n  <tr>\\n    <td>**Average for Preferred Player Match Ratio**</td>\\n    <td>The average percentage of matchmaking requests that match the joining player to a server with preferred players.</td>\\n  </tr>\\n  <tr>\\n    <td>**Age Difference**</td>\\n    <td>The average/P10/P50/P90 value of the age difference between the joining player and the mean age of all players in the chosen server.</td>\\n  </tr>\\n  <tr>\\n    <td>**Common Language Ratio**</td>\\n    <td>The average/P10/P50/P90 common language ratio of the chosen server. The common language is the language shared between existing players in the server and the joining player.</td>\\n  </tr>\\n  <tr>\\n    <td>**Estimate Ping**</td>\\n    <td>The average/P10/P50/P90 estimate ping value of the chosen server.</td>\\n  </tr>\\n  <tr>\\n    <td>**Voice Chat Ratio**</td>\\n    <td>The average/P10/P50/P90 occupancy ratio of players with voice chat enabled in the chosen server.</td>\\n  </tr>\\n  <tr>\\n    <td>**Common Device Ratio**</td>\\n    <td>The average/P10/P50/P90 common device ratio of the chosen server. The common device is the device type shared between existing players in the server and the joining player.</td>\\n  </tr>\\n  <tr>\\n    <td>**Play History Difference**</td>\\n    <td>The average/P10/P50/P90 value of the play history difference between the joining player and the mean play history of all players in the chosen server.</td>\\n  </tr>\\n  <tr>\\n    <td>**Numerical Custom Signal Difference**</td>\\n    <td>The average/P10/P50/P90 value of the numerical signal difference between the joining player and the server average.</td>\\n  </tr>\\n  <tr>\\n    <td>**Categorical Custom Signal Similarity Ratio**</td>\\n    <td>The average/P10/P50/P90 categorical signal similarity ratio between the joining player and the server average.</td>\\n  </tr>\\n</tbody>\\n</table>\"\n}"
}