{
    "title": "Audio assets",
    "description": "Explore how to find and import audio assets for use in your experiences.",
    "content": "You can find a wide variety of free‑to‑use audio assets in the Creator Store, or you can import audio assets that you're certain you have permission to use, such as audio that you make yourself. The asset privacy system automatically ensures that the IDs of your imported audio can't be accessed by users without proper permissions.\n\nFind audio\n\nThe Creator Store tab of the Toolbox contains a wide variety of free-to-use audio assets made by Roblox and the Roblox community for creators to use within their experiences, including more than 100,000 professionally-produced sound effects and music tracks from top audio and music partners.\n\nTo find audio assets on the Creator Store:\n\n1. In the Toolbox, navigate to the Creator Store tab, then use the category selector dropdown to select Audio.\n\n\n\n2. Use the keyword search, quick filter options, and/or advanced filters to narrow down the results.\n\n\n\n3. Right-click any audio asset, then select Copy Asset ID to copy the asset ID to your clipboard. You can now paste this asset ID into a Class.AudioPlayer object to play the audio.\n\n  If you click any audio asset, Studio inserts it as a new Class.Sound instance into the Explorer window. However, Class.Sound objects don't have the same dynamic functionality as Class.AudioPlayer objects.\n\nImport audio\n\nYou can import custom audio through the Asset Manager, Creator Dashboard, and Open Cloud API as long as your audio meets the following requirements:\n\n- You have the legal rights to that audio asset.\n- It adheres to the Community Rules and Terms of Use.\n- It's a single track/stream in either .mp3, .ogg, .wav or .flac format.\n- It's less than 20 MB in size and 7 minutes in duration.\n- Its sample rate is less than or equal to 48 kHz.\n- Its channels are set to mono or stereo 2.0, 3.0, or 5.1 surround.\n\nIf you're ID verified, you can import 100 free audio assets per 30 days; if you're unverified, you can import 10 free audio assets per 30 days. Studio assigns each new audio asset a unique asset ID that you can use within your experiences to play the audio.\n\n\n\nTo import audio through the Asset Manager:\n\n1. Click the Import button.\n2. Select and then confirm the audio files you want to import from your local system.\n3. Once you confirm the imports and the files import successfully, they display with a green checkmark and a completed status.\n\n\n   To standardize the playback format and check for corrupt or invalid files, Studio transcodes imported audio before saving it as an asset. If you receive an error while importing audio, Studio is likely rejecting it during the transcode process. In addition, some older audio tools generate invalid file headers or frames when exporting.\n\n   If Studio continues to reject the audio you're trying to import, ensure your audio tools are updated, then verify that the audio files meet the import requirements.\n\n\n\n\n\nTo import audio through the Creator Dashboard:\n\n1. In the horizontal navigation, select Development Items. All assets you have previously imported display within their respective category.\n2. In the sub-horizontal navigation, select Audio.\n3. Click the Upload Asset button. The Upload Asset page displays.\n4. In the Upload Asset page,\n   1. Click the Upload button, then select and then confirm the audio file you want to import from your local system.\n   1. Fill out the Name and Description fields with the audio file's relevant information.\n   1. At the bottom of the page, click the Upload button.\n\nYour audio assets are now within the moderation queue and are only visible to you within the Audio tab of the Creator Dashboard's Development Items page.\n\n\n\n\nTo import audio through an HTTP request:\n\n1. Copy the API key to the x-api-key request header of the Create Asset endpoint.\n1. In your request:\n\n   1. Specify that the target asset type is Audio.\n   1. Add your audio asset's name and description.\n   1. Add the creator information.\n      - If you want to create the audio asset on your own behalf, add your user ID. You can find your user ID on the URL of your Roblox profile. For example, for https://www.roblox.com/users/1234567/profile, your user ID is 1234567.\n      - If you want to create the audio asset as a group asset, add the group ID of your group. You can find the group ID on the URL of your group's page. For example, for https://www.roblox.com/groups/7654321/example-group#!/, the group ID is 7654321.\n   1. Add the file path and content type of your asset.\n\n   bash title =\"Example Request for Create Audio Asset\"\n   curl --location 'https://apis.roblox.com/assets/v1/assets' \\\n   --header 'x-api-key: ${ApiKey}' \\\n   --form 'request=\"{\n     \\\"assetType\\\": \\\"Audio\\\",\n     \\\"displayName\\\": \\\"Name\\\",\n     \\\"description\\\": \\\"This is a description\\\",\n     \\\"creationContext\\\": {\n       \\\"creator\\\": {\n         \\\"userId\\\": \\\"${userId}\\\" # Use groupId for creating a group asset\n       }\n     }\n   }\"' \\\n   --form 'fileContent=@\"/filepath/audio.mp3\";type=audio/mpeg'\n\n\n\n\n\nAfter the audio assets pass moderation, you can reuse them in any project on the platform. Although you are initially the only one who can view and use private audio assets, the asset privacy system lets you grant usage permissions to specific connections and experiences.",
    "source": "assets.md"
}