{
    "title": "Luau comments",
    "description": "Comments are text that the Luau parser ignores at runtime.",
    "content": "A comment is text that the Luau parser ignores at runtime.\n\nRoblox Studio has a similarly-named comments feature that is unrelated to code comments in Luau.\n\nSingle-line comments\n\nYou can define single-line comments with a double hyphen (--) anywhere outside a string. Single-line comments extend to the end of the line.\n\nUse single line comments for in-line notes. If the comment spans multiple lines, use multiple single-line comments.\n\nYou can add and remove single-line comments in the Script Editor with the keyboard shortcut Ctrl/ (⌘/).\n\nlua\n-- This condition is really important because the world would blow up if it\n-- were missing.\nif not foo then\n\tstopWorldFromBlowingUp()\nend\n\nBlock comments\n\nYou can define multiline block comments with double hyphens and double brackets (--[[]]). Use block comments for documenting items:\n\n- Use a block comment at the top of files to describe their purpose.\n- Use a block comment before functions or objects to describe their intent.\n\nlua\n--[[\n    Shuts off the cosmic moon ray immediately.\n\n    Should only be called within 15 minutes of midnight Mountain Standard\n    Time, or the cosmic moon ray may be damaged.\n]]\nlocal function stopCosmicMoonRay()\nend\n\nIf necessary, you can nest multiple brackets inside a block comment using the same number of equal signs in both the beginning and ending bracket:\n\nlua\n--[=[\n    In-depth detail about cosmic moon ray: [[[TOP SECRET]]]\n]=]\n\nComment directives\n\nLuau uses comments that start with ! to control features like type checking, native code generation, and linting.\n\nlua\n--!strict\n--!nonstrict\n--!nocheck\n--!native\n--!nolint\n--!optimize 0|1|2\n\nFor linting, Roblox Studio enables the following subset of warning codes from the Luau linter: 1, 2, 3, 6, 10, 11, 12, 13, 14, 15, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28.\n\nThe --!optimize directive controls the optimization level of the Luau compiler for the script:\n\n- 0 disables optimizations.\n- 1 enables basic optimizations (default in Studio testing).\n- 2 enables further optimizations (default in live experiences).\n\nExact optimizations aren't published and are subject to change. We recommend using the default values unless you have a specific reason not to.\n\nTo-do comments\n\nRoblox Studio supports special TODO comments. Studio bolds any text following TODO (until broken by a space):\n\nlua\n-- TODO: Finish the function below so that it actually does what its name implies.\nlocal function stopWorldFromBlowingUp()\nend\n\nUse TODO comments to keep track of and communicate issues within your code.",
    "source": "comments.md"
}