{
    "title": "Cross-server messaging",
    "description": "Cross-server messaging enables you to communicate with other servers or client instances of your experience.",
    "content": "Normally, the code within an experience can only affect the server or clients that it's running on, but there may be situations where you want different servers to communicate with each other, including:\n\n- Global Announcements &mdash; Send announcements such as \"A user found a special item!\" to all the experience's servers.\n- Real-Time Server Browser &mdash; Compile a list of all the experience's servers and who is in them (updated every minute) and display the list on a maximum of 20 servers.\n\nYou can support cross-server messaging in your experience using Class.MessagingService. You can also use the Teleportation Playground sample experience to see how cross‑server messaging works before you implement it. Lastly, see here to explore cross‑server communication using external tools.\n\nCross-server messaging setup\n\nTo enable cross-server messaging, you must set up a topic which is a customized message channel that's accessible from multiple servers. After you create a topic, you can subscribe users to the topic to receive messages and enable publishing messages to the topic.\n\nSubscribe users to receive messages\n\nUse Class.MessagingService:SubscribeAsync() to subscribe users to a topic and specify a callback function that detects messages publishing to that topic. For example, the following code sample subscribes all users to a FriendServerEvent topic that receives messages when any user is teleported to a different server.\n\nlua\nlocal MessagingService = game:GetService(\"MessagingService\")\nlocal Players = game:GetService(\"Players\")\n\nlocal MESSAGINGTOPIC = \"FriendServerEvent\"\n\nPlayers.PlayerAdded:Connect(function(player)\n\t-- Subscribe to the topic\n\tlocal subscribeSuccess, subscribeConnection = pcall(function()\n\t\treturn MessagingService:SubscribeAsync(MESSAGINGTOPIC, function(message)\n\t\t\tprint(message.Data)\n\t\tend)\n\tend)\n\tif subscribeSuccess then\n\t\t-- Unsubscribe from topic upon player ancestry change\n\t\tplayer.AncestryChanged:Connect(function()\n\t\t\tsubscribeConnection:Disconnect()\n\t\tend)\n\tend\nend)\n\nPublish messages\n\nUse Class.MessagingService:PublishAsync() to match a specific topic and publish a message to it. For example, the following code sample uses Class.MessagingService:PublishAsync()|PublishAsync() to notify all users when a user joins a new server, including the Class.Player.Name representing the user's display name and the Class.DataModel.JobId|JobId, a unique identifier for the running experience server instance.\n\nlua\nlocal MessagingService = game:GetService(\"MessagingService\")\nlocal Players = game:GetService(\"Players\")\n\nlocal MESSAGINGTOPIC = \"FriendServerEvent\"\n\nPlayers.PlayerAdded:Connect(function(player)\n\t-- Publish to topic\n\tlocal publishSuccess, publishResult = pcall(function()\n\t\tlocal message = player.Name .. \" joined server with 'JobId' of \" .. game.JobId\n\t\tMessagingService:PublishAsync(MESSAGINGTOPIC, message)\n\tend)\n\tif not publishSuccess then\n\t\tprint(publishResult)\n\tend\nend)",
    "source": "cross-server-messaging.md"
}