{
    "title": "2D-paths",
    "description": "",
    "content": "{\n    \"title\": \"2D paths\",\n    \"description\": \"The Path2D instance, along with its API methods and properties, lets you implement 2D splines and 2D curved lines.\",\n    \"content\": \"The Class.Path2D instance, along with its API methods and properties, lets you implement 2D splines and 2D curved lines, useful for UI effects like path‑based animations and graph editors.\\n\\nCreate a 2D path\\n\\nTo add a Class.Path2D to the screen or an in-experience object:\\n\\n1. In the Explorer window, insert a Class.Path2D instance under a visible Class.ScreenGui or Class.SurfaceGui (it does not need to be a direct child).\\n\\n\\n\\n2. Select the new Class.Path2D to reveal the in-viewport tooling widget. By default, the Add Point tool is selected.\\n\\n\\n\\n3. Begin clicking on the screen to add a series of control points to form a path. The initial path will likely be imprecise but you can fine‑tune the position of any control point later.\\n\\n\\n\\n\\n   If you drag the mouse after clicking, tangents will be created on that point. Tangents can also be procedurally added to any control point.\\n\\n\\n4. When finished, click the widget's Done button or press Enter.\\n\\nModify control points\\n\\nWith a Class.Path2D selected in the Explorer hierarchy, you can modify its individual control points as well as their tangents.\\n\\nMove points\\n\\nTo move an individual control point on a path, enable the Select tool (V) and then click‑and‑drag it to a new position.\\n\\nFor very specific positioning, select the control point and then, in the Properties window, set a new position for the point's Class.Path2D.SelectedControlPointData|SelectedControlPointData property (Datatype.UDim2).\\n\\nNote that a point's position is not absolute, but rather relative to the path's parent container. For example, compare a control point 30% from left and 20% from top for a path inside a Class.ScreenGui, versus an identical path placed inside a Class.Frame located in the upper‑right corner of the Class.ScreenGui.\\n\\nAdd points\\n\\nNew control points can be added to a Class.Path2D either between two existing points or from either end point using the Add Point tool (P).\\n\\n\\n\\n\\t\\tHover anywhere over the path and click to add a control point between two existing points\\n\\n\\n\\n\\t\\tClick on an end point and then click again to add a control point from that end\\n\\n\\nRemember that if you drag the mouse after clicking to add a new control point, tangents will be created on that point.\\n\\nDelete points\\n\\nTo delete a control point, hover over and right‑click it, then select Delete Point from the contextual popup menu.\\n\\nControl point tangents\\n\\nControl point tangents let you create and adjust curves on a path.\\n\\nAdd tangents\\n\\nTo add tangents to any control point that doesn't already have tangents:\\n\\n1. Enable the Add Tangent tool in the tooling widget.\\n\\n\\n\\n2. Hover over the desired control point, then click to add two mirrored tangents (optionally drag after clicking to adjust the new tangents).\\n\\n\\n\\nAdjust tangents\\n\\nTo adjust existing tangents for an individual control point:\\n\\n1. Enable the Select tool (V).\\n\\n\\n\\n2. Hover over a tangent marker (not the control point), then click‑and‑drag it to a new position. If the tangents are mirrored, the paired tangent point will move in unison.\\n\\n\\n\\nTo manually set a specific Datatype.UDim2 position for a tangent:\\n\\n1. Enable the Select tool (V) and select the control point.\\nIn the Properties window, expand the Class.Path2D.SelectedControlPointData|SelectedControlPointData field to expose the Datatype.Path2DControlPoint.LeftTangent|LeftTangent and Datatype.Path2DControlPoint.RightTangent|RightTangent properties.\\n\\n\\n\\n2. Set the position for Datatype.Path2DControlPoint.LeftTangent|LeftTangent and/or Datatype.Path2DControlPoint.RightTangent|RightTangent. Note that this will break the mirrored behavior of the tangents.\\n\\nDelete tangents\\n\\nTo delete both tangents from a control point, hover over and right-click that point, then select Clear Tangents from the contextual popup menu.\\n\\nTo delete just one of the tangents (left or right), hover over and right‑click that tangent's marker, then select Delete Tangent.\\n\\nBreak and mirror\\n\\nBy default, tangents mirror each other. When you drag to adjust one tangent marker, the paired tangent point will move in unison.\\n\\nTo \\\"break\\\" the tangents so that each can be moved independently of the other, hover over and right‑click the associated control point, then select Break Tangents from the contextual menu. Once broken, you can move each tangent marker without affecting the other.\\n\\nTo re-establish mirror behavior, hover over and right‑click the associated control point, then select Mirror Tangents from the contextual menu. Note that you will not see an immediate change in the path after re‑establishing mirror behavior, as the system cannot predict which tangent point you want to begin mirroring. Mirror behavior will resume only once you drag to adjust one of the tangent markers.\\n\\nPath visual properties\\n\\nYou can customize the visual appearance of a Class.Path2D with the following properties:\\n\\n\\n\\n      Property\\n      Description\\n\\n\\n\\n\\n      Class.Path2D.Color3|Color3\\n      Sets the color of the path line.\\n\\n\\n      Class.Path2D.Thickness|Thickness\\n      Sets the thickness of the path line, in pixels.\\n\\n\\n      Class.Path2D.Visible|Visible\\n      Make the path visible or not in both edit and runtime.\\n\\n\\n      Class.Path2D.ZIndex|ZIndex\\n      Order in which a path renders relative to other GUIs.\\n\\n\\n\\n\\n\\n    Thickness = 2Color3 = (125, 125, 125)\\n\\n\\n\\n    Thickness = 10Color3 = (225, 0, 50)\\n\\n\\n\\n    ZIndex layering\\n\\n\\nPath scripting\\n\\nScripting is useful for several path-related workflows. The following examples use methods such as Class.Path2D:GetControlPoints()|GetControlPoints() which returns a table of Datatype.Path2DControlPoint|Path2DControlPoints and Class.Path2D:GetPositionOnCurveArcLength()|GetPositionOnCurveArcLength() which returns the Datatype.UDim2 position at a given t value along the spline.\\n\\nlua title=\\\"Arrange UI Objects Across Path\\\"\\nlocal parent = script.Parent\\nlocal path = parent:FindFirstChildWhichIsA(\\\"Path2D\\\")\\n\\nlocal function arrangeChildren()\\n\\tlocal segmentCount = #path:GetControlPoints()\\n\\tlocal objectsToArrange = {}\\n\\n\\tfor , child in parent:GetChildren() do\\n\\t\\tif child:IsA(\\\"GuiObject\\\") then\\n\\t\\t\\ttable.insert(objectsToArrange, child)\\n\\t\\tend\\n\\tend\\n\\n\\tfor idx, child in objectsToArrange do\\n\\t\\tlocal t = idx / (#objectsToArrange + 1)\\n\\t\\tchild.Position = path:GetPositionOnCurveArcLength(t)\\n\\tend\\nend\\n\\n-- Initially arrange child UI objects across path\\narrangeChildren()\\n\\n-- Listen for children being added/removed to adjust arrangement\\nparent.ChildAdded:Connect(arrangeChildren)\\nparent.ChildRemoved:Connect(arrangeChildren)\\n\\nlua title=\\\"Animate UI Object Along Path\\\"\\nlocal Tweenservice = game:GetService(\\\"TweenService\\\")\\n\\nlocal parent = script.Parent\\nlocal path = parent:FindFirstChildWhichIsA(\\\"Path2D\\\")\\nlocal objectToAnimate = parent:FindFirstChildWhichIsA(\\\"GuiObject\\\")\\n\\nlocal TWEENDURATION = 4\\nlocal TWEENEASINGSTYLE = Enum.EasingStyle.Cubic\\nlocal TWEENEASINGDIRECTION = Enum.EasingDirection.InOut\\n\\nlocal pathSampleValue = Instance.new(\\\"NumberValue\\\")\\nlocal tweenInfo = TweenInfo.new(TWEENDURATION, TWEENEASINGSTYLE, TWEENEASINGDIRECTION, 0, true, 2)\\nlocal tween = Tweenservice:Create(pathSampleValue, tweenInfo, {Value = 1})\\n\\nlocal function onSampleValueChanged()\\n\\tobjectToAnimate.Position = path:GetPositionOnCurveArcLength(pathSampleValue.Value)\\nend\\npathSampleValue.Changed:Connect(onSampleValueChanged)\\n\\ntween:Play()\",\n    \"source\": \"2D-paths.md\"\n}",
    "source": "2D-paths.json"
}