{
    "title": "9-slice",
    "description": "",
    "content": "{\n    \"title\": \"UI 9-slice design\",\n    \"description\": \"UI 9-slice design lets you create UI elements of varying sizes without distorting the borders or corners.\",\n    \"content\": \"When creating UI with custom borders and corners, you'll often need to render elements at different aspect ratios and visually surround localized text or other contents of unknown dimensions.\\nThis lets you create UI elements of varying sizes without distorting the borders or corners.\\n\\n\\n\\n    Without 9-Slice\\n\\n\\n\\n    With 9-Slice\\n\\n\\nUnder the 9-slice approach, one image (a single Roblox image asset) is\\ninternally divided into nine sub-images, each with different scaling rules.\\n\\n\\n\\n            Sub-image\\n            Scaling\\n\\n\\n\\n\\n            1 3 7 9 (corners)\\n            none\\n\\n\\n            2 8 (top/bottom edges)\\n            horizontal\\n\\n\\n            4 6 (left/right edges)\\n            vertical\\n\\n\\n            5 (center)\\n            horizontal + vertical\\n\\n\\n\\nStudio editor\\n\\nSlice configuration is possible by directly setting the Enum.ScaleType and slice properties on an image label or button, but Studio's built-in 9-Slice Editor is more intuitive.\\n\\nOpening the editor\\n\\nTo open the visual 9-Slice Editor in Studio:\\n\\n1. Select an Class.ImageLabel or Class.ImageButton with a valid asset ID entered into its Image field.\\n\\n\\n\\n1. Set the ScaleType property to Slice.\\n\\n\\n\\n1. Click on the SliceCenter property that appears, then click on the ... within the row.\\n\\n\\n\\n1. In the window that opens, 4 red lines overlay the image, representing the edges of the slices. The source image size is also displayed.\\n\\n\\n\\nSet offsets\\n\\nIn Studio, drag the red lines to set the offsets from the left, right, top,\\nand bottom edges of the image.\\n\\nIf you need better precision, enter offset values\\nin the fields on the right side of the editor window.\\n\\nAs you reposition the dragger lines, the UI element automatically updates to show the result.\\n\\n\\n\\n    Slice setup\\n\\n\\n\\n    Result on 500×200 ImageLabel\\n\\n\\n\\n\\n    Slice setup\\n\\n\\n\\n    Result on 500×200 ImageLabel\\n\\n\\nThe offset values are different from the UI object's SliceCenter property values and represent the number of pixels between an edge of the source image and the dragger associated with that side.\",\n    \"source\": \"9-slice.md\"\n}",
    "source": "9-slice.json"
}