{
    "title": "Assemblies",
    "description": "Explains physical assemblies and how they behave in Roblox's rigid body physics engine.",
    "content": "An assembly is one or more parts welded by a rigid Class.WeldConstraint|WeldConstraint or connected through moveable joints, like Class.Motor6D|Motor6Ds. You can group an assembly of parts in a model container to quickly organize the parts and related objects as a single asset.\n\n\n\n    1 assembly; 1 part\n\n\n\n    1 assembly; 18 parts\n\n\n\n    1 assembly; 179 parts\n\n\nFrom a physics perspective, an assembly is considered a single rigid body, meaning no force can push or pull the connected parts from each other, and they will move as a single unit. All forces applied to a specific Class.BasePart are applied to its assembly &mdash; for instance, Class.BasePart:ApplyImpulse() applies impulse to the assembly at Class.BasePart.AssemblyCenterOfMass.\n\nThe joints that combine multiple parts into assemblies are only active in the Class.Workspace or another Class.WorldModel instance. If the parts are stored elsewhere, all of the welds/connections that combine parts into assemblies will be non-functional.\n\nTo view colored outlines around parts in order to visualize single rigid body assemblies, toggle on Assemblies from the Visualization Options widget in the upper‑right corner of the 3D viewport.\n\nAssembly properties\n\nThe following Class.BasePart properties show data regarding its assembly. Their values will be the same for any part in the same assembly, so it doesn't matter which part you use.\n\n\n\t\tProperty\n\t\tDescription\n\n\n\n\t\tClass.BasePart.AssemblyLinearVelocity\n\t\tThe linear velocity vector of the part's assembly. Setting the velocity directly may lead to unrealistic motion, so usage of a Class.VectorForce or Class.LinearVelocity constraint is preferred, or Class.BasePart:ApplyImpulse() for an instantaneous change in linear velocity.\n\n\n\t\tClass.BasePart.AssemblyAngularVelocity\n\t\tThe angular velocity vector of the part's assembly. Setting the velocity directly may lead to unrealistic motion, so usage of a Class.Torque or Class.AngularVelocity constraint is preferred, or Class.BasePart:ApplyAngularImpulse() for an instantaneous change in angular velocity.\n\n\n\t\tClass.BasePart.AssemblyCenterOfMass\n\t\tA read-only position calculated via the mass and position of all the parts in the assembly. A force applied to the center of mass will not cause angular acceleration, only linear.\n\n\n\t\tClass.BasePart.AssemblyMass\n\t\tThe sum of the Class.BasePart.Mass of all parts in the assembly. If the assembly has an anchored part, the assembly's mass is considered infinite.\n\n\n\t\tClass.BasePart.AssemblyRootPart\n\t\tThe part automatically chosen to represent the assembly's root part.\n\n\nAssembly root part\n\nEvery assembly has a root part indicated by its Class.BasePart.AssemblyRootPart|AssemblyRootPart property. This is the part that doesn't move when Class.Motor6D transforms are updated, as well as the part used to keep consistent physics replication and network ownership.\n\nYou cannot explicitly set the root part, but the following factors affect probability from highest to lowest:\n\n\n\n\tAn Class.BasePart.Anchored|Anchored part will always be assigned as the root part.\n\n\n\n\n\tParts with Class.BasePart.Massless|Massless set to false (default) take precedence.\n\n\n\n\n\tHigher Class.BasePart.RootPriority|RootPriority values take precedence.\n\n\n\n\n\tPrecedence based on the part's size, with multipliers for parts with specific names.\n\n\nAnchoring behavior\n\nWhen one of an assembly's parts is anchored, that part becomes the root part and all of the other parts become implicitly anchored with it. The following sequence illustrates this behavior.\n\n1. Below, four parts are welded together with Class.WeldConstraint|WeldConstraints (green bars) to form a single assembly, as indicated by the matching colored outlines.\n\n\n\n     Four parts welded to become a single assembly\n\n\n2. If just one part in the assembly is anchored, the assembly will not change, other than the root part potentially changing (the anchored part always has the highest priority for becoming the root part).\n\n\n\n     Anchored part (as indicated with an anchor icon) becomes the new root part\n\n\n3. If more than one part is anchored, the assembly will split. Below, both the left and top parts are anchored, so the original assembly splits into two assemblies as shown by the colored outlines. Also, the Class.WeldConstraint between the two assemblies deactivates, since you cannot have an active weld between two anchored assemblies.\n\n\n\n     Two assemblies with anchored parts as their respective root parts\n\n\n\n   If you want to anchor all parts in an assembly, you only need to anchor the assembly's root part. Anchoring all parts is actually less performant, as it creates more assemblies.",
    "source": "assemblies.md"
}