{
    "title": "avatar-inspect-menu",
    "description": "",
    "content": "{\n    \"title\": \"Avatar Inspect Menu\",\n    \"description\": \"The Avatar Inspect Menu allows users to view other users' avatars, try on items, make purchases.\",\n    \"content\": \"The Avatar Inspect Menu allows users to view another user's Roblox avatar character, try on items, and even make purchases within an experience. Roblox enables this menu by default and users in your experience can access this menu in three ways:\\n\\n- Opening the experience's main menu and clicking the View button next to a user in the Players tab.\\n- Clicking on a user's name in the player list.\\n- Selecting the Inspect option in the Avatar Context Menu, an opt-in feature which provides additional user-to-user social interaction.\\n\\nYou can customize a user's Avatar Inspect Menu in the following ways:\\n\\n- Change the inspect target from the user's Roblox avatar to their current in-experience appearance.\\n- Change the inspect target to a specific User ID, even if they are not in the experience.\\n\\nFor more specific catalog access, you can also use the Avatar Editor Service to access and make changes to a user's platform-wide avatar within an experience.\\n\\nInspect currently equipped items\\n\\nBy default, the Inspect Menu shows the same information as the user's Roblox Avatar profile page. The avatar outfit may not match the user's current appearance, since you may have opted to equip different accessories or avatar items at that specific moment.\\n\\nIn the cases where the default Inspect Menu may not be accurate to the current character's outfit, you can inspect a character's current outfit with the following steps:\\n\\n1. Disable the default profile-based Inspect Menu by setting Class.GuiService:SetInspectMenuEnabled() with a value of false.\\n2. Get a current Class.HumanoidDescription from the target player character.\\n3. Call Class.GuiService:InspectPlayerFromHumanoidDescription() to load the Inspect menu based off of the Class.HumanoidDescription.\\n\\nUse the following code sample to inspect the currently equipped items of a specific player:\\n\\nlua\\nlocal GuiService = game:GetService(\\\"GuiService\\\")\\nlocal Players = game:GetService(\\\"Players\\\")\\nlocal player = Players.LocalPlayer\\n\\n-- Make profile-based Inspect Menu inaccessible\\nGuiService:SetInspectMenuEnabled(false)\\n\\nlocal humanoid = player.Character and player.Character:FindFirstChildWhichIsA(\\\"Humanoid\\\")\\nif humanoid then\\n\\t-- Get current HumanoidDescription from a player character\\n\\tlocal humanoidDescription = humanoid:GetAppliedDescription()\\n\\n\\t-- Load the inspect menu from a humanoid description\\n\\tGuiService:InspectPlayerFromHumanoidDescription(humanoidDescription, player.Name)\\nend\\n\\nInspect specific users\\n\\nThe Avatar Inspect Menu can inspect players who aren't in the current experience. You can use Class.GuiService:InspectPlayerFromUserId() to inspect a player from any Class.Player.UserId.\\n\\nUse the following code sample to open the Avatar Inspect Menu based on a Class.Player.UserId|UserId:\\n\\nlua\\nlocal GuiService = game:GetService(\\\"GuiService\\\")\\nlocal Players = game:GetService(\\\"Players\\\")\\n\\n-- Get user ID by username\\nlocal success, userId = pcall(function()\\n\\treturn Players:GetUserIdFromNameAsync(\\\"RobloxUser\\\")\\nend)\\n\\nif success then\\n\\tGuiService:InspectPlayerFromUserId(userId)\\nend\",\n    \"source\": \"avatar-inspect-menu.md\"\n}",
    "source": "avatar-inspect-menu.json"
}