{
    "title": "avatar-context-menu",
    "description": "",
    "content": "{\n    \"title\": \"Avatar Context Menu\",\n    \"description\": \"The Avatar Context Menu (ACM) allows users to interact and customize actions with others in their experience.\",\n    \"content\": \"The Avatar Context Menu (ACM) makes it easier for users to interact with each other. When the ACM is enabled in your experience, a user can walk up to another user's character and click on them to open a small menu with several default options. The player can send a connection request, begin a private chat, view the user's profile, or wave.\\n\\nAfter enabling the ACM in your experience, you can customize the ACM in the following ways:\\n\\n- Programmatically open and close the ACM for specific users.\\n- Add custom options and remove existing options to the ACM.\\n- Customize the ACM appearance to create a unique user interface.\\n\\nEnable the Avatar Context Menu\\n\\nThe Avatar Context Menu must be enabled using the Class.StarterGui:SetCore() option \\\"AvatarContextMenuEnabled\\\" in a Class.LocalScript. The ACM is best used in experiences where there is no predefined behavior for clicking on other users.\\n\\nUse the following code sample to enable the ACM in a Class.LocalScript:\\n\\nlua\\n-- Run in a LocalScript, ideally within \\\"StarterPlayerScripts\\\"\\nlocal StarterGui = game:GetService(\\\"StarterGui\\\")\\nStarterGui:SetCore(\\\"AvatarContextMenuEnabled\\\", true)\\n\\nIf you need to detect whether the ACM is enabled, you can use the following code to return a boolean on the current status of the ACM:\\n\\nlua\\n---Returns a boolean indicating if the ACM is currently enabled.\\nStarterGui:GetCore(AvatarContextMenuEnabled)\\n\\nOpen and close the ACM\\n\\nOnce enabled, you can open and close the ACM programmatically with Class.StarterGui.\\n\\nTo programmatically open the ACM, use the following code:\\n\\nlua\\n-- Use StarterGui:SetCore where targetPlayer is a valid Player object\\nStarterGui:SetCore(\\\"AvatarContextMenuTarget\\\", targetPlayer)\\n\\nTo programmatically close the ACM, use the following code:\\n\\nlua\\nStarterGui:SetCore(\\\"AvatarContextMenuTarget\\\", nil)\\n\\nMenu options\\n\\nYou can add and remove actions through scripting. By default, the menu has the following options:\\n\\n\\n    Menu option\\n    Description\\n\\n\\n\\n    Connection\\n    Sends a connection request to the selected user.\\n\\n\\n    Chat\\n    Opens a private conversation with the selected user in the in-experience chat.\\n\\n\\n    View\\n    Opens a window to inspect the selected user's appearance.\\n\\n\\n    Wave\\n    Initiates a wave animation to the selected user.\\n\\n\\nOnce the ACM is open, the user can scroll and select other users on the character selection carousel. Characters are sorted based on distance to the selected character. The menu only updates when opened and the list of available users will repeat when scrolling.\\n\\nAdd menu options\\n\\nOnce enabled, experience-specific actions can be added to the ACM. For example, an experience might allow for trade requests, add-to-party options, or other special interactions.\\n\\nThe following example shows how to add a custom action to the Avatar Context Menu:\\n\\nlua\\nlocal Players = game:GetService(\\\"Players\\\")\\nlocal StarterGui = game:GetService(\\\"StarterGui\\\")\\nlocal player = Players.LocalPlayer\\n\\n-- Connect a function to a \\\"BindableEvent\\\"\\nlocal bindableEvent = Instance.new(\\\"BindableEvent\\\")\\nlocal function onCustomACMAction(targetPlayer)\\n\\t-- At this point, you could call InvokeServer() on a RemoteFunction to alert the server of the selection\\n\\tprint(\\\"ACM event selected by \\\" .. player.Name .. \\\" on \\\" .. targetPlayer.Name)\\nend\\nbindableEvent.Event:Connect(onCustomACMAction)\\n\\n-- Add the ACM option using SetCore() with \\\"AddAvatarContextMenuOption\\\"\\nlocal options = {\\\"Custom ACM Action\\\", bindableEvent}\\nStarterGui:SetCore(\\\"AddAvatarContextMenuOption\\\", options)\\n\\nRemove menu options\\n\\nYou can remove custom and the default Add Friend, Chat, View, and Wave options from the ACM by referencing the custom Action name or the default Enum.AvatarContextMenuOption enum.\\n\\nUse the following code to remove a default and custom menu option:\\n\\nlua\\n-- Remove the \\\"Custom ACM Action\\\" option\\nStarterGui:SetCore(\\\"RemoveAvatarContextMenuOption\\\", \\\"Custom ACM Action\\\")\\n\\n-- Remove the default \\\"Friend\\\" option by referencing the AvatarContextMenuOption.Friend Enum\\nStarterGui:SetCore(\\\"RemoveAvatarContextMenuOption\\\", Enum.AvatarContextMenuOption.Friend)\\n\\nYou can not make edits to the ACM while it is open. Your code should verify that an action is still relevant in case the action was removed from the menu. For example, if a marketplace area adds an option to send trade requests, you should verify both users are still in the marketplace.\\n\\nCustomize menu appearance\\n\\nTo change the appearance of the Avatar Context Menu, call Class.StarterGui:SetCore() with the option \\\"AvatarContextMenuTheme\\\", providing a table of parameters and values to adjust the menu appearance.\\n\\nThe ACM user interface includes the following sections:\\n\\nA. Name Tag: The user name of the character being interacted with.\\n\\nB. Button Frame: Contains all of the ACM buttons.\\n\\nC. Buttons: Individual buttons for the default or custom ACM actions.\\n\\nAppearance parameters\\n\\nThese are the customization parameters with the ACM:\\n\\nBackground\\n\\n\\n    BackgroundColor\\n    A Datatype.Color3 for the overall background of the ACM (most useful when not using a background image).\\n\\n\\n    BackgroundTransparency\\n    Transparency value (0–1) for the overall background of the ACM (most useful when not using a background image).\\n\\n\\n    BackgroundImage\\n    A valid asset ID of an image for the ACM background.\\n\\n\\n    BackgroundImageTransparency\\n    Transparency value (0–1) for the background image.\\n\\n\\n    BackgroundImageScaleType\\n    A Enum.ScaleType enum for background image scaling.\\n\\n\\n    BackgroundImageSliceCenter\\n    A Datatype.Rect specifying the center of a nine-slice image when BackgroundImageScaleType is set to Enum.ScaleType.Slice.\\n\\n\\nName tag\\n\\n\\n    NameTagColor\\n    A Datatype.Color3 for the bar showing which player is being interacted with.\\n\\n\\n    NameUnderlineColor\\n    A Datatype.Color3 for the thin line between the name tag and action buttons.\\n\\n\\nButton frame\\n\\n\\n    ButtonFrameColor\\n    A Datatype.Color3 for the section (frame) containing the action buttons.\\n\\n\\n    ButtonFrameTransparency\\n    Transparency value (0–1) for the button frame section.\\n\\n\\nButton\\n\\n\\n    ButtonColor\\n    A Datatype.Color3 for the background of the ACM action buttons.\\n\\n\\n    ButtonTransparency\\n    Transparency value (0–1) for the background color of the action buttons.\\n\\n\\n    ButtonHoverColor\\n    A Datatype.Color3 for the \\\"hover\\\" state of the action buttons.\\n\\n\\n    ButtonHoverTransparency\\n    Transparency value (0–1) for the \\\"hover\\\" color of the action buttons.\\n\\n\\n    ButtonUnderlineColor\\n    A Datatype.Color3 for the thin line which separates each action button.\\n\\n\\n    ButtonImage\\n    A valid asset ID of an image for the background of buttons.\\n\\n\\n    ButtonImageScaleType\\n    A Enum.ScaleType enum for button image scaling.\\n\\n\\n    ButtonImageSliceCenter\\n    A Datatype.Rect specifying the center of a nine-slice image when ButtonImageScaleType is set to Enum.ScaleType.Slice.\\n\\n\\nText\\n\\n\\n    Font\\n    A Enum.Font enum value for the name tag and button text.\\n\\n\\n    TextColor\\n    A Datatype.Color3 for all text within the ACM.\\n\\n\\n    TextScale\\n    A float value to scale the default text sizes of each element.\\n\\n\\nVarious image\\n\\n\\n    LeaveMenuImage\\n    An asset ID of an image for the ACM close button.\\n\\n\\n    ScrollLeftImage\\n    An asset ID of an image for the carousel \\\"scroll left\\\" button.\\n\\n\\n    ScrollRightImage\\n    A valid asset ID of an image for the carousel \\\"scroll right\\\" button.\\n\\n\\nSelected character\\n\\n\\n    SelectedCharacterIndicator\\n    The Class.MeshPart which floats above a character's head to indicate they are selected.\\n\\n\\nSize and position\\n\\n\\n    Size\\n    A Datatype.UDim2 for the overall size of the ACM.\\n\\n\\n    MinSize\\n    A Datatype.Vector2 specifying the minimum size of the ACM.\\n\\n\\n    MaxSize\\n    A Datatype.Vector2 specifying the maximum size of the ACM.\\n\\n\\n    AspectRatio\\n    A float value specifying the relative width and height of the ACM.\\n\\n\\n    AnchorPoint\\n    The Class.GuiObject.AnchorPoint|AnchorPoint of the ACM.\\n\\n\\n    OnScreenPosition\\n    A Datatype.UDim2 specifying the on-screen position of the ACM (the position where it tweens to when opened).\\n\\n\\n    OffScreenPosition\\n    A Datatype.UDim2 specifying the off-screen position of the ACM (the position where it tweens from/to when opened/closed).\\n\\n\\nExample customization\\n\\nThe following code sample customizes the ACM theme using some basic parameters:\\n\\nlua\\nlocal StarterGui = game:GetService(\\\"StarterGui\\\")\\n\\nStarterGui:SetCore(\\\"AvatarContextMenuTheme\\\", {\\n\\tBackgroundImage = \\\"\\\",\\n\\tBackgroundTransparency = 0.5,\\n\\tBackgroundColor = Color3.fromRGB(111, 145, 242),\\n\\tNameTagColor = Color3.fromRGB(0, 0, 200),\\n\\tNameUnderlineColor = Color3.fromRGB(213, 233, 255),\\n\\tButtonFrameColor = Color3.fromRGB(15, 24, 65),\\n\\tButtonFrameTransparency = 0.2,\\n\\tButtonUnderlineColor = Color3.fromRGB(213, 233, 255),\\n\\tFont = Enum.Font.SciFi\\n})\",\n    \"source\": \"avatar-context-menu.md\"\n}",
    "source": "avatar-context-menu.json"
}