{
    "title": "Script capabilities",
    "description": "Script Capabilities is a system that controls which actions scripts can perform.",
    "content": "This page describes a feature that is still experimental and is available as a client beta. Features described here might undergo additional changes based on developer feedback and/or bug fixes.\n\nScript capabilities is a system that offers control over actions that scripts can perform inside the Class.DataModel subtree. It provides better control over experience scripts rather than being an \"all or nothing\" system where any script can do anything that other scripts can.\n\n- This system lets you limit what models taken from the toolbox can do and makes it easier to include user-generated content inside the experience, even those that contain scripts.\n- It can also help ensure better security of experiences that allow players to run their own code, which is often executed in a restricted or emulated environment.\n- It can also be used to share libraries that restrict what they can do themselves. For example, a library providing additional math methods can be restricted to the smallest set of capabilities it needs so that other developers using that library don't have to validate the entire codebase to make sure it doesn't include malicious code.\n\nEnable script capabilities\n\nTo enable this feature, change the Class.Workspace.SandboxedInstanceMode|SandboxedInstanceMode setting from Default to Experimental in the Explorer.\n\nWhen the client beta test is completed, this step will no longer be required.\n\nSandboxed container\n\nThis system introduces a concept of a sandboxed container.\nAn instance of type Class.Model, Class.Folder, Class.Script, or descendants of any of those classes have a Class.Instance.Sandboxed|Sandboxed property available in the Studio Properties window, under the Permissions section.\n\nEnabling the Class.Instance.Sandboxed|Sandboxed property designates the instance as a sandboxed container inside the Class.DataModel tree, which limits the actions that the scripts inside that container can perform based on the set of values in the Class.Instance.Capabilities|Capabilities property.\n\nCapabilities\n\nThe Capabilities property is a set of values that control different aspects of execution, split into four groups:\n\n- Execution control - Specifies if a script can run on client or server\n- Instance access control - Specifies which Class.DataModel parts a script can interact with\n- Script functionality control - Specifies which Luau functions scripts can call\n- Engine API access control - Specifies which parts of the Roblox Engine API can be used\n\nWhen a script attempts to perform an action that is not in the set of capabilities for the current execution state, an error is reported. Errors typically include the action being attempted, the target of an action, and the first capability that is missing, for example:\n\ntext\nThe current thread cannot modify 'Workspace' (lacking capability AccessOutsideWrite)\n\nThe current thread cannot call 'Clone' (lacking capability CreateInstances)\n\nThe current thread cannot call 'GetSecret' (lacking capability Network)\n\nExecution control\n\nThis set includes two capabilities:\n\n- RunClientScript - Class.LocalScript or Class.Script with a Class.BaseScript.RunContext|RunContext value of Enum.RunContext.Client|Client is allowed to execute on the client\n- RunServerScript - Class.Script with a Class.BaseScript.RunContext|RunContext value of Enum.RunContext.Server|Server  is allowed to execute on the server\n\nIf the script is Class.BaseScript.Enabled|Enabled, but the capability corresponding to the location it attempts to start in is not available, a warning message is displayed in the Output window. If a script wasn't supposed to run in that context, disable or delete it.\n\nNote that Class.ModuleScript|ModuleScripts are not required to have these execution capabilities to be required.\n\nWhen a script fails to start because the execution control capability is missing, it is reported as a warning in the output, for example:\n\ntext\nCannot start server script 'Script' (lacking capability RunServerScript)\n\nInstance access control\n\nThis set includes only a single capability:\n\n- AccessOutsideWrite - Script is allowed to fetch and receive instances from outside the sandboxed container\n\nWhen the capability is not available, the script can only look up instances that are inside its own sandboxed container. For example, if the script is placed directly in the sandboxed container, script.Parent.Parent returns nil.\n\nAdditionally, any Roblox API event that passes in an Class.Instance instead passes in nil for any Class.Instance outside the sandboxed container. For example, if the Class.BasePart.Touched is signalled by a touch from an instance outside the sandboxed container, the event is still received, but the argument is nil.\n\nAvoid setting this capability; sandboxing guarantees are weaker when scripts can interact with any instance in an experience.\n\nAccess to services\n\nEven without AccessOutsideWrite, scripts in the sandboxed container can still access to game, workspace, and services. This access is provided so that scripts can still call useful methods of those globals, like Class.DataModel.GetService, but access to their child instances is still validated.\n\nInternally passed instances\n\nIf an instance is passed through a function call that doesn't go through Roblox APIs, the reference is preserved. However, if a Class.ModuleScript is passed in this way, it can't be required without AccessOutsideWrite. This is because the return of the Class.ModuleScript is often mutable and can be modified by a script in a sandboxed container.\n\nScript functionality control\n\nThis set of capabilities controls some general aspects of scripts:\n\n- AssetRequire - Script is allowed to call Global.LuaGlobals.require with an asset ID\n- LoadString - Script is allowed to call Global.LuaGlobals.loadstring\n- ScriptGlobals - Script has Global.LuaGlobals.shared and Global.LuaGlobals.G available\n- CreateInstances - Script can create new instances using Datatype.Instance.new, Datatype.Instance.fromExisting, or Class.Instance:Clone\n\nKeep in mind that default function restrictions still apply. Even if LoadString is enabled, the experience still has to turn enable it in Class.ServerScriptService, and it is still only available on the server.\n\nTo create new instances, aside from CreateInstances, an additional Engine API capability providing access to that instance is required.\n\nEngine API access control\n\nThis last group of capabilities controls script access to various Engine APIs:\n\n- Basic - Access to simple instances and essential building blocks\n- Audio - Access to instances related to audio APIs\n- DataStore - Access to data store and memory store APIs\n- Network - Access to HTTP networking APIs\n- Physics - Access to instances related to physics\n- UI - Access to instances related to user interfaces\n- CSG: access to instances and functions related to constructive solid geometry (CSG)\n- Chat: access to instances related to in-experience chat\n- Animation: access to instances related to animations\n- Avatar: access to instances related to avatars\n- Input: access to instances related to user input\n- Environment: access to instances related to the control of how the environment is displayed\n- RemoteEvent: access to instances for internal networking operations\n\nThere are also instances that are available without any capabilities aside from being able to execute the scripts. These include the following Class.HttpService methods:\n\n- Class.HttpService:JSONDecode()\n- Class.HttpService:JSONEncode()\n- Class.HttpService:GenerateGUID()\n\nIf an instance property or method is accessed without a required capability, an error is reported describing the missing capability.\n\nFinally, capabilities do not cover every instance in the Roblox Engine today. Instances not listed in this section or the following one are not available for interaction from a sandboxed container and throw an error saying that an Unassigned capability is not available to the current script.\n\nAn additional limitation is that Global.LuaGlobals.getfenv and Global.LuaGlobals.setfenv functions are not available for scripts in a sandboxed container.\n\nOnly script access to instances is limited. The instances themselves can still exist and operate by themselves inside a sandboxed container. Lights still shine, user interfaces are still visible, and audio setups that are already wired play sounds.\n\nEngine API capability assignments\n\nThis feature is currently in the experimental stage, so the assignments of the APIs are not final. The capability of each instance is displayed on the documentation page for that instance.\n\nHere is the list of instances and methods (if different from the instance capability) for each Engine API capability:\n\n- Basic\n  - Class.Attachment\n  - Class.Beam, Class.ParticleEmitter, Class.Smoke, Class.Sparkles, Class.Trail\n  - Class.SurfaceAppearance, Class.Decal, Class.FaceInstance, Class.Texture\n  - Class.Light, Class.PointLight, Class.SpotLight\n  - Class.Part, Class.MeshPart, Class.CornerWedgePart, Class.TriangleMeshPart, Class.TrussPart, Class.WedgePart\n  - Class.FloatCurve, Class.RotationCurve, Class.EulerRotationCurve, Class.Vector3Curve\n  - Class.Tween, Class.TweenService\n  - Class.Wire\n  - Class.WorldModel\n  - Class.CollectionService, Class.Debris, Class.RunService\n\n- Audio\n  - Class.AudioAnalyzer, Class.AudioChorus, Class.AudioCompressor, Class.AudioDistortion, Class.AudioEcho, Class.AudioEqualizer, Class.AudioFader, Class.AudioFader, Class.AudioFilter, Class.AudioFlanger, Class.AudioLimiter, Class.AudioPitchShifter, Class.AudioReverb\n  - Class.AudioEmitter, Class.AudioPlayer\n  - Class.AudioDeviceOutput, Class.AudioListener\n\n- DataStore\n  - Class.DataStore, Class.OrderedDataStore, Class.GlobalDataStore\n  - Class.DataStoreService, Class.MemoryStoreService\n  - Class.DataStoreGetOptions, Class.DataStoreIncrementOptions, Class.DataStoreInfo, Class.DataStoreKey, Class.DataStoreKeyInfo, Class.DataStoreObjectVersionInfo, Class.DataStoreOptions, Class.DataStoreSetOptions\n  - Class.MemoryStoreHashMap, Class.MemoryStoreQueue, Class.MemoryStoreSortedMap\n\n- Network\n  - Class.HttpService:GetAsync, Class.HttpService:RequestAsync, Class.HttpService:PostAsync, Class.HttpService:UrlEncode, Class.HttpService:GetSecret\n\n- Physics\n  - Class.AlignOrientation, Class.AlignPosition, Class.DynamicRotate\n  - Class.JointInstance, Class.Motor, Class.Motor6D\n  - Class.AngularVelocity, Class.LinearVelocity, Class.LineForce, Class.Torque, Class.VectorForce\n  - Class.Weld\n  - Class.Constraint, Class.BallSocketConstraint, Class.CylindricalConstraint, Class.HingeConstraint, Class.NoCollisionConstraint, Class.PlaneConstraint, Class.PrismaticConstraint, Class.RigidConstraint, Class.RodConstraint, Class.RopeConstraint, Class.SlidingBallConstraint, Class.SpringConstraint, Class.TorsionSpringConstraint, Class.UniversalConstraint, Class.WeldConstraint\n\n- UI\n  - Class.BasePlayerGui, Class.PlayerGui, Class.BillboardGui, Class.GuiBase, Class.GuiBase2d, Class.GuiBase3d, Class.LayerCollector, Class.ScreenGui, Class.SurfaceGui, Class.SurfaceGuiBase, Class.UIBase\n  - Class.CanvasGroup, Class.Frame, Class.ScrollingFrame\n  - Class.GuiButton, Class.GuiLabel, Class.GuiObject, Class.ImageButton, Class.ImageLabel\n  - Class.Dialog, Class.DialogChoice, Class.ProximityPrompt\n  - Class.TextBox, Class.TextButton, Class.TextFilterResult, Class.TextFilterTranslatedResult, Class.TextLabel, Class.TextService, Class.GetTextBoundsParams\n  - Class.Path2D\n  - Class.UIComponent, Class.UICorner, Class.UIDragDetector, Class.UIFlexItem, Class.UIGradient, Class.UIGridLayout, Class.UIGridStyleLayout, Class.UILayout, Class.UIListLayout, Class.UIPadding, Class.UIPageLayout, Class.UIScale, Class.UIStroke, Class.UITableLayout\n  - Class.UIConstraint, Class.UIAspectRatioConstraint, Class.UISizeConstraint, Class.UITextSizeConstraint\n  - Class.VideoFrame, Class.ViewportFrame\n\n- CSG\n  - Class.GeometryService\n  - Class.BasePart methods: Class.BasePart:IntersectAsync, Class.BasePart:SubtractAsync, Class.BasePart:UnionAsync\n  - Class.IntersectOperation (also requires Basic), Class.NegateOperation (also requires Basic), Class.PartOperation (also requires Basic), Class.UnionOperation (also requires Basic)\n\n- Chat\n  - Class.BubbleChatConfiguration, Class.BubbleChatMessageProperties\n  - Class.ChannelTabsConfiguration\n  - Class.ChatInputBarConfiguration, Class.ChatWindowConfiguration, Class.ChatWindowMessageProperties\n  - Class.TextChannel, Class.TextChatCommand, Class.TextChatConfigurations, Class.TextChatMessage, Class.TextChatMessageProperties, Class.TextChatService, Class.TextSource\n\n- Animation\n  - Class.Bone (also requires Basic)\n  - Class.Animation, Class.AnimationClip, Class.AnimationClipProvider, Class.AnimationController, Class.AnimationRigData, Class.AnimationTrack, Class.Animator\n  - Class.CurveAnimation\n  - Class.FaceControls, Class.IKControl\n  - Class.Keyframe, Class.KeyframeMarker, Class.KeyframeSequence\n  - Class.MarkerCurve\n  - Class.PoseBase, Class.Pose, Class.NumberPose\n\n- Avatar\n  - Class.Accessory, Class.AccessoryDescription\n  - Class.Accoutrement, Class.Clothing, Class.Shirt, Class.Pants\n  - Class.BaseWrap, Class.WrapDeformer, Class.WrapLayer, Class.WrapTarget\n  - Class.BodyColors, Class.BodyPartDescription, Class.CharacterAppearance, Class.ShirtGraphic\n  - Class.CharacterMesh\n  - Class.Humanoid, Class.HumanoidDescription\n\n- Input\n  - Class.GamepadService, Class.KeyboardService, Class.MouseService\n  - Class.ContextActionService, Class.TouchInputService, Class.UserInputService\n  - Class.InputObject, Class.Mouse, Class.PlayerMouse\n\n- Environment\n  - Class.Atmosphere, Class.Clouds, Class.Lighting, Class.Sky\n  - Class.BloomEffect, Class.BlurEffect, Class.ColorCorrectionEffect, Class.ColorGradingEffect, Class.DepthOfFieldEffect, Class.PostEffect, Class.SunRaysEffect\n\n- RemoteEvent\n  - Class.BaseRemoteEvent, Class.RemoteEvent, Class.UnreliableRemoteEvent\n  - Class.RemoteFunction\n\nInteractions between containers\n\nNested containers\n\nWhen one sandboxed container is nested inside another one, the instances of the inner container are accessible to the outer one.\n\nCapabilities of the inner container are limited by the capabilities of the outer one.\nFor example, if the outer container has capabilities of Basic, Audio and CSG, while the inner container has Basic and Network, only Basic capabilities are available to the inner container at runtime.\n\nIf there are no capabilities in common between the inner and outer containers, the resulting capability set is empty.\n\nBindable functions and events\n\nClass.BindableEvent and Class.BindableFunction provide the best way to communicate with the container or allow it to run callbacks with capabilities it itself is not allowed to use directly.\n\nWhen an event or a function is fired, connections are executed in the context of the function that registered them. This means that if the event or function callback is registered by the sandboxed container, it is called with the capabilities of that container. If the callback is registered by the code outside, when sandboxed container scripts invoke them, they execute your functions with capabilities available to your functions.\n\nIt is important to note that even with the AccessOutsideWrite capability, scripts in sandboxed containers cannot invoke events or functions outside their containers if they have a larger capability set than the container itself.\n\nModule require\n\nInner Class.ModuleScript|ModuleScripts can be required by the sandboxed container as usual.\nHowever, if the target instance is outside the container, the Class.ModuleScript can only be required if the capability set that is available to it is smaller or equal to the capabilities available to the container.\n\nThis limitation does not apply to RunClientScript and RunServerScript capabilities. If the Class.ModuleScript is placed in a container with only RunClientScript but is required from a script that has the RunServerScript capability, it is allowed to succeed and run those functions on the server.\n\nDirectly called functions\n\nIf a Class.ModuleScript in a sandboxed container is required from outside the container, some of the protections are not available. In particular, the target function is able to access all instances available to the caller. If the caller is not in a sandboxed container, the call acts as if AccessOutsideWrite is available to it.\n\nOther capability restrictions still apply. If you have a DataStore access capability, but the target module does not, it is unable to call Class.DataStore methods. However, if you pass your own function working with Class.DataStore, the target can run it during that call.\nIf the target schedules a thread using methods like those from Library.task, those threads lose the ability to call that function.\n\nInstances can be passed to the target module or assigned to the module fields.\n\nIf required, it is recommended to assign table members using Global.LuaGlobals.rawset to avoid running index/newindex metamethods that might be set on the table.\n\nThe overall recommendation is to communicate with Class.BindableEvent and Class.BindableFunction whenever possible.\n\nMovement of instances\n\nMost instances do not have restrictions on movement between containers. Script instances, however, can only be moved into a container that has the same set of capabilities or a subset of those capabilities.\n\nThis means that sandboxed container with AccessOutsideWrite cannot just re-parent a script inside itself to outside and get more capabilities.",
    "source": "capabilities.md"
}