{
    "title": "creation",
    "description": "",
    "content": "{\n    \"title\": \"Creation overview\",\n    \"description\": \"Learn everything you need to know about creating on Roblox.\",\n    \"content\": \"Learn everything you need to know about creating on Roblox.\\n\\nIf you're new to developing Roblox experiences, read these guides for a tour of\\nRoblox creation before diving into the product documentation and tutorials.\\n\\nThe Roblox platform\\n\\nRoblox is free-to-use for both users and creators and spans a broad\\ndemographic with different user behaviors than other social platforms. Learn\\nwhat makes Roblox unique and what to think about before creating.\\n\\nOverview\\nLearn about our unique platform and values.\\n\\n  Learn more\\n\\nThe Roblox user base\\nLearn what characterizes\\nthe Roblox audience, and what social and cultural factors you should consider when developing on the platform.\\n\\n  Learn more\\n\\nDesigning for Roblox\\nDiscover some common practices from successful experiences and find out how to tailor your designs to the unique characteristics of Roblox.\\n\\n  Learn more\\n\\nExperiences\\n\\nExperiences are the 3D worlds that you create and publish in Roblox. Learn how\\nthey technically work, so you understand how to build the best experiences\\npossible for your users.\\n\\nRoblox projects\\nUnderstand how to\\nbuild projects in Roblox Studio and publish them as experiences on Roblox.\\n\\n  Learn more\\n\\nWork with assets\\nUnderstand how to upload assets to the\\nRoblox cloud and how to use them in your projects.\\n\\n  Learn more\\n\\nThe data model\\nUnderstand the data model, the underlying definition\\nof how places in your 3D experiences look and function.\\n\\n  Learn more\\n\\nClient-server runtime\\nUnderstand how your experiences run in the Roblox Cloud.\\n\\n  Learn more\\n\\n3D workspace\\nThe 3D workspace is where you define all objects that are rendered by Roblox.\\n\\n  Learn more\\n\\nScripting\\nLearn how to script logic for your Roblox experiences.\\n\\n  Learn more\\n\\nCharacters\\nUnderstand how character models work for NPCs and Players in Roblox.\\n\\n  Learn more\\n\\nCustom models and meshes\\nUnderstand how to use Blender and other tools to create custom 3D objects.\\n\\n  Learn More\\n\\nRoblox Studio\\n\\nStudio is an all-in-one IDE that lets you create on Roblox. You build projects\\nthat you can later publish as experiences to Roblox and also use Studio to\\ncreate characters and accessories.\\n\\nStudio overview\\nLearn about Studio, the all-in-one IDE for Roblox.\\n\\n  Learn more\\n\\nUI overview\\nLearn about the Studio UI and all the features and tools that are available.\\n\\n  Learn more\\n\\nDiscovery and monetization\\n\\nWith tens of millions daily active users, there's many ways to monetize\\nand grow your creations.\\n\\nPromoting on Roblox\\nDiscover how experiences are commonly promoted on Roblox and how you can spend your budget most appropriately.\\n\\n  Learn more\\n\\nEarning on Roblox\\nLearn about monetization options and strategies on the platform along with associated considerations for developers.\\n\\n  Learn more\\n\\nAvatars\\n\\nLearn how to build character models and accessories in 3rd party tools like Blender and Maya and sell them on the Marketplace. See Avatars for creation guides, technical specifications, and additional resources.\",\n    \"source\": \"creation.md\"\n}",
    "source": "creation.json"
}