{
    "title": "CurveAnimation",
    "description": "",
    "content": "{\n    \"title\": \"CurveAnimation\",\n    \"description\": \"\",\n    \"content\": \"This file is automatically generated. Please don't edit it manually.\\nTo submit a bug report on the content, see\\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\\n\\nname: CurveAnimation\\ntype: class\\nmemorycategory: Instances\\nsummary: |\\n  Stores animation data in the form of curves for each individual channel to\\n  animate.\\ndescription: |\\n  CurveAnimation is a subtype of Class.AnimationClip consumed by Roblox's\\n  animation system. It stores animation data for each animated channel in a rig\\n  as a separate, individual curve. For example, CurveAnimation stores the\\n  position channel for an articulated joint as a Class.Vector3Curve, and it\\n  might store the rotation channel as a Class.EulerRotationCurve or\\n  Class.RotationCurve.\\n\\n  #### Structure\\n\\n  CurveAnimation stores curves in a hierarchical manner, matching the\\n  hierarchy of the structure of Class.Motor6D|Motor6Ds or Class.Bone|Bones\\n  in the animated model. Under each CurveAnimation instance lies a hierarchy\\n  of Class.Folder instances representing animated joints in the model. Under\\n  each such folder instance, several possible instances may exist. An instance\\n  named Position of type Class.Vector3Curve can drive the local translation\\n  of the Class.Motor6D or Class.Bone on the animated model, while an\\n  instance named Rotation of type Class.EulerRotationCurve or\\n  Class.RotationCurve can drive the local rotation of the Class.Motor6D or\\n  Class.Bone on the animated model.\\n\\n  #### Partial matching of hierarchy\\n\\n  You can match partial hierarchies to a model when playing a CurveAnimation\\n  in Roblox's animation system. This means that not all joints need to be\\n  present in the hierarchy for the existing joints to apply properly.\\n  Furthermore, you can match hierarchies in a \\\"relative\\\" manner. For example,\\n  the first child Class.Folder instance root can be UpperTorso and the\\n  animation system matches that to any existing sub-hierarchies in the model.\\n\\n  #### Animating miscellaneous channels\\n\\n  CurveAnimation can also animate other numerical values in a model. For\\n  example, you can animate FACS controls for facial animations by creating a\\n  Class.Folder under the CurveAnimation instance named after an existing\\n  Class.FaceControls instance in the model. Then, to animate individual facial\\n  controllers, you can store individual Class.FloatCurve instances named after\\n  the animated Class.FaceControls property.\\n\\n  #### Usage when making animations\\n\\n  As with other Class.AnimationClip types such as Class.KeyframeSequence,\\n  you must first upload CurveAnimation instances to Roblox before playing\\n  them. If you want to preview an animation before uploading it to Roblox, you\\n  can generate a temporary ID using\\n  Class.AnimationClipProvider:RegisterAnimationClip(); this generates a hash\\n  ID that you can use for localized animation testing.\\n\\n  If you want to download the CurveAnimation corresponding to an existing\\n  uploaded animation using Luau scripts, use\\n  Class.AnimationClipProvider:GetAnimationClipAsync().\\ncodesamples: []\\ninherits:\\n  - AnimationClip\\ndescendants: []\\ntags: []\\ndeprecationmessage: ''\\nproperties: []\\nmethods: []\\nevents: []\\ncallbacks: []\",\n    \"source\": \"CurveAnimation.yaml\"\n}",
    "source": "CurveAnimation.json"
}