{
    "title": "Choose between cloud services",
    "description": "When to use standard data stores, ordered data stores, memory stores, secrets stores, and configs.",
    "content": "Roblox offers several options for data storage. Each storage option has pros and cons and is appropriate for different use cases. This table summarizes the available options and provides the closest points of comparison from standard web services.\n\n| Service | Persistence | Scope | In-experience access | Cloud comparison |\n| :--- | :--- | :--- | :--- | :--- |\n| Data stores | Permanent | Cross-server | Read-write | NoSQL database |\n| Memory stores | 45 day maximum | Cross-server | Read-write | In-memory cache |\n| Configs | Permanent | Cross-server | Read-only | App configuration and feature flags |\n| Secrets stores | Permanent | Cross-server | Read-only | Secrets management |\n| Luau in-memory | Session duration | Single server | Read-write | Server RAM |\n\nWithin Roblox experiences, cloud services are only accessible from server scripts.\n\nWhen to use data stores\n\nClass.DataStoreService stores long-term data that needs to last between sessions, such as user progress or inventory items. Data stores are consistent per experience, so every server for every place within an experience can access and change the same data. There are two types of data stores: standard and ordered.\n\n- Standard data stores can store data like numbers, strings, and tables that don't need to be ranked or sorted. They store data as key-value pairs; each entry is stored under a key that is unique within its data store and that you can retrieve, update, or delete. For more information, see Data stores.\n\n- Ordered data stores can only store numbers. Each entry is stored under a key that is unique within its data store and that you can retrieve, update, or delete. You can rank and sort this data numerically and retrieve it in ascending or descending order based on stored numerical values. For more information, see Ordered data stores.\n\n\n  Standard data stores\n  Ordered data stores\n\n\n    Data type\n    Numbers, strings, booleans, and tables.\n    Only numbers.\n\n\n    Common use cases\n    User progress, inventory items, and experience settings.\n    All-time, persistent ranking systems and leaderboards. Unlike leaderboards in memory stores, this leaderboard data is permanent.\n\n\n    Past version backup\n    Automatically manages previous versions of your data for 30 days.\n    Does not manage previous versions of your data.\n\n\nIf you want to add granular permission control to your data stores and access them outside of Studio or Roblox servers, use the Open Cloud APIs for data stores.\n\nWhen to use memory stores\n\nClass.MemoryStoreService is a high throughput and low latency service that stores temporary data that needs to be updated or accessed frequently, such as global leaderboards or matchmaking queues. With memory stores, every server for every place within an experience can access and change the same data quickly and frequently. Data in a memory store expires after a certain period of time, up to 45 days.\n\nIf you need to quickly read (not write to) a small number of values across all servers, configs are the better choice. Memory stores are not as performant as configs when frequently accessing a single key or partition.\n\nAlthough memory stores store temporary data, they also support permanent features like a global marketplace. The marketplace is permanent, but the items for sale inside it have an expiration date.\n\n\n  Memory stores\n\n\n    Data type\n    Numbers, strings, booleans, and tables that don't need to persist for over 45 days.\n\n\n    Common use cases\n    Skill-based matchmaking, match states for multiplayer experiences.\n\n\n    Daily and monthly leaderboards.\n\n\nWhen to use configs\n\nConfigs let you update in-game variables in real time without restarting servers. They are ideal for feature flags and any in-game values you hope to tune over time or experiment with.\n\n- Configs are read-only from within an experience—you modify them on Creator Hub or in Roblox Studio—so they don't serve the same use cases as data stores and memory stores.\n- Changes to configs deploy over the course of five minutes; changes to data and memory stores are more instantaneous.\n\n\n  Configs\n\n\n    Data type\n    Numbers, strings, booleans, and JSON objects.\n\n\n    Common use cases\n    Enabling a new dungeon, disabling a limited-time game mode, starting a holiday event.\n\n\n    Enemy health, weapon damage, item prices, experience multipliers, welcome messages.\n\n\nWhen to use secrets stores\n\nUse the secrets store for your experience to store any API keys, passwords, and access tokens that you use to authenticate with external services. Storing these values in a data store presents unnecessary security risks.\n\n\n  Secrets stores\n\n\n    Data type\n    Strings.\n\n\n    Common use cases\n    API keys, passwords, and access tokens for analytics or music services.\n\n\nWhen to use in-memory storage in Luau\n\nUse in-memory storage in Luau to store temporary data that needs to be accessed with minimal latency and without the cost of making external service calls. This storage is built into Luau and requires no setup.\n\n\n  In-memory storage in Luau\n\n\n    Data type\n    Numbers, strings, booleans, and tables.\n\n\n    Common use cases\n    Data that is only relevant to a single server session and doesn't need to be persisted, such as status effects or temporary points that reset when the user leaves the experience.\n\n\n    Values that change frequently, like counters, timers, state flags, or a health bar.\n\n\n    Data that drives game logic, which needs to be accessible instantly, like temporary variables or an enemy's current health.",
    "source": "data-stores-vs-memory-stores.md"
}