{
    "title": "Style Editor",
    "description": "Explore the built-in Style Editor, a comprehensive tool that allows you to create, manage, and apply UI styles for Roblox experiences.",
    "content": "The built-in Style Editor is a comprehensive tool that allows you to create, manage, and apply UI styles for Roblox experiences through a combination of tokens, design sheets, style rules, and themes.\n\nAccess the Style Editor via the UI tab.\n\nOnce open, click the Create Design button to generate a base style set.\n\nCreating a design style set through the Style Editor generates a BaseStyleSheet inside a Design folder within Class.ReplicatedStorage. This base sheet syncs specific engine‑level defaults like the Datatype.Color3 default of [163, 162, 165] with defaults that come from insertion workflows in Studio. It's highly recommended that you do not delete or attempt to modify the base style sheet — instead, build tokens and style rules around a design sheet to match your UI goals.\n\nAdditionally, a StyleSheet sheet is generated in the Design folder which contains a Class.StyleDerive to the base style sheet. If you choose to remove that Class.StyleDerive, unstyled values for Class.GuiObject|GuiObjects may become unexpected values, for example a default Class.GuiObject.Size|Size of 0, 0, 0, 0.\n\nStyle tokens\n\nStyle tokens, defined through attributes of a token Class.StyleSheet, represent UI property variables that can be used across styles and components; for example, there could be a common color for a Class.Frame.BackgroundColor3, Class.TextLabel.TextColor3, and Class.UIStroke.Color. Tokens are comparable to CSS variables.\n\nAlthough not required for UI styling, tokens are highly recommended for extensible UI design and style updates over time. You should begin by creating the following tokens to understand how they tie into other aspects of universal styling.\n\n1. Create a new token style sheet:\n\n   1. In the left column of the Style Editor, hover over Tokens, click the &CirclePlus;, and select New Token StyleSheet.\n   2. Rename the new sheet to TokenSheet.\n\n\n\n2. With the new token sheet selected, create several tokens by clicking Add a Token… in the main panel. These tokens will be used throughout this guide for both rules and themes.\n\n\n\n\n\t   Token Name\n\t   Type\n\t   Value\n\n\n\n\n       Gold\n       Datatype.Color3\n       #ffcc00\n\n\n       Magenta\n       Datatype.Color3\n       #ff0099\n\n\n       Orange\n       Datatype.Color3\n       #dd6030\n\n\n       Oswald\n       Datatype.Font\n       Oswald\n\n\n       Rad20\n       Datatype.UDim\n       0, 20\n\n\n       RectL\n       Datatype.UDim2\n       0, 300, 0, 160\n\n\n       SquareL\n       Datatype.UDim2\n       0, 200, 0, 200\n\n\n       Text24\n       number\n       24\n\n\n       Text32\n       number\n       32\n\n\n\n\n\n\nDesign sheets\n\nA design style sheet aggregates style rules and can be linked to Class.DataModel trees to apply style properties to UI instances. Only one Class.StyleSheet can apply to a given tree, although you can use themes to swap related styles across your UI, a concept covered later in this guide.\n\nA prepopulated design sheet named StyleSheet is created via the Create Design button. It contains class rules for common UI objects such as Class.Frame and Class.TextLabel. It also contains two Class.StyleDerive instances which derive (inherit) tokens and styles from the base style sheet for use in your custom styling configurations.\n\nOnce you have a design sheet, you can set up a test on‑screen container to use with the Style Editor, or an in‑experience container if desired.\n\n1. Hover over Class.StarterGui in the Explorer and insert a Class.ScreenGui.\n2. Confirm that a new Class.StyleLink instance appears under the Class.ScreenGui with its Class.StyleLink.StyleSheet|StyleSheet property set to the StyleSheet design sheet.\n\n\n\n\n\n\n\n\n\n\n\n   If the Class.StyleLink is not created, you can quickly create one by selecting the Class.ScreenGui in the Explorer as well as the StyleSheet design sheet in the left column of the Style Editor. Then, click the Insert StyleLink button in the upper‑right section of the editor's main panel.\n\n\nStyle rules\n\nStyle rules apply to every instance that matches the rule's Class.StyleRule.Selector|Selector definition to match characteristics such as class name, instance tag, and hierarchy relationships. At a high level, instance matching and modification via a rule's Class.StyleRule.Selector|Selector definition operates through:\n\n- Roblox class selectors which target all instances of a given UI class, for example Class.Frame, Class.ImageLabel, Class.TextButton, etc.\n- Instance tag selectors that target specific UI objects tagged through Class.CollectionService.\n- Instance modifiers applied through phantom Class.UIComponent|UIComponents such as Class.UICorner or Class.UIStroke.\n- Class.GuiObject state selectors which correspond to one of the four Enum.GuiState enum values such as Enum.GuiState.Hover|Hover.\n- Instance name selection according to the value of the UI object's Class.Instance.Name.\n\nClass rule\n\nA style class selector targets all instances of a given UI class. The following rule setup styles all Class.Frame|Frames with a uniform background color and size.\n\n1. In the left column of the Style Editor, select Frame in the UI Elements branch.\n\n\n\n2. Link two previously created style tokens to two Class.Frame properties:\n\n\n\n\n\t   Property\n\t   Style Token\n\n\n\n\n       Class.Frame.BackgroundColor3|BackgroundColor3\n       $Magenta\n\n\n       Class.Frame.Size|Size\n       $SquareL\n\n\n\n\n   1. Click Add a Property… in the main panel and select the necessary property. Note that you can type keywords to more quickly find properties in the dropdown menu.\n   2. Instead of entering a static value, click the ⋮ button and select Link Token.\n   3. Click the $ which appears in the value field and select the proper associated token.\n\n\n\n\n\n\n\n3. Insert a new Class.Frame into the Class.ScreenGui you previously created and linked. The styles you defined should automatically apply to it.\n\n\n\nTag rule\n\nInstance tag selectors target specific UI objects tagged through Class.CollectionService. The following rule setup styles a Class.TextButton tagged as ButtonPrimary with a custom background color, font, and text size.\n\n1. In the left column of the Style Editor, hover over the StyleSheet sheet, click the ⋮ button, and navigate through to New ⟩ Tag.\n\n\n\n2. Rename the new tag rule .ButtonPrimary (note the leading .).\n\n\n\n3. Link three previously created style tokens to three Class.TextButton properties:\n\n\n\n\n\t   Property\n\t   Style Token\n\n\n\n\n       Class.TextButton.BackgroundColor3|BackgroundColor3\n       $Gold\n\n\n       Class.TextButton.FontFace|FontFace\n       $Oswald\n\n\n       Class.TextButton.TextSize|TextSize\n       $Text32\n\n\n\n\n   1. Click Add a Property… in the main panel and select the necessary property. Remember that you can type keywords to more quickly find properties in the dropdown menu.\n   2. Instead of entering a static value, click the ⋮ button and select Link Token.\n   3. Click the $ which appears in the value field and select the proper associated token.\n\n\n\n\n\n\n\n4. Insert a new Class.TextButton into the Class.ScreenGui you previously created and linked and tag it as ButtonPrimary. A convenient shortcut is as follows:\n\n   1. Make sure the new Class.TextButton is selected in the Explorer.\n   2. With the .ButtonPrimary tag rule selected in the left column of the Style Editor, click Apply Tag in the main panel. The styles you defined should automatically apply to the button.\n\n\n\n\n\n\n\nUI modifier\n\nInstance modifier selectors apply phantom Class.UIComponent|UIComponents such as Class.UICorner or Class.UIStroke to further style an object. The following rule setup styles a Class.TextLabel with a custom text size and rounded corners.\n\n1. In the left column of the Style Editor, select TextLabel in the UI Elements branch.\n\n\n\n2. Link a previously created style token to the Class.TextLabel.TextSize|TextSize property:\n\n   1. Click Add a Property… in the main panel and select the Class.TextLabel.TextSize|TextSize property. Remember that you can type keywords to more quickly find properties in the dropdown menu.\n   2. Instead of entering a static value, click the ⋮ button and select Link Token.\n   3. Click the $ which appears in the value field and select the $Text32 token.\n\n\n\n\n\n\n\nA pseudo instance is required to configure and apply rounded corners to other elements. To create one:\n\n1. In the left column, hover over TextLabel, click the ⋮ button, and navigate through to New ⟩ Pseudo Instance ⟩ UICorner.\n\n\n\n   A new UICorner pseudo instance appears under the TextLabel element in the left column.\n\n\n\n2. With the new UICorner instance selected in the left column, link a previously created style token to the Class.UICorner.CornerRadius|CornerRadius property:\n\n   1. Click Add a Property… in the main panel and select the Class.UICorner.CornerRadius|CornerRadius property.\n   2. Instead of entering a static value, click the ⋮ button and select Link Token.\n   3. Click the $ which appears in the value field and select the $Rad20 token.\n\n\n\n3. Insert a new Class.TextLabel into the Class.ScreenGui you previously created and linked. The styles you defined should automatically apply to it.\n\n\n\nState rule\n\nClass.GuiObject state selectors correspond to one of the four Enum.GuiState|GuiState enum values such as Enum.GuiState|Hover, letting you automatically configure style changes for interactive states. The following rule setup creates a hover state of -4 degrees rotation for all Class.ImageButton|ImageButtons.\n\n1. In the left column of the Style Editor, select ImageButton in the UI Elements branch.\n\n\n\n2. Click the ⋮ button and navigate through to New ⟩ GuiState ⟩ Hover.\n\n\n\n\t A new Hover state modifier instance appears under the ImageButton element in the left column.\n\n\n\n3. With the new Hover modifier selected in the left column, click Add a Property… in the main panel and select Class.ImageButton.Rotation|Rotation. Remember that you can type keywords to more quickly find properties in the dropdown menu.\n4. Enter -4 in the property's value field.\n\n\n\n5. Insert a new Class.ImageButton into the Class.ScreenGui you previously created and linked. When you hover over the button in the viewport, it should rotate 4 degrees counterclockwise.\n\n\n\nStyle themes\n\nStyle themes consist of sets of specific tokens that can be swapped, for example color tokens that define a \"light\" and \"dark\" theme.\n\nTheme creation\n\nFor extensibility, themes are organized into folders. While a single folder may suffice for most purposes, you're free to organize themes in folders like \"colors\" or \"fonts\" if desired.\n\n1. Create a new theme folder:\n\n   1. In the left column of the Style Editor, hover over Themes, click the &CirclePlus;, and select New Theme.\n   2. Rename the new Folder item to General.\n\n\n\n2. Create a new theme style sheet:\n\n   1. Hover over the new General folder, click the ⋮ button, and select New Theme StyleSheet.\n   2. Rename it to ThemeA.\n\n\n\nTheme tokens\n\nOnce a theme is constructed, you can link its tokens to various UI object properties such as the Class.TextButton.BackgroundColor3|BackgroundColor3 of a Class.TextButton. Theme sheets must use a common set of tokens to work correctly.\n\nWith ThemeA selected in the left column of the Style Editor:\n\n1. Link three previously created style tokens to three new theme tokens:\n\n\n\n\n\t   Theme Token\n\t   Style Token\n\n\n\n\n       BackColor\n       $Gold\n\n\n       ButtonFont\n       $Oswald\n\n\n       ButtonTextSize\n       $Text32\n\n\n\n\n   1. Click Add a Token… in the main panel and enter the theme token's name.\n   2. Click the $ which appears in the value field and select the associated style token.\n\n\n\n2. In the left column of the Style Editor, select TextButton in the UI Elements branch.\n\n\n\n3. Link the theme's tokens to three new Class.TextButton properties:\n\n\n\n\n\t   Property\n\t   Theme Token\n\n\n\n\n       Class.TextButton.BackgroundColor3|BackgroundColor3\n       $BackColor\n\n\n       Class.TextButton.FontFace|FontFace\n       $ButtonFont\n\n\n       Class.TextButton.TextSize|TextSize\n       $ButtonTextSize\n\n\n\n\n   1. Click Add a Property… in the main panel and select the necessary property.\n   2. Instead of entering a static value, click the ⋮ button and select Link Token.\n   3. Click the $ which appears in the value field and select the proper theme token.\n\n\n\n\n\t When linking the theme's tokens, look for \\$\\[Token\\] in ThemeA in the hover‑over to know the token is coming from the theme and not from the global token sheet (remember that the theme already derives the global tokens).\n\n\n\n\n\nTheme duplication\n\nOnce you have a theme generally established, you can duplicate it and change various tokens to define a unique theme style.\n\n1. In the left column of the Style Editor, hover over the ThemeA theme, click the ⋮ button, and select Duplicate.\n2. Rename the duplicated theme to ThemeB.\n\n\n\n3. Link two of the theme's tokens to two different style tokens:\n\n\n\n\n\t   Theme Token\n\t   Style Token\n\n\n\n\n       BackColor\n       $Magenta\n\n\n       ButtonTextSize\n       $Text24\n\n\n\n\n   1. To the right of the property's value field, click the ⋮ button and select Unlink Token.\n   2. Click ⋮ again and select Link Token.\n   3. In its value field, click the $ and select the new associated style token.\n\n\n\nTheme swapping\n\nOnce you have multiple themes, you can swap between them via the theme's folder, or via a script as outlined in Class.StyleSheet:SetDerives()|SetDerives().\n\n1. In the left column of the Style Editor, select the General folder in the Themes branch.\n2. In the main panel, swap between the themes using the radio buttons.",
    "source": "editor.md"
}