{
    "title": "Emotes",
    "description": "Emotes are character animations used through chat commands, or accessing the emotes menu.",
    "content": "Emotes are expressive character animations that are accessible by using chat commands (\"/e cheer\") or by accessing the emotes menu on the top right of any experience. All users have access to default emotes, such as dance, point, and cheer. Additional avatar emotes can be purchased and equipped from the Marketplace.\n\nIn your experience, you can perform the following emote customizations:\n\n- Open and close a user's emotes menu programmatically.\n- Add or remove emotes options from a user's menu.\n- Disable access to the menu.\n- Play an emote, targeting a specific user character.\n\nEmotes menu\n\nYou can open and close a user's emote menu manually, customize the menu to display specific emotes, or disable the menu completely.\n\nOpen and close\n\nTo manually open or close a player's emote menu, call Class.GuiService:SetEmotesMenuOpen() with a boolean value of true or false.\n\nThe following code sample will open the emotes menu for the user:\n\nlua\n-- Open the emote Menu\nlocal GuiService = game:GetService(\"GuiService\")\nGuiService:SetEmotesMenuOpen(true)\n\nIf you need to detect whether the emotes menu is open, call Class.GuiService:GetEmotesMenuOpen(). This returns a boolean indicating the menu's current state.\n\nAdd and remove emotes\n\nCustomize the emote menu by setting emotes from the catalog and then equipping emotes to a Class.Humanoid. Set emotes with the Class.HumanoidDescription:SetEmotes() method and equip up to 8 emotes to the emotes menu using Class.HumanoidDescription:SetEquippedEmotes().\n\nUse the following code sample in a Class.LocalScript within the Class.StarterCharacterScripts folder to set and equip emotes in your experience:\n\nlua\nlocal Players = game:GetService(\"Players\")\nlocal humanoid = Players.LocalPlayer.Character.Humanoid\nlocal humanoidDescription = humanoid.HumanoidDescription\n\n-- Set custom emotes within a table\nlocal emoteTable = {\n  [\"Hello\"] = {3576686446},\n  [\"Stadium\"] = {3360686498},\n  [\"Tilt\"] = {3360692915},\n  [\"Shrug\"] = {3576968026},\n  [\"Salute\"] = {3360689775},\n  [\"Point\"] = {3576823880}\n}\nhumanoidDescription:SetEmotes(emoteTable)\n\n-- Equip emotes in a specific order\nlocal equippedEmotes = {\"Hello\", \"Stadium\", \"Tilt\", \"Shrug\", \"Salute\", \"Point\"}\nhumanoidDescription:SetEquippedEmotes(equippedEmotes)\n\nKey names, such as \"Shrug\" or \"Salute\" are customizable and will appear to the player as written. Emotes will also show up in the order they were set, starting at the top of the wheel and continuing clockwise.\n\nDisable\n\nDisable the emotes menu with Class.StarterGui:SetCoreGuiEnabled(). Disabling the emotes menu will not prevent emotes from being performed with a chat command.\n\nThe following sample code will disable the emotes menu:\n\nlua\nlocal StarterGui = game:GetService(\"StarterGui\")\nStarterGui:SetCoreGuiEnabled(Enum.CoreGuiType.EmotesMenu, false)\n\nIn addition to disabling the menu, you can disable loading of user-owned emotes by setting the Class.StarterPlayer.UserEmotesEnabled property within StarterPlayer ⟩ Character to false. This specific property can only be set in Studio and cannot be set by scripts.\n\nPlay emotes\n\nTo manually play an emote that a character has in its Class.HumanoidDescription, call Class.Humanoid:PlayEmote(), passing the string name of the emote. This call will return true to indicate that the emote was played successfully, or false otherwise.\n\nUse the following code sample to play the Shrug emote:\n\nlua\nlocal Players = game:GetService(\"Players\")\nlocal humanoid = Players.LocalPlayer.Character.Humanoid\n\nhumanoid:PlayEmote(\"Shrug\")",
    "source": "emotes.md"
}