{
    "title": "Animation events",
    "description": "Animation Events are markers across the timeline span in the Animation Editor.",
    "content": "You can define animation event markers across the timeline span and use\nClass.AnimationTrack:GetMarkerReachedSignal()|GetMarkerReachedSignal()\nto detect those markers as the animation runs.\n\nShow events\n\nBy default, the event track isn't visible. To show the event track:\n\n1. Navigate to the right of the timeline, then click the Gear icon.\n   A pop-up menu displays.\n\n\n\n2. Select Show Animation Events. This opens the Animation Events bar directly below the media and\n   playback controls.\n\n\n\nYou can now create, detect, and\nduplicate events.\n\nCreate events\n\nEvent markers are visual indicators of where an animation event begins. After you create an event\nmarker, you can move it to any frame position on the timeline.\n\nTo create a new event marker:\n\n1. Navigate to the timeline, then click-and-drag the scrubber to the\n   frame position where the event should occur.\n2. Navigate to the event track, then click the Edit Animation Events\n   button. The Edit Animation Events dialog displays.\n\n\n\n3. In the Edit Animation Events dialog, click + Add Event, then enter an\n   event name.\n\n\n\n4. (Optional) In the Parameter field, enter a parameter string for the event.\n5. Click the Save button. In the events bar within the timeline, a new\n   marker symbol displays at the frame position.\n\n\n\nDetect events\n\nTo detect animation events in a Class.LocalScript,\nconnect a function to the Class.AnimationTrack:GetMarkerReachedSignal()|GetMarkerReachedSignal() function of Class.AnimationTrack. For example:\n\nlua\nlocal Players = game:GetService(\"Players\")\n\nlocal player = Players.LocalPlayer\nlocal character = player.Character or player.CharacterAdded:Wait()\nlocal humanoid = character:WaitForChild(\"Humanoid\")\nlocal animator = humanoid:WaitForChild(\"Animator\")\n\n-- Create new \"Animation\" instance\nlocal walkAnim = Instance.new(\"Animation\")\n-- Set its \"AnimationId\" to the corresponding animation asset ID\nwalkAnim.AnimationId = \"rbxassetid://5432167890\"\n\n-- Load animation onto the animator\nlocal walkAnimTrack = animator:LoadAnimation(walkAnim)\n\n-- Connect \"GetMarkerReachedSignal\" event to a specific named keyframe\nwalkAnimTrack:GetMarkerReachedSignal(\"FootStep\"):Connect(function(paramString)\n\tprint(paramString)\nend)\n\nYou can specify a Parameter value for any event\nmarker within the Animation Editor. This lets you pass a custom string\n(single value, comma-separated string, etc.) to the Class.AnimationTrack:GetMarkerReachedSignal()|GetMarkerReachedSignal() function, as illustrated by the paramString argument in the code example above. This string can then be parsed or converted, if necessary, and used for whatever action you wish to perform in the event.\n\nDuplicate events\n\nAs you create events, they become available for usage throughout the whole\nanimation, not only at the frame position where you originally created them. For\ninstance, you can create a \"FootStep\" event marker at the point where a\ncharacter's left foot touches down, then use the same event when the\ncharacter's right foot touches down.\n\nTo duplicate an event:\n\n1. Navigate to the timeline, then click an event marker in the event bar.\n\n\n\n2. Press CtrlC (⌘C on Mac).\n3. Click-and-drag the scrubber to the frame position where you want to\n   duplicate the event.\n4. Press CtrlV (⌘V on Mac).\n\n\n\nIf the original event uses a parameter\nbut the duplicated event should use a modified parameter, perform the following\nsteps:\n\n1. Right-click the duplicated event marker. A pop-up menu displays.\n2. Select Edit Animation Event. The Edit Animation Events dialog\n   displays.\n3. Make your changes, then click the Save button.\n\nYou can also duplicate events by clicking the Edit Animation Events button (just as if you were creating a new event), clicking Add Event in the pop-up menu, selecting the desired event from the dropdown, and clicking Save.",
    "source": "events.md"
}