{
    "title": "Get started with experiences on Roblox",
    "description": "Learn how to create Roblox experiences with guides, tutorials, and code samples.",
    "content": "Roblox is a 3D creation platform that provides an all-in-one IDE that includes\nthe Roblox Engine, a client emulator, and all the tools and APIs you need to\nstart creating Roblox experiences.\n\n\n\n\n\n\n    Get Studio and take the tour\n    Get acclimated with Studio by downloading and\n    launching the onboarding tour.\n\n\n\n\n\n\n\n\n\n\n    Create your first experience\n    Create a simple 3D platformer while learning important Roblox building and scripting concepts.\n\n\n      Create\n\n\n\n\n\n\n\n\n\n\n\n    Learn about the platform\n    Roblox is designed for mega-scale, 3D worlds. Learn about how it works!\n    Overview\n    For Unity Developers\n    For Unreal Developers\n\n\n\nPlay and create with templates\n\nRoblox Studio has a variety of templates that you can edit and play without prior\nknowledge. Give them a try and add on to them when you're ready!\n\n\n\n\n\n\n    Platformer\n    Build your own 3D platformer with customizable platforms, coin pickups, and double-jump, dashing, rolling, and long jump character mechanics!\n\n\n      Play\n\n\n\n\n\n\n\n\n\n\n\n    Laser tag\n    Build your own first-person shooter with customizable blasters, round systems, and modular building assets to reconfigure a high-quality arena!\n\n\n      Play\n\n\n\n\n\n\n\n\n\n\n\n    Racing\n    Build your own kart racer with a customizable driving mechanics, checkpoints, and modular winding track pieces that you can restructure for countless courses!\n\n\n      Play\n\n\n\n\n\n\nLearn with curriculum paths\n\nTo dive deeper, follow along with guided curriculum\nthat teaches you the skills you need to create and monetize your experiences.\n\n\n\n\n\n\n    Environmental art\n    Environmental Art teaches you how to create a high-quality environment for a laser tag experience.\n\n\n        Create\n\n\n\n\n\n\n\n\n\n\n\n    Gameplay scripting\n    Gameplay Scripting teaches you how to organize and implement the scripting logic for large, complex project.\n\n\n        Create\n\n\n\n\n\n\n\n\n\n\n\n    UI Design\n    UI Design teaches you how to plan and implement UI components for unique user flows.\n\n\n        Create\n\n\n\n\n\n\nConnect\nLearn, share, and interact with the Roblox community in the following places.\n\n\n\n\n  On forums\n  Staff announcements\n  Staff articles\n    Community tutorials\n  Community help and feedback\n\n\n\n\n  On social video channels\n   YouTube channel\n  Content and events platform",
    "source": "experiences.md"
}