{
    "title": "Experience ownership transfer",
    "description": "Transfer ownership of an experience to other Roblox users or groups.",
    "content": "With experience ownership transfer, you can transfer your experiences to groups you have publish access to. This unlocks all of the features available to groups, including permissions and revenue management, and allows you to efficiently manage your content as your team scales and your priorities shift.\n\nPrerequisites\n\nBefore making a transfer or accepting a transfer, you must first:\n\n- Verify your email address.\n- Upload your private Class.ModuleScript|ModuleScripts and Class.InsertService|InsertService asset usages to the group you're transferring the experience to. If the experience uses packages where the package owner is a user and not a group, you might have to recreate those packages or replace them with packages that are already owned by a group.\n\nAs a best practice, if you're using Open Cloud API keys for the experience, create an API key as the new owner with the name RobloxTransferApiKey. During the transfer, the relevant scopes are added to this new key and removed from the original key. You can then use a feature flag to allow your backend services to start using the new key after the transfer is complete.\n\nTransfer an experience\n\nTo transfer an experience to a group:\n\n1. Go to Creations and choose the experience you want to transfer.\n2. Go to Configure ⟩ Settings.\n3. Click Initiate ownership transfer.\n4. In the Transfer Details dialog, carefully read and acknowledge the implications of the transfer. Then, click Next.\n5. Select a group to transfer the experience to. You must be able to publish experiences to this group.\n6. Verify the transfer by entering the experience name.\n7. Click Initiate transfer. The Content Settings page updates to include the pending group's username.\n\n\n   Once the group accepts the transfer, Roblox makes your experience private and closes all servers associated with it. The transfer process typically completes in a few minutes but may take longer for complex experiences.\n\n\n\n   To cancel a pending transfer, click Cancel transfer request in the Content Settings page.\n\n\nReceive a transferred experience\n\nTo receive a transferred experience:\n\n1. Go to the experience page of the experience you're receiving. You can navigate to this page by clicking the transfer request notification you received when the experience's current owner initiated the transfer, or by directly getting the overview page link from the current owner.\n2. In the Transfer Details dialog, carefully read and acknowledge the implications of the transfer. Then, click Next.\n3. Verify the transfer by entering the experience name.\n4. Click Accept transfer.\n\n\n   Once your group accepts the transfer, Roblox makes the experience private and closes all servers associated with it. The transfer process typically completes in a few minutes but may take longer for complex experiences.\n\n\n5. After the transfer to your group is complete, set up any new permissions you need and make the experience public again.\n\nFrequently asked questions\n\nWhat kind of information does the transferred experience retain?\n\nThe transferred experience retains its old experience ID, place ID, and URL.\n\nDo transfer requests expire?\n\nYes, transfer requests expire after 7 days.\n\nHow often can the same experience be transferred?\n\nAfter receiving a transferred experience, you must wait 30 days to transfer that experience again.\n\nCan changes be made to an experience that's transferring?\n\nYou can continue making changes to the experience until the new group owner accepts the transfer and the transfer process begins. Changes you make during the active transfer process specifically aren't carried over.\n\nWhat happens to credit card information when an experience is transferred?\n\nRoblox removes credit card information when you transfer an experience.\n\nWhat happens to revenue from private server subscriptions when an experience is transferred?\n\nThe group you transferred your experience to receives the revenue from any existing private server subscriptions. This revenue does not respect any group or experience revenue splitting.\n\nNew private server subscriptions respect revenue splitting.\n\nDoes transferring an experience impact discovery?\n\nTransferring an experience doesn't impact search as long as the experience title remains the same, the new group owner is not a moderated account, and the experience is made public again after the transfer.\n\nNote that transferring an experience can impact discovery for up to 24 hours after the new group owner makes the experience public again.",
    "source": "experience-ownership-transfer.md"
}