{
    "title": "Extended Services",
    "description": "Extended Services is a platform that lets you manage your free and paid services.",
    "content": "Extended Services is a solution that lets you manage service usage and payment beyond Roblox's default limits.\n\nEligibility requirements\n\nTo use Extended Services, your Roblox account must:\n\n- Be ID-verified and 18+ years old.\n- Be located in a supported country.\n- Have a valid email address associated with it.\n- Not currently be banned or moderated.\n- Accept and comply with the terms of service.\n\n  For group accounts, only the group owner needs to meet the eligibility requirements.\n\nUnlock Extended Services\n\nIf you meet all of the eligibility requirements, you can finish setting up Extended Services by entering your account details and payment information. For group-owned experiences, only the group owner can unlock Extended Services and onboard the experience onto it.\n\nTo unlock and use Extended Services:\n\n1. In the Creator Dashboard, go to Creations and select an experience.\n2. Go to Extended Services.\n3. If you haven't entered your account details and payment information yet, click Add missing information on the top banner.\n    1. Enter your account information. The Account type, Tax ID type, and Tax ID fields are optional.\n        - You can also go to Finances ⟩ Account Information under the Extended Services section to manage your account information. You don't need to update anything else on this page.\n    2. Click Next.\n    3. Enter a payment method. You can enter a new payment method or select from the available payment options already associated with your Roblox account.\n        - You can also go to Finances ⟩ Payments to add new payment methods, or go to Finances ⟩ Billing to set a new default payment method.\n    4. Click Save.\n\nAccount status\n\nYour Extended Services account can be in one of the following statuses:\n\n  Status\n  Description\n  Required action\n\n\n    Normal\n    You can use all Extended Services features.\n    No action is required.\n\n\n    Overdue\n    Your account is overdue because your automatic payment method failed. Roblox offers a grace period of seven days before suspending your Extended Services account.\n    Change your payment method and retry a manual payment, or wait until Roblox attempts to charge your payment method again after the grace period has ended.\n\n\n    Suspended\n    You can't use any paid Extended Services. You can, however, still use services with default limits.\n    Fix your eligibility requirements, add a valid payment method, or manually pay the overdue balance on your account.\n\n\nEnable a service\n\nTo enable a service:\n\n1. Go to Extended Services.\n2. Toggle on the service you want to enable.\n3. Enter a monthly budget for each applicable resource under the service. The minimum monthly budget you can set is $0.50 USD.\n\nYour payment method is charged either at the end of the month when a bill is generated, or when your usage reaches $10 USD, whichever comes first.\n\nYou can increase or decrease a service's monthly budget any time. Your service is automatically throttled if you decrease your budget to an amount below your current month-to-date usage, or if you exceed the budget you have set.\n\nRoblox notifies you by email when your usage reaches 80% of your budget, and then again when it reaches 100%.\n\nManage billing\n\nTo access the Extended Services billing dashboard:\n\n1. Go to Finances ⟩ Billing.\n2. Select the Cloud services tab to display the following:\n    - Your pending balance, including month-to-date cost\n    - Your billing history, including all Extended Services billing activity across your experiences\n\nFor a detailed breakdown of your current pending balance costs, click View Details next to your payment method. For a detailed invoice of a previous bill, click View Bill under Billing history.\n\nService pricing\n\nSee the following table for Extended Services pricing:\n\n\n    Service\n\n    Default\n    Extended\n\n\n\n    Memory stores\n    Requests\n    1000 + (CCU x 120) requests per minute\n    $0.003 / 1M requests\n\n\n\n    Storage\n    64KB + (CCU x 1.2KB)\n    $0.10 / GB per hour&sup1;\n\n\n\n    Text-to-speech\n    Requests\n    1 + (CCU x 6) requests per minute\n    $5.00 / 1M requests\n\n\n\n    Speech-to-text\n    Requests\n    1 + (CCU x 5) requests per minute\n    $1 / 1M requests\n\n\n\n    Standard data stores (coming soon)\n    Get\n    250 + (CCU  40) requests per minute\n    $0.08 / 1M requests\n\n\n\n    Set\n    250 + (CCU  20) requests per minute\n    $0.80 / 1M requests\n\n\n\n    List\n    10 + (CCU  2) requests per minute\n    $0.60 / 1M requests\n\n\n\n    Remove\n    100 + (CCU  40) requests per minute\n    $0.80 / 1M requests\n\n\n\n    Ordered data stores (coming soon)\n    Get\n    250 + (CCU  40) requests per minute\n    $0.08 / 1M requests\n\n\n\n    Set\n    250 + (CCU  20) requests per minute\n    $0.25 / 1M requests\n\n\n\n    GetSorted\n    100 + (CCU  2) requests per minute\n    $0.32 / 1M requests\n\n\n\n    Remove\n    100 + (CCU  40) requests per minute\n    $0.25 / 1M requests\n\n\n\n    Data store storage (coming soon)\n    Storage\n    100 MB + (1MB  Lifetime Players) GB per month\n    $0.12 / GB per month\n\n\n&sup1; GB per hour = the storage consumption multiplied by the amount of time. For example, 100GB hours might equate to \"100GB x 1 hour\" or \"200GB x 0.5 hours\".\n\nSupported countries\n\nExtended Services is available in the following countries:\n\n\n\n      Country\n\n\n\n\n      Australia\n      Germany\n      Poland\n\n\n      Austria\n      Hong Kong\n      Portugal\n\n\n      Belgium\n      Hungary\n      Romania\n\n\n      Brazil\n      Ireland\n      Singapore\n\n\n      Bulgaria\n      Italy\n      Slovakia\n\n\n      Croatia\n      Latvia\n      Slovenia\n\n\n      Cyprus\n      Lithuania\n      South Africa\n\n\n      Czechia\n      Malta\n      Spain\n\n\n      Denmark\n      Mexico\n      Sweden\n\n\n      Estonia\n      Netherlands\n      Switzerland\n\n\n      Finland\n      New Zealand\n      Thailand\n\n\n      France\n      Norway\n      United States",
    "source": "extended-services.md"
}