{
    "title": "FileMesh",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: FileMesh\ntype: class\nmemorycategory: BaseParts\nsummary: |\n  The FileMesh object applies a mesh to a Class.BasePart when parented to it.\n  Its properties are inherited by the Class.SpecialMesh object.\ndescription: |\n  The FileMesh object applies a textured mesh to a Class.BasePart when\n  parented to it. Its properties are inherited by the Class.SpecialMesh\n  object.\n\n  ## What is a FileMesh?\n\n  FileMeshes allow user uploaded meshes to be applied to a Class.BasePart. The\n  mesh that is applied is dependent on the Class.FileMesh.MeshId property. A\n  texture can also be applied to this mesh using Class.FileMesh.TextureId.\n\n  Although it is not an abstract class, and can be used by developers, all\n  Class.FileMesh properties are inherited by the Class.SpecialMesh object. A\n  Class.SpecialMesh behaves identically to the FileMesh object when its\n  Class.SpecialMesh.MeshType is set to 'FileMesh'. Although both objects are\n  functional, the Class.SpecialMesh object is the official supported class.\n\n  For more information on using meshes, please see the Class.SpecialMesh page.\ncodesamples:\n  - FileMesh-Offset-and-Scale\ninherits:\n  - DataModelMesh\ndescendants:\n  - SpecialMesh\ntags: []\ndeprecationmessage: ''\nproperties:\n  - name: FileMesh.MeshId\n    summary: |\n      The MeshId is the content ID of the mesh that is to be displayed.\n    description: |\n      The MeshId is the content ID of the mesh that is to be displayed.\n\n      The content ID for a mesh is generated when a developer uploads a mesh to\n      Roblox.\n    codesamples:\n      - Mesh-VertexColor\n    type: ContentId\n    tags: []\n    deprecationmessage: ''\n    security:\n      read: None\n      write: None\n    threadsafety: ReadSafe\n    category: Data\n    serialization:\n      canload: true\n      cansave: true\n    capabilities:\n      - Basic\n  - name: FileMesh.TextureId\n    summary: |\n      The TextureId is the content ID of the texture that is to be applied to\n      the mesh.\n    description: |\n      The TextureId is the content ID of the image that is to be applied to used\n      for the meshes texture. When the TextureId property is set to an empty\n      string, no texture will be applied to the mesh.\n\n      #### How can I change the texture of a mesh?\n\n      Using the TextureId property, the texture of a mesh can be changed without\n      having to reupload the mesh. To do this, a new image will need to be\n      uploaded to Roblox with the desired texture. The original texture image\n      file can be obtained by exporting the mesh using the 'Export Selection'\n      option in Roblox Studio. The image file will be saved alongside the\n      exported .obj file.\n\n      The new texture can then be re-uploaded to Roblox as a Decal and its\n      content ID can be applied to the mesh using the TextureId property.\n\n      #### How can I make a textured mesh?\n\n      A mesh can only be textured if the mesh has been UV mapped. UV mapping\n      refers to the practice of projecting a texture map onto a mesh. This\n      cannot be done using Roblox Studio and has to be done using an external 3D\n      modelling application such as [Blender][1].\n\n      [1]: https://www.blender.org/\n    codesamples:\n      - Mesh-VertexColor\n    type: ContentId\n    tags: []\n    deprecationmessage: ''\n    security:\n      read: None\n      write: None\n    threadsafety: ReadSafe\n    category: Data\n    serialization:\n      canload: true\n      cansave: true\n    capabilities:\n      - Basic\nmethods: []\nevents: []\ncallbacks: []",
    "source": "FileMesh.yaml"
}