{
    "title": "Gamepad input",
    "description": "Explains how to accept input from USB gamepads, such as Xbox and PlayStation controllers.",
    "content": "import ControllerEmulator from '../includes/studio/controller-emulator.md'\n\nRoblox accepts input from gamepads such as Xbox and PlayStation controllers. To simplify cross‑platform inputs, including gamepads, Roblox provides the Input Action System to define actions such as \"jump,\" \"sprint,\" or \"shoot\" and set up bindings for multiple hardware inputs to drive those actions.\n\nWhen binding gamepad inputs, see common control schemas to create a consistent gamepad experience for players. After inputs are set, you can enhance the player's experience by including haptic feedback on supported controllers.\n\nAs you build out support for gamepads, remember to test frequently using a connected gamepad or the Controller Emulator in Studio.\n\nInput type detection\n\nIn cross‑platform development, it's important that you determine and respond to the Class.UserInputService.PreferredInput|PreferredInput type a player is using, normally to ensure that UI elements like on-screen buttons and menus work elegantly and support interaction across devices.\n\nFor example, a console assumes that gamepads are the default input, but a player on PC or laptop may also choose to connect a bluetooth gamepad. In this case, mouse/keyboard remains a valid input for that player, but you can assume they want to switch to the connected gamepad as the primary input type.\n\nSee input type detection for more information.\n\nFor alternative gamepad detection methods, see the Class.UserInputService.GamepadEnabled property and the Class.UserInputService.GamepadConnected|GamepadConnected/Class.UserInputService.GamepadDisconnected|GamepadDisconnected events.\n\nCommon control schemas\n\nWhen considering specific control bindings for the Input Action System, it's best to establish consistency across different experiences. The following input bindings will help players immediately feel familiar and comfortable with gamepad controls.\n\n\n    Input\n    Common use cases\n\n\n\n    Enum.KeyCode|ButtonA\n    Accepts player prompts or GUI selections. Alternatively used for primary actions such as jumping.\n\n\n    Enum.KeyCode|ButtonB\n    Cancels player prompts or GUI selections. Alternatively used for secondary actions such as a dodge, roll, or sprint.\n\n\n    Enum.KeyCode|Thumbstick1\n    Generally associated with character movement.\n\n\n    Enum.KeyCode|Thumbstick2\n    Generally associated with camera movement.\n\n\n    Enum.KeyCode|ButtonL2, Enum.KeyCode|ButtonR2\n    Generally used for primary actions, such as shooting.\n\n\n    Enum.KeyCode|ButtonL1, Enum.KeyCode|ButtonR1, Enum.KeyCode|ButtonX, Enum.KeyCode|ButtonY\n    Secondary actions such as reloading, targeting, or accessing an inventory or minimap.\n\n\n\n\n\n\n\n\n\nHaptic feedback\n\nMany gamepad controllers have motors built in to provide haptic feedback. Adding rumbles and vibrations can greatly enhance a player's experience and provide subtle feedback beyond visuals or audio.\n\nRoblox supports haptics for PlayStation gamepads, Xbox gamepads, and the Quest Touch controller. Haptic feedback is managed through Class.HapticEffect instances which can be set to a specific Class.HapticEffect.Type|Type such as Enum.HapticEffectType|GameplayCollision or Enum.HapticEffectType|UIClick.\n\nOnce a Class.HapticEffect is in place, you can initiate it through the Class.HapticEffect:Play()|Play() method, for instance:\n\nlua\nlocal Workspace = game:GetService(\"Workspace\")\n\nlocal effect = Instance.new(\"HapticEffect\")\neffect.Type = Enum.HapticEffectType.GameplayExplosion\neffect.Parent = Workspace\n\n-- Play the haptic effect\neffect:Play()\n\nController emulation",
    "source": "gamepad.md"
}