{
    "title": "Matchmaking glossary",
    "description": "Glossary of matchmaking terms.",
    "content": "General terms\n\n\n\n\n    Joining player\n    The player being matched to a server in your experience.\n\n\n    Common device\n    The device type shared between existing players in the server and the joining player. Can be a mobile device, a desktop, a laptop, a tablet, or a console.\n\n\n    Common language\n    The language shared between existing players in the server and the joining player.\n\n\n\n    Scoring\n\n\n\n\n    Server\n    An RCC instance hosting a place.\n\n\n    Signal weight\n    A non-negative number that describes the importance of a signal relative to other signals.\n\n\n    Weighted sum\n    The sum of all weighted signal scores for a server. The basis for picking the best server for a player.\n\n\n    Server score\n    The final matchmaking score for a server, based on the weighted sum of its signals. Players are matched to the server with the highest score.\n\n\n    Weighted signal score\n    The value after multiplying the signal score by its weight.\n\n\n\n    Signals\n\n\n\n\n    Signal\n    The processed version of an attribute. A signal is created when an attribute is transformed to fit the matchmaking scoring system.\n\n\n    Signal score\n    The value of a signal after transformations, ranging between 0 and 1.\n\n\n    Weight\n    Describes the importance of a signal in the scoring process. Signals with higher weights have a bigger impact in matchmaking.\n\n\n    Weighted signal score\n    The result of multiplying a signal's score by its weight. Reflects both the value and importance of the signal.\n\n\n    Numerical custom signal\n    The difference between the joining player's attribute and the server's average.\n\n\n    Categorical custom signal\n    How common the joining player's attribute is when compared to the other players in the server.\n\n\n\n    Attributes\n\n\n\n\n    Attribute\n    A property used in matchmaking scoring. Represents “raw signal values” before they're processed.\n    Can be a number or a string.\n\n\n    Custom attribute\n    A universe-level property defined by creators. Can be a player attribute or a server attribute.\n\n\n    Player attribute\n    A characteristic of a player, like their preferred game mode or skill level.\n\n\n    Server attribute\n    A characteristic of a server, like the server's response time or active game mode.",
    "source": "glossary.md"
}