{
    "title": "Usage guidelines",
    "description": "Important guidelines for using the in-experience text chat feature.",
    "content": "In-experience text chat is any message created within your experience that originated from one user and is delivered to one or more other users, including:\n\n- Chat bubbles over an avatar's head\n- Direct messages between users\n- Chat window communication between users\n- Team-specific messages\n\nFor sending and delivery, these types of communications must each go through a Class.TextChannel instance. This ensures messages respect privacy settings, are visible to moderators, and are properly text-filtered.\n\nCertain text is not considered chat:\n\n- Text on menus created by developers (for example, \"Press any button to continue.\")\n- Status updates from the experience (for example, \"Two minutes remaining!\")\n- Announcements from admin commands\n- A user renaming their pet dog\n- A user writing on a sign\n- Moderation audit logs or messages\n- Comments on posts in an experience\n\n\n  If the comments support a reply feature, these replies would be considered a conversation and thus subject to this policy.\n\n\n- Writing a post on a bulletin board\n- Any user-generated text unrelated to a conversation\n\nFor communication shared by users that can be seen by other users, even if it doesn't need to go through Class.TextChatService, you must ensure it goes through a text filter. It's recommended to add a rate limit of 1 minute for any UGC text field that might be used by players to conduct a conversation. See rate‑limited text inputs for an example on how to set up rate limiting for text input fields.\n\nRequirements\n\n- All experiences that offer in-experience text chat for users must integrate Class.TextChatService, per the Misusing Roblox Systems Community Standard. For information on migrating from the legacy chat system, see the Roblox Developer Forum and Migrate from legacy chat.\n- All incoming text that originates from another user must first use Text filtering before your experience displays it.\n\n  If users repeatedly send messages that violate community standards, Roblox warns and then temporarily prevents them from sending messages. To learn more, see Text Chat Nudge FAQ.\n\n- Communication between users must respect user privacy settings.\n  - Class.TextChannel:SendAsync() handles basic privacy and parental settings automatically.\n  - Class.TextChannel:SetDirectChatRequester() must be used to mark Class.TextChannel|TextChannels created for direct chat.\n- In-experience communication should be reportable for abuse. Class.TextChannel|TextChannels handle this automatically.\n\nRespect privacy settings\n\nUsers can have different levels of access to communication features based on their privacy and content maturity settings or parental controls. Some users might have additional restrictions or constraints depending on which app store they used to install Roblox or their local laws.\n\nThe following methods respect these requirements. Use them within your experience to determine how to handle messaging requests:\n\n- Class.TextChannel:SetDirectChatRequester()\n- Class.TextChatService:CanUserChatAsync()\n- Class.TextChatService:CanUsersChatAsync()\n- Class.TextChatService:CanUsersDirectChatAsync()",
    "source": "guidelines.md"
}