{
    "title": "Highlighting objects",
    "description": "Highlighting objects lets you call attention to specific objects within your experience.",
    "content": "The Class.Highlight instance is a visual effect which you can use to call attention to a specific object within an experience. Every highlight effect has a silhouette outline that surrounds the object and a solid overlay\ninterior that displays over the object. You can customize both of these components independently to modify the highlight's visual appearance.\n\n\n\n    Base object\n\n\n\n    Yellow outline and black interior\n\n\n\n    Black outline and yellow interior\n\n\nUseful applications of the highlight effect include:\n\n- Providing visual feedback that an object is important and/or interactable.\n- Making distant objects visible through objects that are closer to the user.\n- Indicating the current position and status of other characters.\n\nAdd highlights\n\nAs a performance limit, Studio only displays 31 simultaneous Class.Highlight instances on the client-side at a time. If you add more than this limit, the additional Class.Highlight instances are silently ignored.\n\nNote also that highlights on low-end devices may be more pixelated but will otherwise look the same as on other devices with any combination of settings.\n\nParent to objects\n\nTo add a highlight effect to an object, you can parent a new Class.Highlight directly to the object.\n\n1. In the Explorer window, hover over either a Class.Model or a Class.BasePart, then click the &CirclePlus; button. A contextual menu displays.\n2. From the menu, insert a Highlight. The highlight displays on the object with its default property values that create a white outline and a red tint overlay.\n\n\n\nSet the adornee\n\nAlternatively, you can place the Class.Highlight instance outside of a child/parent relationship either within the workspace, Class.StarterPlayer, Class.StarterGui, Class.StarterPack, or Class.ReplicatedStorage, then set its Class.Highlight.Adornee|Adornee property to the Class.Model or Class.BasePart that you want to highlight.\n\nCustomize highlights\n\nYou can change the properties of a Class.Highlight instance to create interesting visual effects that properly highlight objects in theme with your experience.\n\nOutlineColor\n\nThe Class.Highlight.OutlineColor|OutlineColor property sets the Datatype.Color3 value of the highlight's outline.\n\n\n\n    OutlineColor = [255, 100, 50]\n\n\n\n    OutlineColor = [0, 255, 125]\n\n\n\n    OutlineColor = [75, 150, 255]\n\n\nOutlineTransparency\n\nThe Class.Highlight.OutlineTransparency|OutlineTransparency property sets the visibility of the highlight's outline to any value between the default value of 0 (opaque) and 1 (invisible).\n\n\n\n    OutlineTransparency = 0\n\n\n\n    OutlineTransparency = 1\n\n\nFillColor\n\nThe Class.Highlight.FillColor|FillColor property sets the Datatype.Color3 value of the highlight's interior.\n\n\n\n    FillColor = [255, 100, 50]\n\n\n\n    FillColor = [0, 255, 125]\n\n\n\n    FillColor = [75, 150, 255]\n\n\nFillTransparency\n\nThe Class.Highlight.FillTransparency|FillTransparency property sets the visibility of the highlight's interior to any value between the default value of 0 (opaque) and 1 (invisible). You can use this property to determine how much of the object's existing color you want viewers to see.\n\n\n\n    FillTransparency = 0\n\n\n\n    FillTransparency = 0.5\n\n\n\n    FillTransparency = 1\n\n\nDepthMode\n\nThe Class.Highlight.DepthMode|DepthMode property controls how the effect displays with respect to other objects in the world.\n\n- Enum.HighlightDepthMode.AlwaysOnTop|AlwaysOnTop — Allows the highlight to display regardless if there are objects between the camera and the highlighted object. This means the viewer is always able to see the highlight regardless of what is between the highlighted object and the camera.\n\n- Enum.HighlightDepthMode.Occluded|Occluded — Hides the highlight if there are objects between the camera and the highlighted object. This means the viewer is only able to see the object if there are no obstructing objects between the highlighted object and the camera's view.\n\nEnabled\n\nThe Class.Highlight.Enabled|Enabled property allows you to quickly enable or disable the highlight without any impact on performance.\n\nWhile a disabled Class.Highlight doesn't display, it still takes one of the 31 available Class.Highlight slots. If you plan to permanently disable a Class.Highlight instance, it's best to delete the highlight rather than disable it.\n\nPerformance tips\n\nWhile you have a lot of options to customize Class.Highlight instances, the following tips are recommended to increase your experience's performance on all devices:\n\n- Adding or removing a Class.Highlight can cause a geometry rebuilding step that might lead to performance spikes and extra draw calls. If you want to change a Class.Highlight instance's appearance or temporarily hide/display it on an object, it's best to customize the properties of the Class.Highlight instance directly, as changing any property of the Class.Highlight instance is lightweight and doesn't impact performance.\n\n- Roblox draws objects in a back to front order, which can cause problems if you embed objects with a child Class.Highlight inside other objects that also have children Class.Highlight instances. For this reason, it's best to keep objects with Class.Highlight instances outside of a parent/child relationship with other objects with Class.Highlight instances.\n\n- The first Class.Highlight rendered on the screen incurs most of the performance cost (up to 1 millisecond of GPU time on mobile devices). For additional highlights beyond the first, you should not see a significant performance impact on any platform.\n\n- On mobile devices, highlights are more costly on performance when they cover more of the screen. On other platforms, highlights have the same performance cost regardless of their screen coverage.\n\n- On all platforms, highlights that are not visible on the screen (whether disabled or fully transparent) incur no performance cost.",
    "source": "highlighting.md"
}