{
    "title": "Hinge",
    "description": "HingeConstraint allows its two attachments to rotate about one axis, with optional assigned power for motor or servo behavior.",
    "content": "For an overview on creating, visualizing, and simulating mechanical constraints, including Class.HingeConstraint, see Mechanical constraints. Also see Roblox units to understand how Roblox units compare to metric units.\n\nA Class.HingeConstraint\nallows its two attachments to rotate about one axis, forcing them into\nthe same position and X axis alignment. This constraint can also be\npowered to behave like a motor or servo, and you can set limits to restrict the hinge's rotational range.\n\nOrientation of a hinge's attachments affects how it rotates. To ensure rotation occurs around the desired axis, each attachment's Class.Attachment.Axis|Axis, visualized by the yellow arrow, should point in the same direction.\n\nAngular power\n\nIf a hinge's Class.HingeConstraint.ActuatorType|ActuatorType is set to Enum.ActuatorType|Motor, it attempts to rotate the attachments with the goal of reaching its Class.HingeConstraint.AngularVelocity|AngularVelocity. You can further control this rotation through both Class.HingeConstraint.MotorMaxAcceleration|MotorMaxAcceleration and Class.HingeConstraint.MotorMaxTorque|MotorMaxTorque.\n\nIf a hinge's Class.HingeConstraint.ActuatorType|ActuatorType is set to Enum.ActuatorType|Servo, it attempts to rotate to an angle specified by Class.HingeConstraint.TargetAngle|TargetAngle. This rotation is controlled by both Class.HingeConstraint.AngularSpeed|AngularSpeed and Class.HingeConstraint.ServoMaxTorque|ServoMaxTorque.\n\n\n\n    ActuatorType = Motor\n\n\n\n    ActuatorType = Servo\n\n\nLimits\n\nYou can set limits to restrict the rotation of a hinge, useful for mechanisms like doors which should only swing open or closed within a set range. Enabling the Class.HingeConstraint.LimitsEnabled|LimitsEnabled property exposes the Class.HingeConstraint.LowerAngle|LowerAngle and Class.HingeConstraint.UpperAngle|UpperAngle limits, as well as Class.HingeConstraint.Restitution|Restitution which defines the elasticity of the attachments when they reach either limit.",
    "source": "hinge.md"
}