{
    "title": "In-experience HTTP requests",
    "description": "Use HttpService to send HTTP requests to third-party web services and Open Cloud.",
    "content": "You can use Class.HttpService to send generic HTTP requests to third-party web services for use cases like analytics, data storage, or error logging. Class.HttpService also supports certain Open Cloud endpoints.\n\nEnable HTTP requests\n\nThe Class.HttpService:GetAsync(), Class.HttpService:PostAsync(), and Class.HttpService:RequestAsync() methods aren't enabled by default. To send requests, you must Allow HTTP Requests under Experience Settings for your experience.\n\nUse in plugins\n\nYou can use Class.HttpService in Studio plugins to check for updates, download content, or other business logic. The first time a plugin attempts to use the service, the user might be prompted to give the plugin permission to communicate with the particular web address. Users can accept, deny, and revoke these permissions at any time through the Plugin Management window.\n\nPlugins can also communicate with other software running on the same computer through the localhost and 127.0.0.1 hosts. By running programs compatible with such plugins, you can extend the functionality of your plugin beyond the normal capabilities of Studio, such as interacting with your computer's file system. Beware that such software must be distributed separately from the plugin itself and can pose security risks.\n\nUse with Open Cloud\n\nClass.HttpService can currently call a subset of the Open Cloud endpoints. You can call these endpoints the same way that you'd call any other endpoint via HttpService. The only difference is that you must include an Open Cloud API key in the request:\n\n1. Create an Open Cloud API key.\n2. Save the API key to your secrets store.\n3. Make the request.\n\nThe following code sample demonstrates how to update a user's group membership from within an experience:\n\nlua\nlocal HttpService = game:GetService(\"HttpService\")\n\nlocal groupId = \"yourgroupid\"\nlocal membershipId = \"yourmembershipid\"\nlocal roleId = \"yourroleid\"\n\nlocal function request()\n\tlocal response = HttpService:RequestAsync({\n\t\tUrl = https://apis.roblox.com/cloud/v2/groups/{groupId}/memberships/{membershipId},\n\t\tMethod = \"PATCH\",\n\t\tHeaders = {\n\t\t\t[\"Content-Type\"] = \"application/json\", -- When sending JSON, set this!\n\t\t\t[\"x-api-key\"] = HttpService:GetSecret(\"APIKey\"), -- Set in Creator Hub\n\t\t},\n\t\tBody = HttpService:JSONEncode({ role = groups/{groupId}/roles/{roleId} }),\n\t})\n\n\tif response.Success then\n\t\tprint(\"The response was successful:\", response.StatusCode, response.StatusMessage)\n\telse\n\t\tprint(\"The response returned an error:\", response.StatusCode, response.StatusMessage)\n\tend\n\tprint(\"Response body:\\n\", response.Body)\n\tprint(\"Response headers:\\n\", HttpService:JSONEncode(response.Headers))\nend\n\n-- Wrap the function in pcall() for safety\nlocal success, errorMessage = pcall(request)\nif not success then\n\tprint(\"The HTTP request failed to send:\", errorMessage)\nend\n\nSupported Open Cloud endpoints\n\nThe following endpoints are supported. Due to current limitations on Class.HttpService, the .. string is not allowed in URL path parameters to Roblox domains. This means, for example, that data stores and entries containing this string are currently inaccessible from Class.HttpService.\n\nAssets\n\n- GetAsset\n- ListAssetVersions\n- GetAssetVersion\n\nBans and blocks\n\n- ListUserRestrictions (Place)\n- GetUserRestriction (Place)\n- UpdateUserRestriction (Place)\n- ListUserRestrictions (Universe)\n- GetUserRestriction (Universe)\n- UpdateUserRestriction (Universe)\n- ListUserRestrictionLogs (Universe)\n\nCreator Store\n\n- CreateCreatorStoreProduct\n- GetCreatorStoreProduct\n- UpdateCreatorStoreProduct\n- CreatorStoreAssetsSearch\n\nData and memory stores\n\nData stores:\n\n- ListDataStores\n- SnapshotDataStores\n- ListDataStoreEntries\n- CreateDataStoreEntry\n- GetDataStoreEntry\n- DeleteDataStoreEntry\n- UpdateDataStoreEntry\n- IncrementDataStoreEntry\n- ListDataStoreEntryRevisions\n- ListDataStoreEntries (With Scope)\n- CreateDataStoreEntry (With Scope)\n- GetDataStoreEntry (With Scope)\n- DeleteDataStoreEntry (With Scope)\n- UpdateDataStoreEntry (With Scope)\n- IncrementDataStoreEntry (With Scope)\n- ListDataStoreEntryRevisions (With Scope)\n\nMemory stores:\n\n- CreateMemoryStoreQueueItem\n- DiscardMemoryStoreQueueItems\n- ReadMemoryStoreQueueItems\n- ListMemoryStoreSortedMapItems\n- CreateMemoryStoreSortedMapItem\n- GetMemoryStoreSortedMapItem\n- DeleteMemoryStoreSortedMapItem\n- UpdateMemoryStoreSortedMapItem\n- FlushMemoryStore\n\nOrdered data stores:\n\n- ListOrderedDataStoreEntries\n- CreateOrderedDataStoreEntry\n- GetOrderedDataStoreEntry\n- DeleteOrderedDataStoreEntry\n- UpdateOrderedDataStoreEntry\n- IncrementOrderedDataStoreEntry\n\nGroups\n\n- GetGroup\n- ListGroupJoinRequests\n- AcceptGroupJoinRequest\n- DeclineGroupJoinRequest\n- ListGroupMemberships\n- UpdateGroupMembership\n- ListGroupRoles\n- GetGroupRole\n- GetGroupShout\n\nInventories\n\n- ListInventoryItems\n\nLuau execution\n\n- CreateLuauExecutionSessionTaskBinaryInput\n- CreateLuauExecutionSessionTask\n- CreateLuauExecutionSessionTask (with version)\n- GetLuauExecutionSessionTask\n- ListLuauExecutionSessionTaskLogs\n\nNotifications\n\n- CreateUserNotification\n\nPlaces\n\n- GetPlace\n- UpdatePlace\n- GetInstance\n- UpdateInstance\n\nUniverses\n\n- UpdateUniverse\n- GetUniverse\n- PublishUniverseMessage\n- RestartUniverseServers\n\nUsers\n\n- GetUser\n- GenerateUserThumbnail\n\nLimitations\n\n- Only the x-api-key and content-type headers are allowed.\n- The x-api-key header must be a Datatype.Secret. See Secrets stores.\n- The \"..\" string is not allowed in URL path parameters.\n- Only the HTTPS protocol is supported.\n- You cannot use port 1194 or any port below 1024, except 80 and 443. If you try to use a blocked port, you receive either a 403 Forbidden or ERRACCESSDENIED error.\n\nRate limits\n\nFor each Roblox experience server, there is a limit of 2500 Open Cloud requests per minute. Exceeding this can cause request-sending methods to stall for around 30 seconds. Your Global.LuaGlobals.pcall() may also fail with a message of Number of Open Cloud requests exceeded limit.\n\n- Open Cloud requests do not consume the same overall limit of 500 HTTP requests per minute enforced on all other requests.\n- Each endpoint has its own limit per API key owner (can be a user or a group) that is enforced no matter where the calls come from (Class.HttpService, the web, etc.).\n\nFor detailed information about Open Cloud rate limits, authentication-based rate limiting, and best practices, see Rate Limits.\n\nBest practices\n\nTo optimize your Class.HttpService usage and avoid exceeding the limits, apply the following best practices:\n\n- Handle errors gracefully. Web requests can fail for many reasons. Use Global.LuaGlobals.pcall() and have a plan for when requests fail. Furthermore, strictly validate and sanitize all received data from external APIs, ensuring correct data where you can.\n\n- Use exponential backoff to stay below limits.\n\n  If a request returns a recoverable error, instead of immediately retrying, wait for two seconds, then four, eights, etc. between attempts. This helps limit congestion and improves the chance of a successful request by giving the endpoint time to \"cool off.\"\n\n- Aggregate and send data in bulk.\n\n  When possible, it's recommended to let your server collect all necessary data in order to send one HTTP request, rather than multiple small requests. For example, if you are sending an HTTP request for every player in your server, check if the API has a bulk/batch endpoint and, if so, collect the information from all players and send it all in one request.\n\n  In some cases you may have to use Class.HttpService:RequestAsync() to include data in the body of the request.\n\n- Use HTTP/2 endpoints. HTTP/2 provides significant performance benefits through features such as header compression and request/response multiplexing over a single connection. Class.HttpService automatically uses HTTP/2 when available. Note that the HTTP/2 specification requires all header names to be sent in lowercase.\n\nObservability\n\nThe Observability Dashboard provides insights and analytics for monitoring and troubleshooting your Class.HttpService usage. The dashboard features two primary charts: Request Count which tracks the volume of Class.HttpService requests from your experience, and Response Time which measures the latency for endpoints to respond.\n\nThe available dimensions for filtering and breakdown are defined as follows:\n\nRequest Type\n\n- GET\n- POST\n- PUT\n- PATCH\n- DELETE\n- Other (for non-specified request types)\n\nStatus\n\n- Success (HTTP 1xx and 2xx status codes)\n- Redirect (HTTP 3xx status codes)\n- 400 (Bad Request)\n- 401 (Unauthorized)\n- 403 (Forbidden)\n- 404 (Not Found)\n- 429 (Too Many Requests)\n- 500 (Internal Server Error)\n- 503 (Service Unavailable)\n- ExternalError (any other non-specified error codes returned from the external service)\n- InternalError (an issue returned from Class.HttpService within Roblox)\n\nThe Response Time chart is not correlated with status data. If you select \"Status\" as a breakdown or filter, this chart will not display data.\n\nAdditional considerations\n\n- Requests should provide a secure form of authentication, such as a pre-shared secret key, so that bad actors cannot pose as one of your Roblox servers.\n- Be aware of the general capacity and rate-limiting policies of the web servers to which requests are being sent.",
    "source": "http-service.md"
}