{
    "title": "Identify performance issues",
    "description": "Explains how to use Roblox tools to identify performance issues.",
    "content": "Identifying performance issues generally means drilling down on one of three categories: frame rate (compute), memory, or load time.\n\nRoblox has a number of tools for identifying performance issues, some of which are available in the Roblox client (and therefore Studio) and some of which are only available in Studio. Whereas you can observe client behavior directly, you must use tools to diagnose server issues.\n\nDiagnostic Tools\n\n\n    Tool\n    Description\n    Location\n    Keyboard shortcut\n    Environment\n\n\n    Developer Console\n    A console with real-time log messages, errors, and detailed information on memory, networking, and script performance. It's useful for viewing memory consumption, key server health stats, script performance stats, and to launch the client or server MicroProfiler.\n    Studio, in-experience\n    F9\n    Live sessions, Studio testing\n\n\n    MicroProfiler\n    A debugging tool that breaks down how much computational time is spent on tasks each frame. It can generate dumps for analysis showing a precise breakdown of individual frames, making it helpful for identifying the specific task causing performance issues. You can run the profiler on either the client or the server, depending on which side has an issue.\n    Studio, in-experience\n    CtrlAltF6 (⌘⌥F6)\n    Live sessions, Studio testing\n\n\n    Performance Stats bar\n    A toolbar with basic performance statistics, including memory consumption, CPU, GPU, network data sent and received, and ping time.\n    In-experience\n    CtrlAltF7 (⌘⌥F7)\n    Live sessions, Studio testing\n\n\n    Debug Stats\n    Overlays with detailed information around graphics, physics, network traffic, and FPS.\n    Studio, in-experience\n    ShiftF1, ShiftF2, ShiftF3, ShiftF4, ShiftF5\n    Live sessions, Studio testing\n\n\n    Performance Dashboard\n    A dashboard with aggregate charts for client and server memory usage, client frame rate, server heartbeat, and crash rates in real time. It's helpful for analyzing performance patterns over time. See Monitoring Performance.\n    Creator Dashboard\n    N/A\n    Live sessions\n\n\nServer compute\n\nServer heartbeat is capped at 60 FPS for all experiences, so lower values might indicate a performance issue. To check server heartbeat:\n\n- With the Developer Console - In the Server Jobs tab, expand the Heartbeat row and check the Steps Per Sec value, which represents the heartbeat of your experience.\n\n- With the MicroProfiler, you can check the graph to see if the frame takes longer than 16.67 ms.\n\n\n  The MicroProfiler is particularly useful for identifying \"spikes\" in performance, where some frames take significantly longer than others to process.\n\n\nAnother symptom of degraded server heartbeat is increased latency (commonly known as ping). The longer the server takes to finish computing its tasks each frame, the longer it takes to process network data sent and received from clients. To check average ping for all players connected to a server, go to the Server Stats tab in the Developer Console.\n\nClient compute\n\nThe default client frame rate cap is 60 FPS. However, users can raise their frame rate cap up to 240 FPS on Windows.\n\nFrame rate differs wildly between devices. For example, a high-end PC might be able to \"brute force\" a computational issue and only experience an imperceptible frame rate dip. If you test on lower-end devices, problems tend to be more severe and thus easier to notice.\n\nTo check the frame rate of your experience:\n\n- In the client, press ShiftF5 to show the debug stats summary.\n- From Studio's Window ⟩ Performance menu, toggle on Stats to enable debug stats.\n\n\n  Performance stats in Studio are skewed by the Studio application, so you should view the frame rate on the client if you have a production experience.\n\n\n- With the MicroProfiler, you can check the graph to see if the frame takes longer than 16.67 ms.\n\nWhen evaluating frame rate, it can help to set the graphics quality to its maximum value to remove the effect of the frame rate manager. In the client, open the menu, click Settings, change  Graphics Mode to manual, and raise graphics quality.\n\nServer memory\n\nTry to keep server memory usage below 50%. Total server memory uses the following formula:\n\n6.25 GiB + (100 MiB  largestnumberofconnectedplayers)\n\nThese numbers use powers of 2, so 1 GiB refers to 2^30 bytes and 1 MiB to 2^20 bytes.\n\nFor example, a server with 30 connected players has approximately 9.18 GiB of total memory. Servers gain memory when players connect, but don't lose it when players disconnect. If 10 players leave, the server still has 9.18 GiB of memory rather than shrinking to 8.2 GiB.\n\nWhen servers shut down (for example, when they are empty or as part of the update process), their replacements start with the base amount of memory and begin scaling up as players connect.\n\nClient memory\n\nThere are several ways to check memory usage for an experience:\n\n1. Open the Developer Console and switch to the Memory tab. This tab gives a breakdown of how memory is being allocated. Use the client rather than Studio to get the most accurate readouts.\n2. Enable the Performance Stats view from the settings menu in the client to see an overlay with total client memory usage.\n\nHigh memory usage is not necessarily indicative of a problem, but some indications that you may need to investigate more are:\n\n- A significant percentage of client crashes showing in the Performance Dashboard, particularly a sudden uptick that coincides with an update. Some number of crashes are expected, but you should investigate if your crash rates increase above 2-3%.\n- A crash occurs while testing on a device that you want your experience to support.\n\nA significant portion of an experience's memory consumption on the client are from assets, such as images, meshes, and audio files, loaded into memory. In the Developer Console, check the following labels under PlaceMemory:\n\n- GraphicsMeshParts - Graphics memory consumed by meshes.\n- GraphicsTexture - Graphics memory consumed by textures.\n- Sounds - Memory consumed by audio files.\n\nLoad times\n\nThere are no built-in tools for checking load times, but because they don't require millisecond-level precision, a stopwatch is usually all you need to understand your current baseline and check whether you made a substantive improvement. You can use a client script in Class.ReplicatedFirst to get some sense of how your changes impact load times, but this script doesn't provide a complete, end-to-end measurement:\n\nlua\nlocal startTime = os.clock()\n\ngame.Loaded:Connect(function()\n  local loadTime = os.clock() - startTime\n  local roundedLoadTime = math.round(loadTime  10000) / 10000 -- four decimal places\n  print(\"Game loaded in \" .. roundedLoadTime .. \" seconds.\")\n  print(\"Number of instances loaded: \" .. #workspace:GetDescendants())\nend)\n\nFor additional insight, enable Print Join Size Breakdown from the Network tab of Studio Settings to print the top 20 instances by size and a percentage breakdown by instance type when you start the experience in Studio.\n\nPing\n\nThe two primary measurements of ping (latency) are network ping and data ping.\n\nNetwork ping is the round-trip time measured from when the client sends a network data packet to when it receives the server's echo reply. It is similar to what would be reported as time by the general purpose ping network utility.\n\nNetwork ping is visible in the Performance Stats bar. It is mostly affected by the length of the network path between the client and server and is outside your control.\n\nData ping is the round-trip time measured from when the client sends data reliably through the replication system to when it receives an echo reply from the server's replication system. It includes time spent in both the client's and server's replication queues, along with TCP-like retransmissions of lost or corrupted packets.\n\nData ping is similar to sending a reliable remote event from the client, receiving it on the server, and then sending a reliable remote event from the server to the client in response. Because data ping also includes time spent on the network between the client and server, it is greater than or equal to network ping.\n\nAverage data ping for all players connected to a server is visible in the Server Stats tab of the Developer Console. Data ping for an individual client is visible using ShiftF3 to display network debug stats.\n\nData ping is affected by both the network path and by replication queueing delays. When the server generates replication data faster than the network can send it (or faster than the client can process it), data must wait in replication queues. Some difference between data ping and network ping is normal due to both network retransmissions and the way network data is processed by the Roblox app. However, if data ping is significantly higher than network ping, use the MicroProfiler to view network traffic. For optimization suggestions, see Networking and replication.",
    "source": "identify.md"
}