{
    "title": "Text chat overview",
    "description": "TextChatService lets players communicate with each other using text-based messages in live sessions.",
    "content": "Roblox offers text-based messaging between players in live sessions through Class.TextChatService, a singleton class responsible for managing the overall chat system, including chat message filtering, moderation, and user permissions. This service has its standard functionality and also provides a set of methods and events for extending and customizing chat, such as delivering messages based on customized requirements, adding special permissions or moderation to specific players, and creating custom commands to execute specific actions.\n\nUI configuration\n\nClass.TextChatService provides a default UI that can be customized to fit your experience's needs. Disable any of these configurations to hide its associated UI element. If desired, you can also replace these UI elements with custom interfaces:\n\n- Class.ChatWindowConfiguration\n- Class.ChatInputBarConfiguration\n- Class.ChannelTabsConfiguration\n- Class.BubbleChatConfiguration\n\nFor more information, see Chat window and Bubble chat.\n\nChannels, messages, and commands\n\n- Class.TextChannel — Text channels pass user-sent messages from the client to the server, which then displays them to other users based on permissions. Text channels must be parented to Class.TextChatService in order to function.\n\n\n\tIf Class.TextChatService.CreateDefaultTextChannels is set to true, the service automatically creates two text channels, RBXGeneral and RBXSystem. You can manually create additional Class.TextChannel instances and parent them to Class.TextChatService, as well.\n\n\n- Class.TextSource — A user in a Class.TextChannel. Text sources are directly parented to the Class.TextChannel when Class.TextChannel:AddUserAsync()|AddUserAsync() is called. Text sources contains detailed permissions of a user in the channel, such as their ability to send messages. If a single user is in multiple text channels, they are associated with multiple text sources.\n\n- Class.TextChatMessage — A message in a text channel. Chat messages contain basic information such as the sender of the message, the original message, the filtered message, and the creation timestamp.\n\n- Class.TextChatCommand — Lets users invoke specific actions or behaviors by sending messages that match the Class.TextChatCommand.PrimaryAlias|PrimaryAlias or Class.TextChatCommand.SecondaryAlias|SecondaryAlias properties. Chat commands must be parented to Class.TextChatService in order to function.\n\n\n\tIf Class.TextChatService.CreateDefaultCommands is set to true, default chat commands will be created automatically. You can manually create additional Class.TextChatCommand instances and parent them to Class.TextChatService, as well.\n\n\nChat flowchart\n\nText chat uses the client‑server model, with a sending client, the server, and receiving clients.\n\n1. A player sends a message from their local device, triggering the Class.TextChannel:SendAsync() method. This method processes the message and determines whether it's a chat command or a regular chat message.\n\n   - If the message is a chat command, it fires the Class.TextChatCommand.Triggered event to perform the defined action. No further steps are required.\n\n   - If the message is a regular chat message, it fires the Class.TextChatService.SendingMessage event to display the message to the sender on the sending client. At the same time, Class.TextChannel:SendAsync() passes the message to the server.\n\n1. The server fires Class.TextChannel.ShouldDeliverCallback to determine whether to deliver the message to other players based on permissions and Roblox community filtering requirements.\n\n1. If Class.TextChannel.ShouldDeliverCallback determines that message is eligible to deliver to other players, the server applies any filters and fires Class.TextChannel.OnIncomingMessage twice:\n\n   1. The first time is on the sending client and signals that the server is processing the message through the Class.TextChatService.MessageReceived event. This event replaces the local message on the sending client with the processed message from the server. The message is identical if the original didn't require filtering.\n\n   2. The second time is on the receiving clients, which triggers the Class.TextChatService.MessageReceived event to display the message to other players.\n\nText chat hooks and callbacks\n\nThe Class.TextChatService API encourages a clear separation on the appearance and delivery of chat messages. Multiple instances of the text chat system provide hooks and callbacks to format in centralized, clear locations.\n\nAll callbacks are expected to be non-yielding functions. Yielding or waiting for a response in a callback blocks the chat system and can cause unexpected behavior.\n\n| Callback                                  | Return Value                        |\n| ----------------------------------------- | ----------------------------------- |\n| Class.TextChannel.ShouldDeliverCallback | boolean                             |\n| Class.TextChatService.OnIncomingMessage | Class.TextChatMessageProperties   |\n| Class.TextChannel.OnIncomingMessage     | Class.TextChatMessageProperties   |\n| Class.TextChatService.OnBubbleAdded     | Class.BubbleChatMessageProperties |\n| Class.TextChatService.OnChatWindowAdded | Class.ChatWindowMessageProperties |\n\nConditionally deliver messages\n\nThe Class.TextChannel.ShouldDeliverCallback callback should be defined on the server only. The callback is fired for each Class.TextSource child of the text channel when a message is sent to determine whether the message should be delivered. This callback can be used to implement custom message delivery logic that may depend on additional gameplay context, such as:\n\n- Proximity-based chat where users can only send messages to those close to them.\n- Preventing users with certain attributes from sending messages to others.\n\nCustomize message display\n\nThe default Class.TextChatService UI relies on rich text to format and customize how messages are displayed. You can use the following callbacks to format messages before they are displayed to users, for example to add colors or chat tags to user names or format message content.\n\nThe following callbacks are called on every Class.TextChatMessage that is about to be displayed, which lets you customize chat window appearance based on the Class.TextChannel, Class.TextSource, or Class.TextChatMessage content. When a client sends a message, these callbacks are called once when the message is sent to the server and the Class.TextChatMessage.Status value will be Enum.TextChatMessageStatus.Sending. Once the message is received by the server and is being delivered to other users, the sender client receives the message again with an updated Enum.TextChatMessageStatus value.\n\n- Class.TextChatService.OnIncomingMessage — This callback should be defined on the client only. The callback is fired when a message is received, either from the server or if the local client has just sent a message. The callback is called on every Class.TextChatMessage received from all Class.TextChannel instances and is the first to process the message before it is displayed to the user.\n- Class.TextChannel.OnIncomingMessage — This callback should be defined on the client only. The callback is fired when a message is received from the server. The callback is called on every Class.TextChatMessage received from the Class.TextChannel. Default Class.TextChannel instances created from Class.TextChatService.CreateDefaultTextChannels have this callback defined and can be overwritten.\n- Class.TextChatService.OnBubbleAdded — This callback should be defined on the client only. Use it to customize the appearance of chat bubbles independent of the appearance of the message in the chat window UI.\n- Class.TextChatService.OnChatWindowAdded — This callback should be defined on the client only. Use it to customize the appearance of chat messages in the chat window UI independent of the appearance of the message in chat bubbles.\n\nMigrate from legacy chat\n\nThis section assists you in migrating from the legacy chat system by providing alternative methods for implementing common chat functionalities and behaviors using Class.TextChatService.\n\n1. In the Explorer window, select Class.TextChatService.\n2. In the Properties window, find the Class.TextChatService.ChatVersion|ChatVersion dropdown and select Enum.ChatVersion|TextChatService.\n\n\n\nBasic functionalities\n\nThough both systems share the same basic chat functionalities, Class.TextChatService implementations are in general more sustainable and easier to iterate on.\n\n\n\n      Functionality\n      Legacy chat\n      TextChatService\n      Differences\n\n\n\n\n      Send a chat message\n      Class.Players:Chat()\n      Class.TextChannel:SendAsync()\n      The Class.TextChannel:SendAsync()|SendAsync() method supports more advanced chat features, such as rich text formatting and message priority. It also includes built-in filtering to help prevent inappropriate messages from being sent.\n\n\n      Implement messaging callbacks\n      Class.Chat:InvokeChatCallback()Class.Chat:RegisterChatCallback()\n      Class.TextChatService.SendingMessageClass.TextChatService.OnIncomingMessage\n      The legacy chat system binds a function to chat system events for delivering messages. The two methods of TextChatService offer better flexibility and customization.\n\n\n      Add custom chat commands\n      ChatService/ChatCommand module\n      Class.TextChatCommand\n      TextChatService has a dedicated class for text commands rather than using a legacy chat module.\n\n\n      Display a system message\n      Class.StarterGui:SetCore() using ChatMakeSystemMessage\n      Class.TextChannel:DisplaySystemMessage()\n      The Class.TextChannel.OnIncomingMessage callback can return a Class.TextChatMessageProperties instance to customize the message appearance.\n\n\n      Disable chat\n      Experience Settings in Studio and ChatWindow/ChatSettings module for hiding the chat window\n      Class.ChatWindowConfiguration.Enabled\n\n\n\n\nMessage filtering\n\nClass.TextChatService automatically filters chat messages based on each player's account information, so you don't need to manually implement text filtering for all kinds of chat messages.\n\n\n\n      Functionality\n      Legacy chat\n      TextChatService\n\n\n\n\n      Filter chat message for individual player\n      Class.Chat:FilterStringAsync()\n      Automatic\n\n\n      Filter broadcasting messages\n      Class.Chat:FilterStringForBroadcast()\n      Automatic\n\n\n\nWindow and bubble chat\n\nBoth the chat window and bubble chat behavior and customization options of Class.TextChatService are identical to those of the legacy chat system. As the legacy chat system only allows customization using chat modules or the Class.Players container, the service provides dedicated classes (Class.ChatWindowConfiguration and Class.BubbleChatConfiguration) to manage all chat window and bubble chat properties. Additionally, you can easily adjust and preview your bubble chat appearance and behavior properties using Studio settings instead of having to script them all.\n\n\n\n      Functionality\n      Legacy chat\n      TextChatService\n\n\n\n\n      Enable Chat Window\n      Class.Chat.LoadDefaultChatClass.Players.ClassicChat\n      Class.ChatWindowConfiguration.Enabled\n\n\n      Enable Bubble Chat\n      Class.Chat.BubbleChatEnabledClass.Players.BubbleChat\n      Class.BubbleChatConfiguration.Enabled\n\n\n      Set Chat Window Properties\n      Class.Players:SetChatStyle()\n      Class.ChatWindowConfiguration\n\n\n      Set Bubble Chat Properties\n      Class.Chat:SetBubbleChatSettings()Class.Chat.BubbleChatSettingsChanged()Class.Players.BubbleChatClass.Players:SetChatStyle()\n      Class.BubbleChatConfiguration\n\n\n      Enable NPC Bubbles\n      Class.Chat:Chat()\n      Class.TextChatService:DisplayBubble()\n\n\n\nMigrate speaker \"extra data\"\n\nThe legacy Lua chat system allowed developers to use SetExtraData on the Speaker class. This data was used to format the name color, chat color, or to apply name tags for a given speaker.\n\nlua title=\"Legacy Chat System SetExtraData\"\n-- An example of setting extra data on a speaker in the legacy chat system\nChatService.SpeakerAdded:Connect(function(playerName)\n\tlocal speaker = ChatService:GetSpeaker(playerName)\n\tspeaker:SetExtraData(\"NameColor\", Color3.fromRGB(255, 255, 55))\n\tspeaker:SetExtraData(\"ChatColor\", Color3.fromRGB(212, 175, 55))\n\tspeaker:SetExtraData(\"Tags\", {{TagText = \"YourTagName\", TagColor = Color3.fromRGB(0, 255, 0)}, {TagText = \"OtherTagName\", TagColor = Color3.fromRGB(255, 0, 0)}})\nend)\n\nClass.TextChatService does not have a direct equivalent to SetExtraData. Instead, use callbacks such as Class.TextChatService.OnWindowAdded|OnWindowAdded to customize the appearance of messages using rich text based on the Class.TextSource of the message.\n\nThe following is an example of emulating legacy Lua chat's \"extra data\" by accessing attributes on Class.Player objects:\n\nlua title=\"TextChatService SetAttributes\"\nlocal Players = game:GetService(\"Players\")\n\nPlayers.PlayerAdded:Connect(function(player)\n\tplayer:SetAttribute(\"NameColor\", Color3.fromRGB(255, 255, 55))\n\tplayer:SetAttribute(\"ChatColor\", Color3.fromRGB(212, 175, 55))\n\tplayer:SetAttribute(\"isYourTag\", true)\n\tplayer:SetAttribute(\"isOtherTag\", true)\nend)\n\nThen you can use the Class.TextChatService.OnChatWindowAdded|OnChatWindowAdded callback to customize the appearance of the chat window based on the attributes set on the player:\n\nlua title=\"TextChatService OnChatWindowAdded\"\nlocal TextChatService = game:GetService(\"TextChatService\")\nlocal Players = game:GetService(\"Players\")\n\nTextChatService.OnChatWindowAdded = function(textChatMessage)\n\tlocal textSource = textChatMessage.TextSource\n\tif textSource then\n\t\tlocal player = Players:GetPlayerByUserId(textSource.UserId)\n\t\tif player then\n\t\t\tlocal overrideProperties = TextChatService.ChatWindowConfiguration:DeriveNewMessageProperties()\n\t\t\toverrideProperties.PrefixText = textChatMessage.PrefixText\n\t\t\toverrideProperties.Text = textChatMessage.Text\n\n\t\t\tlocal nameColor = player:GetAttribute(\"NameColor\")\n\t\t\tif nameColor and typeof(nameColor) == \"Color3\" then\n\t\t\t\toverrideProperties.PrefixTextProperties.TextColor3 = nameColor\n\t\t\tend\n\n\t\t\tlocal chatColor = player:GetAttribute(\"ChatColor\")\n\t\t\tif chatColor and typeof(chatColor) == \"Color3\" then\n\t\t\t\toverrideProperties.TextColor3 = chatColor\n\t\t\tend\n\n\t\t\tlocal isYourTag = player:GetAttribute(\"isYourTag\")\n\t\t\tif isYourTag == true then\n\t\t\t\toverrideProperties.PrefixText = [YourTag] {overrideProperties.PrefixText}\n\t\t\tend\n\n\t\t\tlocal isOtherTag = player:GetAttribute(\"isOtherTag\")\n\t\t\tif isOtherTag == true then\n\t\t\t\toverrideProperties.PrefixText = [OtherTag] {overrideProperties.PrefixText}\n\t\t\tend\n\n\t\t\treturn overrideProperties\n\t\tend\n\tend\n\n\treturn nil\nend",
    "source": "in-experience-text-chat.md"
}