{
    "title": "Inverse Kinematics",
    "description": "Inverse Kinematics is a technique in computer animation to make characters move and interact with their environment.",
    "content": "Inverse Kinematics (IK) is a common technique in computer animation to efficiently make characters move and interact realistically with their environment. The process of creating a realistic movement for a character often requires many iterations and minor adjustments of the various joints. With IK, you can pose and animate multiple character parts by posing or adjusting a single object.\n\nThis animation technique can provide solutions to the following examples:\n\n\n\n\t\tGrab and pose a character's hand while automatically adjusting the related limbs, such as the wrist, elbow, and shoulder.\n\n\n\n\t\tMake a character's feet interact realistically on different surfaces and slopes.\n\n\n\n\t\tGrab and move a single target object to quickly create realistic interactions with your character and props.\n\n\nIKControl\n\nYou can use an Class.IKControl to procedurally add IK to your character rigs outside of the Animation Editor. Studio allows you to programmatically apply IK to all characters, such as R15, Rthro, and custom imported skinned characters, to create realistic movement and interactions in your experience.\n\nWhen adding an Class.IKControl, set the required properties correctly to avoid unexpected and unnatural animation results. As with all animation, test your IKControls to ensure that you achieve the desired behavior.\n\nRequired properties\n\nWhen adding a Class.IKControl to your character's Class.Humanoid or Class.AnimationController, you must set the following required properties to enable IK:\n\n\n    Property\n    Description\n\n\n\n    Class.IKControl.Type|Type\n    Specifies the behavior type of the IK control. See Enum.IKControlType for the list of behavior options. Common behavior types are Position or Transform.\n\n\n    Class.IKControl.EndEffector|EndEffector\n    A Class.BasePart or Class.Bone in your character rig that tracks toward the Class.IKControl.Target|Target. For example, you can set a LeftHand bone as a Class.IKControl.EndEffector|EndEffector to reach a doorknob object set as the Class.IKControl.Target|Target.\n\n\n    Class.IKControl.Target|Target\n    The object the Class.IKControl.EndEffector|EndEffector reaches or points toward. A Class.IKControl.Target|Target can be any object with a world position.\n\n\n    Class.IKControl.ChainRoot|ChainRoot\n    Defines the chain of Class.BasePart|BaseParts or Class.Bone|Bones that the Class.IKControl affects. All connected parts between the Class.IKControl.ChainRoot|ChainRoot and the Class.IKControl.EndEffector|EndEffector are affected by the Class.IKControl using the behavior type defined.  For example, if your character's LeftHand is set as the Class.IKControl.Target|Target, you can apply IK to the entire left arm by setting Class.IKControl.ChainRoot|ChainRoot to the LeftUpperArm. To apply IK just to the parts below the elbow, set Class.IKControl.ChainRoot|ChainRoot to the LeftLowerArm.\n\n\nTest IKControls\n\nYou can add and edit Class.IKControl programmatically or directly through the Explorer. You can even add and make changes to Class.IKControl during a Play test to quickly check how various properties affect a character's movements.\n\nTo quickly test your Class.IKControl using an Class.Attachment as a target:\n\n1. From Studio's mezzanine, initiate a playtest.\n2. In the Explorer, navigate to Workspace → your user's Class.Model. This Class.Model instance is named as your current Roblox account.\n3. Click the ⊕ icon next to your character model's HumanoidRootPart and add an Attachment.\n\n\n\n4. Select the Attachment and use the Move tool to position the object in front of your character in the viewport.\n\n\n\n5. In the Explorer window, select the ⊕ icon next to your character's Class.Humanoid and add an IKControl.\n\n\n\n6. Select the Class.IKControl and set the following property values in the Properties window:\n\n   1. Type: Select Transform from the dropdown.\n   2. EndEffector: Select your model's LeftHand Class.MeshPart in the Explorer.\n   3. Target: Select the newly created Attachment object in the Explorer.\n   4. ChainRoot: Select your model's LeftUpperArm Class.MeshPart in the Explorer.\n\n\n\n\n       IKControl Properties\n\n\n\n       Explorer - Character Model\n\n\n\n   Your character's left arm should now reach for the target Class.Attachment. You can experiment with moving the Class.Attachment or editing the Class.IKControl properties to achieve different results.\n\n\n\nAdd constraints\n\nYou can use Class.Constraint|Constraints to restrict how joints can move when reaching its target. Constraints can ensure joints like the elbows and knees bend naturally, or to make the mechanical joints rotate in a specific orientation.\n\nElbow bending unnaturally\n\nElbow bending correctly\n\nTo add constraints to your character using Class.IKControl, your Class.IKControl and constraint must meet the following conditions:\n\n- The attachments referenced in the constraint's Class.Constraint.Attachment0|Attachment0/Class.Constraint.Attachment1|Attachment1 properties attaches to the same parts as the Class.Motor6D Class.Motor6D.Part0|Part0/Class.Motor6D.Part1|Part1.\n- The relative positions of Class.Constraint.Attachment0|Attachment0/Class.Constraint.Attachment1|Attachment1 must equal the corresponding positions of the Class.Motor6D Class.Motor6D.C0|C0/Class.Motor6D.C1|C1 CFrames.\n- The constraint and the IKControl share the same parent Class.Model.\n\nThe following instructions describe the process of adding a Class.HingeConstraint to restrict the rotation of a character's elbow and adding a Class.BallSocketConstraint to the wrist to limit the rotation angle.\n\nElbow\n\nRoblox R15 characters already include attachments in their joints that you can use to apply the elbow constraint. For the elbow, both the LeftUpperArm and the LeftLowerArm include a LeftElbowRigAttachment. Along with adding a constraint, you also need to add additional child attachments to each part's LeftElbowRigAttachment to specify which axis the elbow can rotate about.\n\nTo add the Class.HingeConstraint and child attachments:\n\n1. In the Explorer, locate your model's LeftLowerArm and click the ⊕ button.\n2. Add a HingeConstraint with the name LeftElbowConstraint.\n3. In the Explorer, navigate to the LeftUpperArm.LeftElbowRigAttachment and add an attachment:\n\n   1. Click the ⊕ button to add an Attachment with the name LeftElbowConstraintAttachment0.\n   2. In the viewport, select the attachment and use the Rotate tool to rotate the attachment so the yellow PrimaryAxis is the axis of your elbow's expected rotation.\n\n\n\n   3. Set the LeftElbowConstraint.Attachment0 property to this new attachment.\n\n4. In the Explorer, navigate to your model's LeftLowerArm.LeftElbowRigAttachment add an attachment:\n\n   1. Click the ⊕ button and add an Attachment with the name LeftElbowConstraintAttachment1.\n   2. Set the LeftUpperArm.LeftElbowConstraint.Attachment1 property to this new attachment.\n   3. Copy the LeftElbowConstraintAttachment0.CFrameOrientation property and paste it as the LeftElbowConstraint.Attachment1.CFrameOrientation value.\n\n\n\nIf you see a red arrow on the constraint's visualization, that means your attachment orientations are violating the hinge constraint. Go back and make sure the LeftElbowConstraintAttachment1 has the same orientation as the LeftElbowConstraintAttachment0.\n\nTest your IKControl to verify the elbow only rotates about its hinge axis:\n\nWrists\n\nEven with the elbow constraint, the IKControl can still produce unrealistic poses with the wrists.\n\nThe wrist bends unnaturally at certain orientations\n\nYou can improve this by adding a Class.BallSocketConstraint to limit the rotation of the wrist. While this is similar to the process for adding a Class.HingeConstraint to the elbow, you can use the Class.BallSocketConstraint.LimitsEnabled|LimitsEnabled property on this constraint to further control the range of motion of the wrist.\n\nTo add a Class.BallSocketConstraint for the wrist:\n\n1. In the Explorer, locate your model's LeftHand and click the ⊕ button.\n   1. Add a BallSocketConstraint with the name LeftWristConstraint.\n2. Locate your model's LeftLowerArm.LeftWristRigAttachment and add an attachment:\n   1. Click the ⊕ button and add an Attachment with the name LeftWristConstraintAttachment0.\n   2. In the viewport, select the attachment and use the Rotate tool to rotate the attachment so the yellow PrimaryAxis points toward the model's fingertips.\n\n   3. Set the LeftWristConstraint.Attachment0 property to the new LeftWristConstraintAttachment0.\n3. Locate your model's LeftHand.LeftWristRigAttachment and add an attachment:\n   1. Click the ⊕ button and add an Attachment with the name LeftWristConstraintAttachment1.\n   2. Copy the LeftWristConstraintAttachment0.CFrameOrientation property and paste it as the LeftWristConstraintAttachment1.CFrameOrientation property.\n   3. Set the LeftWristConstraint.Attachment1 property to this new LeftWristConstraintAttachment1.\n4. In the Explorer, select the LeftWristConstraint.\n5. In the Properties window, set the following:\n   1. Enable LimitsEnabled.\n   2. Set UpperAngle to 80. This controls how much the constraint's axis can rotate, and 80 degrees is approximately how much the wrist should be able to bend.\n6. Depending on your character you may want to tweak the direction the cone is pointing in. You can do this by using the Rotate tool to rotate the constraint's Attachment0.\n\nWhen selecting the LeftWristConstraint, a green cone appears visualizing the wrist's range of motion.\n\nWith the constraint set up, test the IKControl with the hand pointing down in front of the character and the wrist should rotate and bend more realistically.",
    "source": "inverse-kinematics.md"
}