{
    "title": "Text & image labels",
    "description": "Explore how labels display customizable text and images in user interfaces.",
    "content": "import TextFiltering from '../includes/text-filtering/text-filtering.md'\n\nLabels are Class.GuiObject|GuiObjects that let you display customizable text and images on‑screen or in‑experience. There are two types of labels:\n\n- A Class.TextLabel is a rectangle with text that you can style through customizable properties. This is the primary way to display text in an experience.\n\n- An Class.ImageLabel is a rectangle with an image asset that you can style through customizable properties. Alongside textures and decals, this lets you display images in an experience.\n\nCreate labels on the screen\n\nLabels on a screen are useful for things like displaying images of characters\nwith dialog.\n\nTo add a label to a screen:\n\n1. In the Explorer window, select StarterGui and add a ScreenGui.\n\n   1. Hover over StarterGui and click the &CirclePlus; button. A contextual menu displays.\n\n   1. From the menu, insert a ScreenGui.\n\n2. Select the new ScreenGui and add a label.\n\n   1. Hover over ScreenGui and click the &CirclePlus; button. A contextual menu displays.\n\n   1. From the menu, insert a TextLabel or ImageLabel.\n\n\n\nCreate labels on part faces\n\nLabels on a part are useful for things like creating billboards, posters, and\nwallpaper.\n\nTo add a label to the face of a part:\n\n1. In the Explorer window, insert a SurfaceGui onto the part.\n\n   1. Hover over the part instance and click the &CirclePlus; button. A contextual menu displays.\n\n   1. From the menu, insert a SurfaceGui.\n\n2. Select the new SurfaceGui and add a label.\n\n   1. Hover over the SurfaceGui and click the &CirclePlus; button. A contextual menu displays.\n\n   1. From the menu, insert a TextLabel or ImageLabel.\n\n\n\n\n   If you don't see the button, try choosing a different face in the Face property of the SurfaceGui.\n\n\nAdjust ImageLabel properties\n\nAll images within an Class.ImageLabel must be assets that have been imported to Studio. While the image automatically scales to fit the area of the rectangle, the image looks best when it displays at its native resolution.\n\nYou can customize the visual appearance of an image with the following\nproperties:\n\n- Class.ImageLabel.ImageColor3|ImageColor3\n\n- Class.ImageLabel.ImageTransparency|ImageTransparency\n\n- Class.GuiObject.BackgroundTransparency|BackgroundTransparency\n\nFor example, to display only the image and hide the rectangle, set the Class.GuiObject.BackgroundTransparency|BackgroundTransparency property to 1.\n\nText filtering",
    "source": "labels.md"
}