{
    "title": "Light sources",
    "description": "Light sources simulate realistic lighting from objects such as torches, spotlights, and screens.",
    "content": "Local light sources simulate realistic lighting from objects such as\nlamps, torches, spotlights, and TV screens. By using the different types of\nlight sources instead of just general global lighting through the Class.Lighting\nservice, you can create immersive environments such as cyberpunk cities,\ntraditional light festivals, and moody detective scenes.\n\nThe Class.Lighting.LightingStyle|LightingStyle property, modifiable only in the Properties window for the global Class.Lighting object, sets your experience's lighting style. For more information, see Appearance.\n\nTo view light guides that indicate the color and field of effect from light sources, such as the angle of light emission from the cone's apex of a Class.SpotLight, open Studio Settings and toggle on Show Light Guides.\n\nLight types\n\nLocal light sources include PointLight, SpotLight, and SurfaceLight. Each shares various properties from the Class.Light class, including Class.Light.Color|Color, Class.Light.Brightness|Brightness, and Class.Light.Shadows|Shadows.\n\nPointLight\n\nA Class.PointLight emits light spherically from a single point. This object is ideal for non-directional lights like bulbs, torches, and fireballs.\n\nTo create a point light in Studio, insert a Class.PointLight into an Class.Attachment or a Class.BasePart (Class.Attachment is recommended for point‑specific light emission). Then adjust the object's Class.PointLight.Range|Range as well as shared properties like Class.PointLight.Brightness|Brightness and Class.PointLight.Color|Color.\n\nRange\n\nA point light's Class.PointLight.Range|Range property defines the radial distance of illumination from the light's position, measured in studs.\n\nSpotLight\n\nA Class.SpotLight emits light in the shape of a cone with a spherical base. This object is ideal for directional lights like street lamps, flashlights, and headlights.\n\nTo create a spotlight in Studio, insert a Class.SpotLight into an Class.Attachment or a Class.BasePart and set its Class.SpotLight.Face|Face property to specify which direction light emits from. Then adjust the Class.SpotLight.Angle|Angle and Class.SpotLight.Range|Range, as well as shared properties like Class.SpotLight.Brightness|Brightness and Class.SpotLight.Color|Color.\n\nFace\n\nA spotlight's Class.SpotLight.Face|Face property determines which face/axis light emits from, as shown from the following streetlamp's glowing light part:\n\nAngle\n\nA spotlight's Class.SpotLight.Angle|Angle property defines the angle of light emission from the cone's apex. The maximum value is 180 which illuminates a full half sphere from the apex.\n\nSurfaceLight\n\nA Class.SurfaceLight emits light from the face of a Class.BasePart. This object is ideal for lighting from computer screens, billboards, signs, and fluorescent panels.\n\nTo create a surface light in Studio, insert a Class.SurfaceLight into a Class.BasePart and set its Class.SurfaceLight.Face|Face property to specify which surface light emits from. Then adjust the Class.SurfaceLight.Angle|Angle and Class.SurfaceLight.Range|Range, as well as shared properties like Class.SurfaceLight.Brightness|Brightness and Class.SurfaceLight.Color|Color.\n\nFace\n\nA surface light's Class.SurfaceLight.Face|Face property determines the face of the Class.BasePart from which light emanates. Notice that light emits from the entire surface, not just a point on the surface.\n\nAngle\n\nA surface light's Class.SurfaceLight.Angle|Angle property defines the angle of light emission from the part's surface. An angle of 0 means that light travels directly outward from the surface while an angle of 180 means light travels outward perpendicular to the surface.\n\nShared properties\n\nAll light sources share various properties from the Class.Light class, including color, brightness, and shadows.\n\nColor\n\nThe Class.Light.Color|Color property sets the Datatype.Color3 value of the emitted light.\n\nBrightness\n\nThe Class.Light.Brightness|Brightness property sets the light's brightness with maximum effect at the center of the light. Note that Class.Light.Brightness|Brightness is still limited to the light's defined range, so a higher Class.Light.Brightness|Brightness value doesn't light up a larger region around the light.\n\nShadows\n\nThe Class.Light.Shadows|Shadows property projects shadows where light is blocked by an obstacle.",
    "source": "light-sources.md"
}