{
    "title": "Materials",
    "description": "Materials determine objects' visual appearance and physical properties.",
    "content": "import BetaAlert from '../includes/beta-features/beta-alert.md'\n\nRoblox's materials are unlike materials on other platforms, in that their visual appearance and their physical properties reflect those of materials in the real world. For example, concrete is heavier than plastic and sinks faster in water. When you set the material of a part or terrain, Roblox simulates its physical material properties to make this behavior just work.\n\nThe Roblox Engine offers a range of base materials suitable to build many experiences, including various categories of metal, rock, and organic materials.\n\nYou can also create your own custom materials and apply them to parts or terrain. Custom materials have an additional adaptive materials behavior that lets you adapt any model to use your art style and custom materials, even if someone else created the model.\n\nApply materials\n\nYou can quickly apply materials to parts through the Material widget. The Material Manager offers the same functionality and an additional \"paint tool\" application mode.\n\nMaterial widget\n\nThe Material widget is accessible from the Home or Model tab toolbars. Click‑holding over the small corner arrow on the button reveals a material picker. See Parts for more information.\n\nMaterial Manager\n\nThe Material Manager is accessible through Window ⟩ 3D ⟩ Material or from the Material widget's picker popup. From the manager window, you can apply materials to parts through the following workflows.\n\nThe default Enum.Material property for new Class.Part instances is Plastic. To apply a different material to parts:\n\n1. In the 3D viewport or Explorer, select one or more parts.\n2. In the Material Manager palette, hover your mouse over the desired material (you don't need to select it) and click the Apply to Selected Parts button.\n\n\n\nYou can also use a material as a painting tool that applies to parts:\n\n1. In the Material Manager, select the material you want to apply.\n1. In the top-left corner, click the Paint Parts With Selected Material button to enable the material as a painting tool.\n\n\n\n1. In the 3D viewport, hover over and click the parts that you want to apply the material to.\n1. When you're done painting, click the button again to disable the tool.\n\nCustom materials\n\nThe Material Manager provides a user interface to interact with various aspects of Class.MaterialService, including creating new custom materials and applying them to parts and terrain. Custom materials are represented by Class.MaterialVariant instances within Class.MaterialService.\n\nYou can apply custom materials per-part or globally to both parts and terrain, and you can fine-tune how custom materials apply to faces of terrain with Class.TerrainDetail instances.\n\nClass.MaterialVariant and Class.SurfaceAppearance instances both use PBR textures to customize the appearance of objects. The difference is that Class.MaterialVariant is for customizing the appearance of reusable tileable material, whereas Class.SurfaceAppearance is for customizing the visual appearance of a specific mesh with UV mapping. Class.MaterialVariant instances also have physical properties that Class.SurfaceAppearance instances don't.\n\nCreate custom materials\n\nYou can edit all properties of a custom material in the Material Manager or through the properties of a Class.MaterialVariant instance. You can also generate custom materials through the prompt‑based Material Generator.\n\nTo create a custom material in the Material Manager:\n\n1. Click the base material from which your custom material will inherit physical properties. If you skip this step, the base material will be Plastic, but you can change it later.\n\n\n\n2. In the top-left corner, click Create Material Variant.\n\n\n\n   A new variant appears in the palette with an icon in the bottom-right corner, indicating it's a custom material.\n\n\n\n3. In the inspector, rename your custom material to describe its purpose. You can change the name later, but if you do so after applying the material to parts, you'll need to re-apply it to those parts.\n4. For each texture map option such as Color or Normal, paste an asset ID or import a new texture from your computer. Square textures work best. If you don't specify an asset for a texture map, that texture remains blank.\n5. If desired, adjust the Studs Per Tile and Pattern values to change how the material looks.\n\nIf necessary, you can delete a custom material from the Material Manager by selecting it and clicking the Delete button below its preview globe. Alternatively, you can delete its associated Class.MaterialVariant instance within MaterialService of the Explorer.\n\nApply custom materials\n\nFor parts, you can use a custom material just like any other material, applying it to selected parts through the Material widget or the Material Manager.&sup1;\n\nYou can also apply the new material to a part by setting its MaterialVariant property in the Properties window. In this case, Studio automatically sets its Material property to the base material you chose when creating the material.\n\nNote that if you rename a custom material after applying it to parts, those parts will not automatically use the custom material with the new name. This behavior allows for Adaptive Materials. If you want parts to continue using a custom material after you rename it, you'll need to re-apply the custom material.\n\n&sup1; Unlike on parts, you cannot directly apply custom materials to terrain, although you can set a custom material as a material override to an existing base material for all terrain using that material.\n\nMaterial overrides\n\nYou can set a custom material as a material override to make its base material serve as a reference to the custom material. When you do so, Studio will use the custom material for both the textures and physical properties of any part or terrain that uses the custom material.\n\nMaterial overrides are the only way to apply custom materials to terrain. Note also that the materials for terrain are global per place, so you can't apply multiple variants of the same base material to the terrain in a single place.\n\nSet overrides\n\nTo set a custom material as a material override in the Material Manager:\n\n1. Click the custom material that you want to set as an override.\n1. In the inspector, scroll down to Overrides and enable Set as Override.\n\n\n\n   The new override appears as a property of MaterialService in the Properties window.\n\n\n\nTerrain details\n\nBy default, applying a custom material to parts or as an override applies that custom material as tiles across each face. For terrain, you can optionally configure Class.TerrainDetail instances to customize the top, side, and bottom of terrain voxels using that custom material.\n\nTo customize the faces of terrain using a custom material:\n\n1. In the palette of the Material Manager, click the custom material.\n1. In the inspector, confirm that its Set as Override toggle is enabled.\n\n\n\n1. In the Terrain Details section, click Create for each face you want to customize.\n\n\n\n1. For each face you enable, expand the arrow to access and edit details such as its name, texture maps, studs per tile, and pattern.\n\n\n\nDisable overrides\n\nYou can disable an entire material override and all base materials that it's currently overriding, or you can disable the override for a specific base material.\n\n1. In the palette of the Material Manager, click a custom material that's being used as an override.\n1. In the inspector, scroll down to Overrides and disable Set as Override.\n\n\n\n1. In the palette of the Material Manager, click a base material which is being overridden by a custom material.\n2. In the inspector, scroll down to Material Override and select None from the menu.\n\n\n\nPhysical properties\n\nAll materials have built-in physical properties such as density, elasticity, and friction. Through the application of custom materials with unique physical properties, you can affect global material behavior for all parts and terrain which use the custom material, such as creating an extremely slippery variant of the Ice material.\n\nWhen factoring physical properties, the engine prioritizes more granular per-part settings over material behaviors to determine the effective physical properties of a surface:\n\n\n\n\tCustom physical properties of the specific part.\n\n\n\n\n\tCustom physical properties of the part's custom material.\n\n\n\n\n\tCustom physical properties of the material override of the part's material.\n\n\n\n\n\tThe default physical properties of the part's material.\n\n\nTo set unique physical properties for any custom material and automatically apply them to all parts and terrain which use the material:\n\n1. In the palette of the Material Manager, click the custom material.\n2. In the inspector, scroll down to the Physics section and set custom physical properties as detailed in the Datatype.PhysicalProperties reference.\n\n\n\n   For any part that uses the custom material and does not have part-specific overrides, the CurrentPhysicalProperties branch in the Properties window reveals that its default physical properties are overridden by the custom material's properties.\n\n\n\nIf you need to override a part's custom material properties and set physical properties for that specific part, you can use its CustomPhysicalProperties toggle.\n\n1. With the part selected, enable CustomPhysicalProperties in the Properties window.\n\n\n\n2. Set custom physical properties as detailed in the Datatype.PhysicalProperties reference.\n\nAdaptive materials\n\nWhen you apply a custom material to a part, the part's Class.Part.MaterialVariant property becomes the name of its Class.MaterialVariant rather than its specific instance. This means that when you reuse the part in the same or a different place, as in a model or package, it's easier for you to adapt different custom materials to adjust the part's look. The adaptive behavior of custom materials has the following effects:\n\n- If you create collections of custom materials with the same name but different textures, then you can quickly change the style of a place by changing which collection is a child of Class.MaterialService.\n- If you insert a model with parts that use a custom material, then you can modify its look by creating an instance of Class.MaterialVariant in Class.MaterialService and renaming it to the same name as the previous custom material, rather than applying the new material to the parts in the model.\n\nWhen you reuse custom materials in models and packages, each MaterialVariant instance must be in Class.MaterialService for it to work.\n\n- If you distribute a model to the Creator Store with a custom material, include the Class.MaterialVariant instance in the model. For more information about distributing models to the Creator Store, see Distributing Assets.\n- If you insert a model from the Creator Store, look for any Class.MaterialVariant instances and copy them to Class.MaterialService. For more information about importing models from the Creator Store, see Creator Store.\n- If you want to use custom materials with packages, put the package in Class.MaterialService. For more information on packages, see Packages.\n\nThe Creator Store has a category called Materials for \"material packs\", models that contain only Class.MaterialVariant, Class.TerrainDetail, Class.Folder, and Class.Model instances. The Materials category is a way to promote and discover custom materials by other creators.\n\nTo make the most of adaptive materials, use a consistent naming convention for your Class.MaterialVariant instances. For example, you can use PascalCase with the base material of the custom material as the first word, as in GrassWet, GrassDry, and GrassBurned.\n\nAsset and property reference\n\nBase materials\n\nShaders generate the look and feel of materials. The base material shaders work differently than the shader which Class.MaterialVariant instances use, so you can't create custom materials that look exactly like base materials, but you can still create custom materials that use their textures. The following tables list the asset IDs for material details such as Class.SurfaceAppearance.ColorMap|ColorMap and Class.SurfaceAppearance.RoughnessMap|RoughnessMap.\n\n\n        Material\n        ColorMap\n        Normal\n        Metalness\n        Roughness\n\n\n\n        Enum.Material.Asphalt|Asphalt\n        9930003046\n        9429449876\n\n        9429450346\n\n\n        Enum.Material.Basalt|Basalt\n        9920482056\n        9438412214\n\n        9438412457\n\n\n        Enum.Material.Brick|Brick\n        9920482813\n        9438453152\n\n        9438453413\n\n\n        Enum.Material.Cardboard|Cardboard\n        14108651729\n        14108654002\n\n        14108654299\n\n\n        Enum.Material.Carpet|Carpet\n        14108662587\n        14108663154\n\n        14108663726\n\n\n        Enum.Material.CeramicTiles|CeramicTiles\n        17429425079\n        17429425915\n        17429426100\n        17429426861\n\n\n        Enum.Material.ClayRoofTiles|ClayRoofTiles\n        18147681935\n        18147683410\n\n        18147684855\n\n\n        Enum.Material.Cobblestone|Cobblestone\n        9919718991\n        9438457162\n\n        9438457470\n\n\n        Enum.Material.Concrete|Concrete\n        9920484153\n        9466554006\n\n        9466554186\n\n\n        Enum.Material.CorrodedMetal|CorrodedMetal\n        9920589327\n        9439548484\n        9439548749\n        9439556441\n\n\n        Enum.Material.CrackedLava|CrackedLava\n        9920484943\n        9438508790\n\n        9438509046\n\n\n        Enum.Material.DiamondPlate|DiamondPlate\n        10237720195\n        9438583222\n        9438583347\n        9438583558\n\n\n        Enum.Material.Fabric|Fabric\n        9920517696\n        9873280412\n\n        9873282563\n\n\n        Enum.Material.Foil|Foil\n        9466552117\n        9424786192\n        9424786272\n        9424786620\n\n\n        Enum.Material.ForceField|ForceField&sup2;\n\n\n\n\n\n\n        Enum.Material.Glacier|Glacier\n        9920518732\n        9438812958\n\n        9438851286\n\n\n        Enum.Material.Glass|Glass&sup3;\n        9438868521\n        7547304785\n\n        7547304892\n\n\n        Enum.Material.Granite|Granite\n        9920550238\n        9438882935\n\n        9438883109\n\n\n        Enum.Material.Grass|Grass\n        9920551868\n        9438955773\n\n        9438955997\n\n\n        Enum.Material.Ground|Ground\n        9920554482\n        9439043558\n\n        9439043765\n\n\n        Enum.Material.Ice|Ice\n        9920555943\n        9467301039\n\n        9467301203\n\n\n        Enum.Material.LeafyGrass|LeafyGrass\n        9920557906\n        9439080781\n\n        9439080950\n\n\n        Enum.Material.Leather|Leather\n        14108670073\n        14108670486\n\n        14108670748\n\n\n        Enum.Material.Limestone|Limestone\n        9920561437\n        9439415191\n\n        9439415495\n\n\n        Enum.Material.Marble|Marble\n        9439430596\n        9439431240\n\n        9439431383\n\n\n        Enum.Material.Metal|Metal\n        9920574687\n        9873295432\n        9873318201\n        9873318890\n\n\n        Enum.Material.Mud|Mud\n        9920578473\n        9439509827\n\n        9439510012\n\n\n        Enum.Material.Neon|Neon&sup2;\n\n\n\n\n\n\n        Enum.Material.Pavement|Pavement\n        9920579943\n        9439519281\n\n        9439519532\n\n\n        Enum.Material.Pebble|Pebble\n        9920581082\n        9439528644\n\n        9439537267\n\n\n        Enum.Material.Plaster|Plaster\n        14108671255\n        14108671870\n\n        14108672378\n\n\n        Enum.Material.Plastic|Plastic&sup2;\n\n\n\n\n\n\n        Enum.Material.Rock|Rock\n        9920587470\n        9439538417\n\n        9439545859\n\n\n        Enum.Material.RoofShingles|RoofShingles\n        119722544879522\n        77534750680073\n\n        129397260312247\n\n\n        Enum.Material.Rubber|Rubber\n        14108673018\n        14108674698\n        14108674894\n        14108675142\n\n\n        Enum.Material.Salt|Salt\n        9920590225\n        9439565809\n\n        9439566688\n\n\n        Enum.Material.Sand|Sand\n        9920591683\n        9439577084\n\n        9439577327\n\n\n        Enum.Material.Sandstone|Sandstone\n        9920596120\n        9439596530\n\n        9439596711\n\n\n        Enum.Material.Slate|Slate\n        9920599782\n        9439612514\n\n        9439612733\n\n\n        Enum.Material.SmoothPlastic|SmoothPlastic&sup2;\n\n\n\n\n\n\n        Enum.Material.Snow|Snow\n        9920620284\n        9439632006\n\n        9439632145\n\n\n        Enum.Material.Wood|Wood\n        9920625290\n        9439641376\n\n        9439648605\n\n\n        Enum.Material.WoodPlanks|WoodPlanks\n        9920626778\n        9439650689\n\n        9439658127\n\n\n&sup2; Material is unique and/or its texture assets are bundled with Studio instead of being accessible as a typical asset ID.\n&sup3; Refraction of light through the glass material is not supported on mobile devices due to computational limitations.\n\n\n        Material\n        Color\n        Normal\n        Metalness\n        Roughness\n\n\n\n        Enum.Material.Brick|Brick\n        7546648254\n        7546649654\n\n        7546650017\n\n\n        Enum.Material.Cobblestone|Cobblestone\n        7546651802\n        7546652689\n\n        7546652892\n\n\n        Enum.Material.Concrete|Concrete\n        7546653328\n        7546653707\n\n        7546653868\n\n\n        Enum.Material.CorrodedMetal|CorrodedMetal\n        7547183598\n        7547181182\n        7547184321\n        7547184588\n\n\n        Enum.Material.DiamondPlate|DiamondPlate\n        7546654401\n        7546654536\n        7547162002\n        7547162137\n\n\n        Enum.Material.Fabric|Fabric\n        7547100606\n        7547100915\n\n        7547101072\n\n\n        Enum.Material.Foil|Foil\n        7546644642\n        7546644903\n        7546644642\n        7546644963\n\n\n        Enum.Material.Glass|Glass\n        7547304577\n        7547304785\n\n        7547304892\n\n\n        Enum.Material.Granite|Granite\n        7547164400\n        7546654648\n\n        7547164660\n\n\n        Enum.Material.Grass|Grass\n        7547167347\n        7547168653\n\n        7547169207\n\n\n        Enum.Material.Ice|Ice\n        7546644642\n        7547171198\n\n        7547171276\n\n\n        Enum.Material.Marble|Marble\n        7547174345\n        7547176060\n\n        7547177213\n\n\n        Enum.Material.Metal|Metal\n        7547178395\n        7547287997\n        7547288112\n        7547179082\n\n\n        Enum.Material.Pebble|Pebble\n        7547291174\n        7546645052\n\n        7547291306\n\n\n        Enum.Material.Sand|Sand\n        7547294684\n        7547294810\n\n        7547295087\n\n\n        Enum.Material.Slate|Slate\n        7547297050\n        7547297808\n\n        7547298051\n\n\n        Enum.Material.Wood|Wood\n        7547190453\n        7547190548\n        7547190619\n        7547303147\n\n\n        Enum.Material.WoodPlanks|WoodPlanks\n        7547301709\n        7547188159\n        7547188891\n        7547332869\n\n\n\n        Material\n        Terrain Face\n        Color\n        Normal\n        Roughness\n\n\n\n        Enum.Material.Asphalt|Asphalt\n        Top\n        9930003046\n        9429449876\n        9429450346\n\n\n        Side\n        9930005689\n        9429465046\n        9429466226\n\n\n        Enum.Material.Basalt|Basalt\n        (all)\n        9920482056\n        9438412214\n        9438412457\n\n\n        Enum.Material.Brick|Brick\n        (all)\n        9920482813\n        9438453152\n        9438453413\n\n\n        Enum.Material.Cobblestone|Cobblestone\n        (all)\n        9919718991\n        9438457162\n        9438457470\n\n\n        Enum.Material.Concrete|Concrete\n        (all)\n        9920484153\n        9466554006\n        9466554186\n\n\n        Enum.Material.CrackedLava|CrackedLava\n        (all)\n        9920484943\n        9438508790\n        9438509046\n\n\n        Enum.Material.Glacier|Glacier\n        Top\n        9920518732\n        9438812958\n        9438851286\n\n\n        Side\n        9920520269\n        9438853412\n        9438853585\n\n\n        Bottom\n        9920521000\n        9438867267\n        9438867465\n\n\n        Enum.Material.Grass|Grass\n        Top\n        9920551868\n        9438955773\n        9438955997\n\n\n        Side\n        9932815307\n        9438958337\n        9439010060\n\n\n        Bottom\n        9932815307\n        9439011893\n        9439012136\n\n\n        Enum.Material.Ground|Ground\n        (all)\n        9920554482\n        9439043558\n        9439043765\n\n\n        Enum.Material.Ice|Ice\n        Top\n        9920555943\n        9467301039\n        9467301203\n\n\n        Side\n        9920556722\n        9439071195\n        9439071371\n\n\n        Enum.Material.LeafyGrass|LeafyGrass\n        Top\n        9920557906\n        9439080781\n        9439080950\n\n\n        Side\n        9932815307\n        9439151713\n        9439151929\n\n\n        Bottom\n        9932815307\n        9439151713\n        9439151929\n\n\n        Enum.Material.Limestone|Limestone\n        Top\n        9920561437\n        9439415191\n        9439415495\n\n\n        Side\n        9920562675\n        9439417923\n        9439418334\n\n\n        Enum.Material.Mud|Mud\n        (all)\n        9920578473\n        9439509827\n        9439510012\n\n\n        Enum.Material.Pavement|Pavement\n        Top\n        9920579943\n        9439519281\n        9439519532\n\n\n        Side\n        9920580293\n        9439527387\n        9439527572\n\n\n        Enum.Material.Rock|Rock\n        (all)\n        9920587470\n        9439538417\n        9439545859\n\n\n        Enum.Material.Salt|Salt\n        Top\n        9920590225\n        9439565809\n        9439566688\n\n\n        Side\n        9920590689\n        9439568299\n        9439575868\n\n\n        Enum.Material.Sand|Sand\n        Top\n        9920591683\n        9439577084\n        9439577327\n\n\n        Side\n        9920592270\n        9439586304\n        9439593887\n\n\n        Enum.Material.Sandstone|Sandstone\n        Top\n        9920596120\n        9439596530\n        9439596711\n\n\n        Side\n        9920628274\n        9439605275\n        9439605506\n\n\n        Enum.Material.Slate|Slate\n        Top\n        9920599782\n        9439612514\n        9439612733\n\n\n        Side\n        9920614158\n        9439615040\n        9439621979\n\n\n        Enum.Material.Snow|Snow\n        Top\n        9920620284\n        9439632006\n        9439632145\n\n\n        Side\n        9920620898\n        9439639648\n        9439640077\n\n\n        Enum.Material.WoodPlanks|WoodPlanks\n        (all)\n        9920626778\n        9439650689\n        9439658127\n\n\n\n        Material\n        Terrain Face\n        Color\n        Normal\n        Roughness\n\n\n\n        Enum.Material.Asphalt|Asphalt\n        Top\n        7547349715\n        7547350415\n        7551984908\n\n\n        Side\n        7551989667\n        7547322693\n        7547350597\n\n\n        Enum.Material.Basalt|Basalt\n        (all)\n        7551975939\n        7547348152\n        7551977581\n\n\n        Enum.Material.Brick|Brick\n        (all)\n        7547631333\n        7547633037\n        7546657679\n\n\n        Enum.Material.Cobblestone|Cobblestone\n        Top\n        7551992689\n        7547351364\n        7547351553\n\n\n        Side\n        7547648825\n        7547352096\n        7547649793\n\n\n        Enum.Material.Concrete|Concrete\n        Top\n        7547196561\n        7547337919\n        7547197958\n\n\n        Side\n        7547628584\n        7547199386\n        7547310473\n\n\n        Enum.Material.CrackedLava|CrackedLava\n        (all)\n        7551980711\n        7547320674\n        7551982079\n\n\n        Enum.Material.Glacier|Glacier\n        Top\n        7547646888\n        7551930815\n        7551932698\n\n\n        Side\n        7551937696\n        7551940030\n        7551941712\n\n\n        Bottom\n        7551946144\n        7551948150\n        7551932698\n\n\n        Enum.Material.Grass|Grass\n        Top\n        7547307376\n        7547336606\n        7547308019\n\n\n        Side\n        7547621556\n        7547191705\n        7547622691\n\n\n        Bottom\n        7551927733\n        7547193357\n        7547625590\n\n\n        Enum.Material.Ground|Ground\n        (all)\n        7547348623\n        7547348887\n        7547349016\n\n\n        Enum.Material.Ice|Ice\n        Top\n        7547352634\n        7547651999\n        7547652934\n\n\n        Side\n        7547656350\n        7547657495\n        7546663210\n\n\n        Enum.Material.LeafyGrass|LeafyGrass\n        Top\n        7546663659\n        7546664288\n        7546664614\n\n\n        Side\n        7546665232\n        7546666003\n        7546666120\n\n\n        Enum.Material.Limestone|Limestone\n        Top\n        7547206319\n        7547670319\n        7547671387\n\n\n        Side\n        7547206579\n        7547674533\n        7547206799\n\n\n        Enum.Material.Mud|Mud\n        (all)\n        7551972606\n        7552022188\n        7552023936\n\n\n        Enum.Material.Pavement|Pavement\n        Top\n        7547678151\n        7547207799\n        7547207869\n\n\n        Side\n        7547680765\n        7547208846\n        7547682025\n\n\n        Enum.Material.Rock|Rock\n        (all)\n        7546659890\n        7546660701\n        7547643804\n\n\n        Enum.Material.Salt|Salt\n        Top\n        7546666647\n        7547660879\n        7547661939\n\n\n        Side\n        7547665222\n        7547667170\n        7547668252\n\n\n        Enum.Material.Sand|Sand\n        Top\n        7547635114\n        7547311493\n        7546658153\n\n\n        Side\n        7546658461\n        7546659003\n        7546659187\n\n\n        Enum.Material.Sandstone|Sandstone\n        Top\n        7547202858\n        7547204511\n        7551954003\n\n\n        Side\n        7551958805\n        7551960790\n        7551962377\n\n\n        Bottom\n        7551967204\n        7551968869\n        7551970693\n\n\n        Enum.Material.Slate|Slate\n        (all)\n        7547309616\n        7546656859\n        7547626537\n\n\n        Enum.Material.Snow|Snow\n        (all)\n        7547315875\n        7547201338\n        7547316776\n\n\n        Enum.Material.WoodPlanks|WoodPlanks\n        (all)\n        7547637836\n        7547639230\n        7547640511\n\n\nDefault colors\n\nThe following table lists the default RGB values for each base material. For information on how to color parts and terrain, see Parts and Environmental Terrain.\n\n\n        Material\n        RGB Value\n        Color\n\n\n\n        Enum.Material.Asphalt|Asphalt\n        [80, 84, 84]\n\n\n\n        Enum.Material.Basalt|Basalt\n        [75, 74, 74]\n\n\n\n        Enum.Material.Brick|Brick\n        [138, 97, 73]\n\n\n\n        Enum.Material.Cardboard|Cardboard\n        [255, 206, 152]\n\n\n\n        Enum.Material.Carpet|Carpet\n        [163, 162, 165]\n\n\n\n        Enum.Material.CeramicTiles|CeramicTiles\n        [181, 173, 156]\n\n\n\n        Enum.Material.ClayRoofTiles|ClayRoofTiles\n        [255, 142, 87]\n\n\n\n        Enum.Material.Cobblestone|Cobblestone\n        [134, 134, 118]\n\n\n\n        Enum.Material.Concrete|Concrete\n        [152, 152, 152]\n\n\n\n        Enum.Material.CorrodedMetal|CorrodedMetal\n        [104, 140, 173]\n\n\n\n        Enum.Material.CrackedLava|CrackedLava\n        [255, 24, 67]\n\n\n\n        Enum.Material.DiamondPlate|DiamondPlate\n        [168, 175, 176]\n\n\n\n        Enum.Material.Fabric|Fabric\n        [194, 193, 168]\n\n\n\n        Enum.Material.Foil|Foil\n        [168, 175, 176]\n\n\n\n        Enum.Material.ForceField|ForceField\n        [163, 162, 165]\n\n\n\n        Enum.Material.Glacier|Glacier\n        [221, 228, 229]\n\n\n\n        Enum.Material.Glass|Glass\n        [138, 167, 168]\n\n\n\n        Enum.Material.Granite|Granite\n        [149, 146, 139]\n\n\n\n        Enum.Material.Grass|Grass\n        [111, 126, 62]\n\n\n\n        Enum.Material.Ground|Ground\n        [140, 130, 104]\n\n\n\n        Enum.Material.Ice|Ice\n        [204, 210, 223]\n\n\n\n        Enum.Material.LeafyGrass|LeafyGrass\n        [106, 134, 64]\n\n\n\n        Enum.Material.Leather|Leather\n        [110, 73, 53]\n\n\n\n        Enum.Material.Limestone|Limestone\n        [255, 243, 192]\n\n\n\n        Enum.Material.Marble|Marble\n        [122, 122, 122]\n\n\n\n        Enum.Material.Metal|Metal\n        [168, 175, 176]\n\n\n\n        Enum.Material.Mud|Mud\n        [121, 112, 98]\n\n\n\n        Enum.Material.Neon|Neon\n        [163, 162, 165]\n\n\n\n        Enum.Material.Pavement|Pavement\n        [143, 144, 135]\n\n\n\n        Enum.Material.Pebble|Pebble\n        [122, 122, 118]\n\n\n\n        Enum.Material.Plaster|Plaster\n        [204, 142, 105]\n\n\n\n        Enum.Material.Plastic|Plastic\n        [163, 162, 165]\n\n\n\n        Enum.Material.Rock|Rock\n        [99, 100, 102]\n\n\n\n        Enum.Material.RoofShingles|RoofShingles\n        [66, 66, 66]\n\n\n\n        Enum.Material.Rubber|Rubber\n        [32, 32, 32]\n\n\n\n        Enum.Material.Salt|Salt\n        [255, 255, 254]\n\n\n\n        Enum.Material.Sand|Sand\n        [207, 203, 167]\n\n\n\n        Enum.Material.Sandstone|Sandstone\n        [148, 124, 95]\n\n\n\n        Enum.Material.Slate|Slate\n        [88, 89, 86]\n\n\n\n        Enum.Material.SmoothPlastic|SmoothPlastic\n        [163, 162, 165]\n\n\n\n        Enum.Material.Snow|Snow\n        [235, 253, 255]\n\n\n\n        Enum.Material.Wood|Wood\n        [172, 148, 108]\n\n\n\n        Enum.Material.WoodPlanks|WoodPlanks\n        [172, 148, 108]\n\n\n\nDefault physical properties\n\nThe following table lists each material's default physical properties as detailed in the Datatype.PhysicalProperties reference. For information on customizing physical properties, see physical properties.\n\n\n\n      Material\n      Density\n      Elasticity\n      ElasticityWeight\n      Friction\n      FrictionWeight\n\n\n\n\n      Enum.Material.Asphalt|Asphalt\n      2.36\n      0.2\n      1\n      0.8\n      0.3\n\n\n      Enum.Material.Basalt|Basalt\n      2.691\n      0.15\n      1\n      0.7\n      0.3\n\n\n      Enum.Material.Brick|Brick\n      1.922\n      0.15\n      1\n      0.8\n      0.3\n\n\n      Enum.Material.Cardboard|Cardboard\n      0.7\n      0.05\n      2\n      0.5\n      1\n\n\n      Enum.Material.Carpet|Carpet\n      1.1\n      0.25\n      2\n      0.4\n      1\n\n\n      Enum.Material.CeramicTiles|CeramicTiles\n      2.4\n      0.2\n      1\n      0.51\n      1\n\n\n      Enum.Material.ClayRoofTiles|ClayRoofTiles\n      2\n      0.2\n      1\n      0.51\n      1\n\n\n      Enum.Material.Cobblestone|Cobblestone\n      2.691\n      0.17\n      1\n      0.5\n      1\n\n\n      Enum.Material.Concrete|Concrete\n      2.403\n      0.2\n      1\n      0.7\n      0.3\n\n\n      Enum.Material.CorrodedMetal|CorrodedMetal\n      7.85\n      0.2\n      1\n      0.7\n      1\n\n\n      Enum.Material.CrackedLava|CrackedLava\n      2.691\n      0.15\n      1\n      0.65\n      1\n\n\n      Enum.Material.DiamondPlate|DiamondPlate\n      7.85\n      0.25\n      1\n      0.35\n      1\n\n\n      Enum.Material.Fabric|Fabric\n      0.7\n      0.05\n      1\n      0.35\n      1\n\n\n      Enum.Material.Foil|Foil\n      2.7\n      0.25\n      1\n      0.4\n      1\n\n\n      Enum.Material.ForceField|ForceField\n      2.403\n      0.2\n      1\n      0.25\n      1\n\n\n      Enum.Material.Glacier|Glacier\n      0.919\n      0.15\n      1\n      0.05\n      2\n\n\n      Enum.Material.Glass|Glass\n      2.403\n      0.2\n      1\n      0.25\n      1\n\n\n      Enum.Material.Granite|Granite\n      2.691\n      0.2\n      1\n      0.4\n      1\n\n\n      Enum.Material.Grass|Grass\n      0.9\n      0.1\n      1.5\n      0.4\n      1\n\n\n      Enum.Material.Ground|Ground\n      0.9\n      0.1\n      1\n      0.45\n      1\n\n\n      Enum.Material.Ice|Ice\n      0.919\n      0.15\n      1\n      0.02\n      3\n\n\n      Enum.Material.LeafyGrass|LeafyGrass\n      0.9\n      0.1\n      2\n      0.4\n      2\n\n\n      Enum.Material.Leather|Leather\n      0.86\n      0.25\n      1\n      0.35\n      1\n\n\n      Enum.Material.Limestone|Limestone\n      2.691\n      0.15\n      1\n      0.5\n      1\n\n\n      Enum.Material.Marble|Marble\n      2.563\n      0.17\n      1\n      0.2\n      1\n\n\n      Enum.Material.Metal|Metal\n      7.85\n      0.25\n      1\n      0.4\n      1\n\n\n      Enum.Material.Mud|Mud\n      0.9\n      0.07\n      4\n      0.3\n      3\n\n\n      Enum.Material.Neon|Neon\n      0.7\n      0.2\n      1\n      0.3\n      1\n\n\n      Enum.Material.Pavement|Pavement\n      2.691\n      0.17\n      1\n      0.5\n      0.3\n\n\n      Enum.Material.Pebble|Pebble\n      2.403\n      0.17\n      1.5\n      0.4\n      1\n\n\n      Enum.Material.Plaster|Plaster\n      0.75\n      0.2\n      1\n      0.6\n      0.3\n\n\n      Enum.Material.Plastic|Plastic\n      0.7\n      0.5\n      1\n      0.3\n      1\n\n\n      Enum.Material.Rock|Rock\n      2.691\n      0.17\n      1\n      0.5\n      1\n\n\n      Enum.Material.RoofShingles|RoofShingles\n      2.36\n      0.2\n      1\n      0.8\n      0.3\n\n\n      Enum.Material.Rubber|Rubber\n      1.3\n      0.95\n      2\n      1.5\n      3\n\n\n      Enum.Material.Salt|Salt\n      2.165\n      0.05\n      1\n      0.5\n      1\n\n\n      Enum.Material.Sand|Sand\n      1.602\n      0.05\n      2.5\n      0.5\n      5\n\n\n      Enum.Material.Sandstone|Sandstone\n      2.691\n      0.15\n      1\n      0.5\n      5\n\n\n      Enum.Material.SmoothPlastic|SmoothPlastic\n      0.7\n      0.5\n      1\n      0.2\n      1\n\n\n      Enum.Material.Slate|Slate\n      2.691\n      0.2\n      1\n      0.4\n      1\n\n\n      Enum.Material.Snow|Snow\n      0.9\n      0.03\n      4\n      0.3\n      3\n\n\n      Enum.Material.Wood|Wood\n      0.35\n      0.2\n      1\n      0.48\n      1\n\n\n      Enum.Material.WoodPlanks|WoodPlanks\n      0.35\n      0.2\n      1\n      0.48\n      1",
    "source": "materials.md"
}