{
    "title": "Mobile input",
    "description": "Explains Roblox support for mobile devices.",
    "content": "The majority of Roblox sessions are played on mobile devices, so it's important to consider the mobile device orientation and other cross‑platform factors when designing an experience for a wide audience.\n\nTo simplify cross‑platform inputs, including player interaction with virtual buttons, Roblox provides the Input Action System to define actions such as \"jump,\" \"sprint,\" or \"shoot\" and set up bindings for multiple hardware inputs to drive those actions.\n\nRoblox also supports native mobile features like haptic feedback, touch gestures such as Class.UserInputService.TouchSwipe|TouchSwipe and Class.UserInputService.TouchPinch|TouchPinch, or accelerometer and gyroscope functionality on Class.UserInputService.AccelerometerEnabled|AccelerometerEnabled and Class.UserInputService.GyroscopeEnabled|GyroscopeEnabled devices.\n\nInput type detection\n\nIn cross‑platform development, it's important that you determine and respond to the Class.UserInputService.PreferredInput|PreferredInput type a player is using, normally to ensure that UI elements like on-screen buttons and menus work elegantly and support interaction across devices.\n\nFor example, a touch-enabled device assumes touch is the default input and that touch-buttons may appear for actions, but a player may choose to connect a bluetooth gamepad. In this case, touch remains a valid input, but you can assume the player wants to switch to the connected gamepad as the primary input type and possibly use touch as a backup input for on-screen UI.\n\nSee input type detection for more information.\n\nDevice orientation\n\nBy default, Roblox experiences run in landscape mode, allowing the experience to switch between landscape \"left\" and landscape \"right\" as the player's device rotates. However, experiences can be locked to a particular orientation if desired.\n\nThere are five different orientation modes, including two sensor-based modes and three locked modes.&sup1; Each of these can be set as the default orientation through Class.StarterGui.ScreenOrientation, accessible through Studio's Properties window.\n\n\n    Sensor Modes\n\n\n\n    Enum.ScreenOrientation|LandscapeSensor\n    The default Roblox setting in which the experience always appears in landscape mode (no portrait mode) and the device detects its physical orientation to ensure the experience view is always oriented upward.\n\n\n    Enum.ScreenOrientation|Sensor\n    The device detects its physical orientation to ensure the experience view is always oriented upward, switching between landscape and portrait mode as needed.\n\n\n\n    Locked Modes\n\n\n\n    Enum.ScreenOrientation|LandscapeLeft\n    On devices with a virtual home/nav bar, its touch region is at the bottom of the display. On devices with a physical home button, the home button is to the left of the display.\n\n\n    Enum.ScreenOrientation|LandscapeRight\n    On devices with a virtual home/nav bar, its touch region is at the bottom of the display. On devices with a physical home button, the home button is to the right of the display.\n\n\n    Enum.ScreenOrientation|Portrait\n    On devices with a virtual home/nav bar, its touch region is at the bottom of the display. On devices with a physical home button, the home button is below the display.\n\n\n&sup1; Roblox does not include a \"portrait upside-down\" mode since many devices do not natively support that orientation\n\nBeyond the default Class.StarterGui.ScreenOrientation property, you can change orientation during gameplay through Class.PlayerGui.ScreenOrientation. This can be useful when an experience needs to enforce an orientation, such as locking the view to Enum.ScreenOrientation|Portrait for a minigame.\n\nThe following code in a Class.LocalScript sets the screen orientation to portrait after a short delay:\n\nlua title=\"LocalScript - Change Screen Orientation to Portrait\"\nlocal Players = game:GetService(\"Players\")\n\nlocal player = Players.LocalPlayer\nlocal playerGui = player.PlayerGui\n\ntask.wait(5)\n\nplayerGui.ScreenOrientation = Enum.ScreenOrientation.Portrait\n\nFinally, you can detect changes to screen orientation during gameplay by listening to value changes on the Class.PlayerGui.CurrentScreenOrientation property.\n\nlua title=\"LocalScript - Detect Screen Orientation Changes\"\nlocal Players = game:GetService(\"Players\")\n\nlocal player = Players.LocalPlayer\nlocal playerGui = player.PlayerGui\n\nlocal function onOrientationChange()\n\tprint(\"Orientation changed to\", playerGui.ScreenOrientation)\nend\n\nplayerGui:GetPropertyChangedSignal(\"ScreenOrientation\"):Connect(onOrientationChange)\n\nHaptic feedback\n\nMost mobile devices have motors built in to provide haptic feedback. Adding rumbles and vibrations can greatly enhance a player's experience and provide subtle feedback beyond visuals or audio.\n\nRoblox supports haptics for haptic-capable devices including most iPhone, Pixel, and Samsung Galaxy devices. Haptic feedback is managed through Class.HapticEffect instances which can be set to a specific Class.HapticEffect.Type|Type such as Enum.HapticEffectType|GameplayCollision or Enum.HapticEffectType|UIClick.\n\nOnce a Class.HapticEffect is in place, you can initiate it through the Class.HapticEffect:Play()|Play() method, for instance:\n\nlua\nlocal Workspace = game:GetService(\"Workspace\")\n\nlocal effect = Instance.new(\"HapticEffect\")\neffect.Type = Enum.HapticEffectType.GameplayExplosion\neffect.Parent = Workspace\n\n-- Play the haptic effect\neffect:Play()",
    "source": "mobile.md"
}