{
    "title": "Models",
    "description": "Models are container objects for geometric groupings like parts, Motor6D objects, and other models.",
    "content": "Models are containers for physical objects that you can use to organize your workspace and group your assets, such as parts, welds, or joints. While models often contain connected parts known as an assembly, they can also contain any number of individual parts or objects, such as scripts, attachments, or other models.\n\nTo demonstrate, avatar characters are a single Class.Model containing the appropriate humanoid parts, joints, and scripts necessary for runtime behavior:\n\n\n\n\t\tA model named Octavia\n\n\n\n    \tThe groupings that comprise the model\n\n\nCreate models\n\nYou can create models using any open use or restricted asset, but any restricted assets that you don't have explicit permission to use are not visible or audible at runtime unless the experience itself has permission to use those assets.\n\nThere are two ways to create models:\n\n- Group objects together to automatically form a Class.Model object.\n- Insert an empty Class.Model object into the Workspace, then manually add child objects to the model.\n\nTo create a model using the grouping method:\n\n1. In the Explorer window or 3D viewport, select every object that you want to group into a model.\n1. Right-click on one of the objects and select Group, or press CtrlG on Windows or ⌘G on Mac. A new Class.Model object displays with all of the objects that make up the model nested underneath.\n\n\n\nTo completely ungroup a model back to its original objects, right-click it and select Ungroup, or press CtrlU on Windows or ⌘U on Mac.\n\nSet a primary part\n\nIf you have a model with parts that are joined together through physical joints like Class.WeldConstraint|WeldConstraints or Class.Motor6D|Motor6Ds, you should specify a Class.BasePart within the model to become a Class.Model.PrimaryPart|PrimaryPart. A model's Class.Model.PrimaryPart|PrimaryPart is the physical reference that specifies which Class.BasePart the pivot point and bounding box should move with when the model changes position or orientation.\n\nTo set a primary part:\n\n1. In the Explorer window, select a model.\n1. In the Properties window, select the PrimaryPart property. Your cursor changes.\n1. Back in the Explorer window, select the part that you want to become your primary part.\n\nSelect models\n\nAs you hover over models in the viewport, they are outlined to indicate their potential selection. You can select an outlined model by clicking it, or you can select multiple models by holding Shift, Ctrl, or ⌘ as you hover over and click them.\n\nAs models typically contain multiple child parts or meshes, some children may be hidden from view. To select a specific child without moving the camera around or locating the child in the Explorer hierarchy, click while holding Alt on Windows or ⌥ on Mac to perform selection cycling.\n\n\n  Selection cycling\n\nTransform models\n\nYou can move, scale, or rotate a model using the Studio transform tools. Unless you've set a primary part, a model transforms based on the center of its bounding box.\n\nAdditionally, within a Class.Script or Class.LocalScript, you can move or rotate a model through the following methods:\n\n\n    Method\n    Description\n\n\n\n    Class.Model:MoveTo()|MoveTo()\n\tMoves the model's Class.Model.PrimaryPart|PrimaryPart to the given position. If a primary part has not been specified, the root part of the model will be used.\n\n\n    Class.PVInstance:PivotTo()|PivotTo()\n\tTransforms the model along with all of its descendant Class.PVInstance|PVInstances such that the pivot is located at the specified Datatype.CFrame.\n\n\n    Class.Model:TranslateBy()|TranslateBy()\n\tShifts a model by the given Datatype.Vector3 offset, preserving the model's orientation.\n\n\nModel behaviors\n\nWhile models act similarly to Class.Folder objects for most purposes in your experience, they also exhibit some unique behaviors.\n\nCharacter models\n\nWhen a Class.Humanoid is present inside a model that contains a Class.Part named Head, Roblox displays a name and/or health bar above that part. For more information, see Character Name/Health Display.\n\nDestroy height\n\nTo prevent parts that have fallen off of an experience's map from continuing to fall forever, Studio automatically destroys parts that fall below the Class.Workspace.FallenPartsDestroyHeight value. If a part destroyed due to this behavior is the last part in a model, then that model will also be destroyed.\n\nModel streaming\n\nInstance streaming dynamically loads and unloads Class.Model|Models on a player's device as their character explores the 3D world. With streaming enabled, you can specify the way each model should be treated under streaming behavior. For example, a model set to Persistent will never stream out, or a model set to Atomic will stream in and out as a single unit with all of its descendants. For more information, see Per-model streaming controls.\n\nBecause the 3D content that exists on the client changes dynamically in a streaming-enabled experience, models might suddenly disappear, which can be visually jarring for the player. To avoid this situation, you can set specific models to render as optimized \"SLIM\" meshes or as lower resolution \"imposter\" meshes when streamed out. See Model level of detail.\n\nUpload models\n\nWhen you upload or import a .gltf, .fbx and .obj model file to the cloud using the 3D Importer, Roblox represents it as a cloud-based asset with a unique corresponding ID. This cloud-based asset system allows you to store models through Roblox and reuse them across the platform in various contexts without maintaining local copies as part of each saved Studio experience.\n\nTo upload a model you made in Studio:\n\n1. In the Explorer window, right-click your model. A contextual menu displays.\n2. Select Save to Roblox. The Asset Configuration window displays.\n3. In the Asset Configuration window,\n   1. Set Content Type to Development Item.\n   1. Set Asset Category to Model.\n   1. Complete the following fields:\n\n      - Title - The name of your model.\n      - Description - A short description of your model.\n      - Creator - Use the dropdown to select if you'd like to publish this asset as an individual or as part of an associated group.\n      - Genre - The genre of your model.\n\n   1. Click the Save button. After a moment, the Asset Configuration window displays your model's asset ID that you can use in your projects or share with other creators, groups, or experiences. For more information on granting permission to collaborators and experiences so that they can use your models, see Asset privacy\n\nDistribute models\n\nYou can distribute models with less than 15,000 dependencies to the Creator Store for other creators to use within their own experiences as long as each model only references:\n\n- Open use assets.\n- Restricted assets that you created, excluding audio and video.\n- Audio and video assets from the Creator Store.\n\nIf you are in a supported country, you can sell models you created on the Creator Store for United States Dollars (USD). Eligible Creators must complete an application form through Stripe to create their seller account, set prices, and receive payouts. For more information and to start onboarding, see Sell on the Creator Store.\n\nIf you want to distribute a model with a child audio asset that you created, you must distribute the audio asset on the Creator Store before making it a child of the model in order for the audio to be audible at runtime.\n\nAs with any asset, all models must adhere to the Community Rules, Terms of Use, the DMCA Guidelines regarding copyright, and Creator Store asset moderation rules. If you suspect a rights violation involving your asset, you can submit the content for removal using the Rights Manager.\n\nWhen creating models for the Creator Store:\n\n- Read about Roblox texture specifications and limits.\n- Limit each mesh to a maximum of 20,000 triangles.\n- Read and address any warnings shown during the import process.\n- Scale and orient your model appropriately during import so that it's usable out of the box when inserted from the Creator Store.",
    "source": "models.md"
}