{
    "title": "Sound objects",
    "description": "Sound objects are legacy instances that emit sound within an experience.",
    "content": "There is a newer set of audio objects that offer more control and address robust use cases. For more information, see Audio.\n\nAudio playback occurs through Class.Sound objects which emit audio within an experience. Roblox assigns each audio asset a unique ID that you can assign to Class.Sound objects to play a specific sound effect or music track. You can either set this audio to play automatically at runtime, or trigger it to play from scripts.\n\nTo modify playback of multiple Class.Sound objects, you can assign them to a sound group and control the entire group's volume, as well as apply dynamic effects.\n\nCreate sound objects\n\nThere are three locations you can create a Class.Sound object, and each location determines how audio emits and volume changes in relation to the user's position within the experience.\n\n\n    Location\n    How audio emits\n    How volume changes\n\n\n\n    Child of a block, sphere, or cylinder Class.BasePart.\n    Audio emits outward from the entire surface of the part.\n    Volume changes depending on the distance between the user's sound listener and the position of the part, as well as its size.\n\n\n    Child of an Class.Attachment, Class.MeshPart, Class.TrussPart, Class.WedgePart, or Class.CornerWedgePart.\n    Audio emits outward from the single attachment point or part center.\n    Volume changes depending on the distance between the user's sound listener and the attachment/part position.\n\n\n    Within Class.SoundService or Class.Workspace.\n    Audio emits throughout the experience.\n    Volume and pan position remain the same regardless of the user's sound listener position or rotation.\n\n\nPositional audio\n\nPositional audio is audio that users can only hear near a specific position within the experience. There are two types of positional audio you can utilize: volumetric and point source.\n\nVolumetric\n\nVolumetric audio is the most realistic audio option, as it dynamically changes depending on the user's position to the audio source. For example, if the user is within a Class.BasePart with a child Class.Sound object, audio plays all around the user, similar to music in headphones playing at the same volume in each speaker. When the user exits the part, audio gradually decreases in volume and becomes more directional per speaker, moving around the user's head when their listener rotates. For information on the properties that control how loud your audio is at different distances from the part, see RollOffMinDistance and RollOffMaxDistance.\n\nThe size of the Class.BasePart also affects the audio's volume, as larger Class.BasePart|BaseParts produce a wider area in which users can hear the audio and when a user navigates away from a large Class.BasePart, volume decreases slower. The following example displays a Class.BasePart that is the size of a city with a Class.Sound object playing ambient audio. Users A and B experience the audio differently: user B is closer to the large Class.BasePart, and they mostly hear the audio around the same loudness in both speakers. Conversely, user A is further away from the city, so the audio they hear is quieter and more directional than user B, playing at differing loudness in each of their speakers.\n\nVolumetric audio is useful for any audio that needs to be immersive around a user and change dynamically depending on the user's position, such as a concert stage or ambience zones like rainfall. When you experiment with placing a Class.Sound object on Class.BasePart|BaseParts of different sizes and positions from users, you can hear how immersive volumetric audio can be.\n\nTo create a Class.Sound object for volumetric audio:\n\n1. In the Explorer window, select SoundService.\n2. In the Properties window, navigate to the VolumetricAudio property, then set it to Enabled.\n3. In the Explorer window, hover over a Class.BasePart, then click the ⊕ button. A contextual menu displays.\n4. From the menu, insert a Sound.\n5. In the Properties window, navigate to the SoundId property and input a valid audio asset ID.\n\n\n\n6. (Optional) If you want the audio to start playing when the experience begins, enable the Playing property.\n\nPoint source\n\nContrary to volumetric audio, point source audio only emits from a single point source. This type of audio is useful for explosions, impact noises, electronic devices, and dialogue.\n\nTo create a Class.Sound object for point source audio:\n\n1. In the Explorer window, hover over an attachment, truss, wedge, or corner wedge, then click the ⊕ button. A contextual menu displays.\n2. From the menu, insert a Sound.\n3. In the Properties window, navigate to the SoundId property and input a valid audio asset ID.\n4. (Optional) If you want the audio to start playing when the experience begins, enable the Playing property.\n\nBackground audio\n\nBackground audio plays at the same volume no matter where the user travels within your experience. This type of audio is useful for music that you want to play for users, especially when you want to create a soundtrack of multiple audio files.\n\nIt's best to keep all Class.Sound objects for background audio in a single location of the Workspace for organization purposes as you continue to add and edit audio within your experience. The following example stores the new Class.Sound object under the Class.SoundService container, as this service determines how Class.Sound objects play in experiences.\n\nTo create a Class.Sound object for background audio:\n\n1. In the Explorer window, hover over SoundService, then click the ⊕ button. A contextual menu displays.\n2. From the menu, insert a Sound.\n3. In the Properties window, navigate to the SoundId property and input a valid audio asset ID.\n4. (Optional) If you want the audio to start playing when the experience begins, enable the Playing property.\n5. (Optional) If this Class.Sound object is the only track you want to play in the place, enable its Looped property.\n\nCustomize sound objects\n\nClass.Sound object properties work together to influence how users experience your audio, such as:\n\n- How loud they hear specific audio individually and in relation to one another (Volume).\n- How they perceive volume when they move away from the audio source (RollOffMinDistance, RollOffMaxDistance, and RollOffMode)\n- What part of the audio they can listen to (TimePosition).\n- How fast and at what pitch they hear it (PlaybackSpeed).\n- If the audio automatically replays upon completion (Looped).\n\nVolume\n\nThe Class.Sound.Volume|Volume property allows you to set the volume of your audio anywhere from 0 (silence) to 10 (booming). If you want to change the volume of multiple Class.Sound objects at once, parent them under a sound group.\n\n  If your source audio is sufficiently loud, you likely don't need to increase the volume to more than 2, as this property is multiplicative. For example: a Class.Sound.Volume|Volume value of 4 is four times as loud than a Class.Sound.Volume|Volume value of 1, so if your source audio was already loud, the audio might become overwhelming to users.\n\nRollOffMinDistance and RollOffMaxDistance\n\nClass.Sound.RollOffMinDistance|RollOffMinDistance and Class.Sound.RollOffMaxDistance|RollOffMaxDistance determine the range of how a user perceives volume from positional audio. For volumetric audio, Class.Sound.RollOffMinDistance|RollOffMinDistance is the minimum distance in studs that audio begins to decrease in volume when the client's listener moves away from the parent Class.BasePart, and Class.Sound.RollOffMaxDistance|RollOffMaxDistance property is the maximum distance in studs that a client's listener can hear audio from the surface of the object.\n\nFor point source audio, Class.Sound.RollOffMinDistance|RollOffMinDistance and Class.Sound.RollOffMaxDistance|RollOffMaxDistance work similarly to volumetric audio, but the roll off distance these properties control doesn't surround the object, it only influences the distance outward from the point source.\n\nRollOffMode\n\nThe Class.Sound.RollOffMode|RollOffMode property allows you to decide how audio fades as the distance between the user's listener and the Class.Sound object's parent increases. You can set this property to one of four values of the Enum.RollOffMode enum.\n\n\n    RollOffMode\n    Description\n\n\n\n    Inverse (default)\n    Volume initially fades abruptly from Class.Sound.RollOffMinDistance|RollOffMinDistance, but volume fading becomes more gradual the closer a user is to reaching the Class.Sound.RollOffMaxDistance|RollOffMaxDistance. Once they reach the Class.Sound.RollOffMaxDistance|RollOffMaxDistance, the audio falls silent.\n\n\n    Linear\n    Volume fades linearly between Class.Sound.RollOffMinDistance|RollOffMinDistance and Class.Sound.RollOffMaxDistance|RollOffMaxDistance. Once a user reaches the Class.Sound.RollOffMaxDistance|RollOffMaxDistance, the audio falls silent.\n\n\n    InverseTapered\n    Volume follows the inverse model when close to Class.Sound.RollOffMinDistance|RollOffMinDistance and the linear square model when a user is close to Class.Sound.RollOffMaxDistance|RollOffMaxDistance. Audio approaches silence at the maximum distance point.\n\n\n    LinearSquare\n    Volume fades between Class.Sound.RollOffMinDistance|RollOffMinDistance and Class.Sound.RollOffMaxDistance|RollOffMaxDistance with a linear squared relationship. Audio approaches silence at the maximum distance point.\n\n\n  For most Inverse and Linear Class.Sound.RollOffMode|RollOffMode types, low Class.Sound.RollOffMaxDistance|RollOffMaxDistance values cause audio to abruptly cut off when the listener reaches the Class.Sound.RollOffMaxDistance|RollOffMaxDistance. If you want your audio to gradually decrease in volume, set a higher Class.Sound.RollOffMaxDistance|RollOffMaxDistance value.\n\nPlaybackSpeed\n\nThe Class.Sound.PlaybackSpeed|PlaybackSpeed property allows you to determine the speed your audio plays. For example, if you set the Class.Sound.PlaybackSpeed|PlaybackSpeed to a value of 2, your audio plays twice as fast and one octave higher in pitch. Similarly, if you set it to a value of 0.5, your audio plays twice as slow and one octave lower in pitch.\n\n\n\n\n\n\n\n\n\n\n    Class.Sound.PlaybackSpeed|PlaybackSpeed = 0.5\n    Class.Sound.PlaybackSpeed|PlaybackSpeed = 1.0\n    Class.Sound.PlaybackSpeed|PlaybackSpeed = 2.0\n\n\nTimePosition\n\nThe Class.Sound.TimePosition|TimePosition property displays, in seconds, what position within the audio sample a user is currently hearing. This property is useful for either only playing a section of the audio sample, or triggering an event to occur once audio reaches a specific position. For example, the following code sample causes a particle emitter to emit a white ring particle above a part within a limited time range of an audio track.\n\nlua\nlocal RunService = game:GetService(\"RunService\")\nlocal Workspace = game:GetService(\"Workspace\")\n\n-- Create a new part\nlocal part = Instance.new(\"Part\")\npart.Anchored = true\npart.Color = Color3.new(0.75, 0.2, 0.5)\npart.Size = Vector3.new(2, 1, 2)\npart.Material = Enum.Material.Neon\npart.Position = Vector3.new(0, 4, 0)\npart.Parent = Workspace\n\n-- Create an attachment on the part\nlocal attachment = Instance.new(\"Attachment\")\nattachment.Position = Vector3.new(0, 0.5, 0)\nattachment.Parent = part\n\n-- Create a particle emitter on the attachment\nlocal emitter = Instance.new(\"ParticleEmitter\")\nemitter.Rate = 5\nemitter.Lifetime = NumberRange.new(1.5, 1.5)\nemitter.Texture = \"rbxassetid://1266170131\"\nemitter.Speed = NumberRange.new(1, 1)\nemitter.Size = NumberSequence.new{NumberSequenceKeypoint.new(0, 1), NumberSequenceKeypoint.new(1, 6)}\nemitter.Transparency = NumberSequence.new{NumberSequenceKeypoint.new(0, 1), NumberSequenceKeypoint.new(0.25, 0), NumberSequenceKeypoint.new(1, 1)}\nemitter.Orientation = Enum.ParticleOrientation.VelocityPerpendicular\nemitter.Parent = attachment\n\n-- Create a sound on the attachment\nlocal sound = Instance.new(\"Sound\")\nsound.SoundId = \"rbxassetid://1835405646\"\nsound.Parent = attachment\n\n-- Play the sound\nsound:Play()\n\n-- Start checking if emitter should be enabled\nRunService.Heartbeat:Connect(function()\n\t-- Enable the emitter within a time range of the audio; otherwise disable it\n\temitter.Enabled = sound.TimePosition >= 5 and sound.TimePosition < 20\nend)\n\nLooped\n\nThe Class.Sound.Looped|Looped property allows you to repeat audio after it has finished playing. When set to true, the Class.Sound object's audio plays again. This is useful to apply to background audio to ensure your experience never has abrupt silence.\n\nScript sound objects\n\nPlay audio contextually\n\nAside from auto-playing audio through the Class.Sound object's Class.Sound.Playing|Playing property, you can play audio contextually from a Class.LocalScript by calling Class.Sound:Play()|Play() on the corresponding Class.Sound object. For example:\n\nlua\nlocal Workspace = game:GetService(\"Workspace\")\n\nlocal sound = Instance.new(\"Sound\")\nsound.SoundId = \"rbxassetid://9120386436\"\nsound.Looped = true\nsound.Parent = Workspace\nsound:Play()\n\nAlternatively, if the place will feature multiple tracks, you can play a specific track from a Class.LocalScript:\n\nlua\nlocal SoundService = game:GetService(\"SoundService\")\n\nlocal musicTrack = SoundService:FindFirstChild(\"LucidDream\")\nif musicTrack not musicTrack.IsPlaying then\n\tmusicTrack:Play()\nend\n\nPlay interface audio\n\nYou can play interface audio for Class.GuiObject|GuiObjects such as buttons by hooking up a Class.Sound object to the Class.GuiButton.Activated|Activated event listener. This lets you provide auditory feedback to users, such as when they hover over or press it.\n\nTo play a Class.Sound object's audio when a user activates a Class.TextButton or Class.ImageButton:\n\n1. In the Explorer window, hover over the Class.TextButton or Class.ImageButton, then click the ⊕ button. A contextual menu displays.\n2. From the menu, insert either a Class.LocalScript or a Class.Script with Class.BaseScript.RunContext|RunContext set to Enum.RunContext.Client.\n3. Paste the following code into the script, then replace SOUNDNAME with the name of a Class.Sound object located inside the Class.SoundService container.\n\nlua\nlocal SoundService = game:GetService(\"SoundService\")\n\nlocal button = script.Parent\nlocal sound = SoundService:FindFirstChild(\"SOUNDNAME\")\n\nif not sound.isLoaded then\n\tsound.Loaded:Wait()\nend\n\nlocal function onButtonActivated()\n\tif sound and not sound.IsPlaying then\n\t\tsound:Play()\n\tend\nend\n\nbutton.Activated:Connect(onButtonActivated)",
    "source": "objects.md"
}