{
    "title": "Post-processing effects",
    "description": "Post-processing effects are customizable filters that quickly enrich the visuals of an experience.",
    "content": "Post-processing effects are customizable filters that allow you to quickly enrich the visuals of your experience. Using the post-processing effect objects in the Class.Lighting service or Class.Camera, you can:\n\n- Simulate a camera viewing a bright light and exaggerate its glow (bloom).\n- Apply a Gaussian blur to the entirety of your experience, or add a blur to parts of your experience that aren't in focus (depth‑of‑field).\n- Enhance an environment's appearance to create a specific mood through hue (color correction).\n- Render a halo of light that moves with the sun (sun rays).\n\nLandscape with depth-of-field effect applied, simulating distance blur\n\nAdd post-processing effects\n\nWhen you add post-processing effects to the Class.Lighting service, they display to all players who enter the experience. This is useful for effects\nthat affect the global environment, such as sun rays.\n\nWhen you add post-processing effects to the Class.Camera object, they only display to a specific player. This is useful for effects that should only pertain to that player based on their actions, such as blurring the 3D world view when they have a UI menu open.\n\nTo add post-processing effects to either the Class.Lighting service or Class.Camera:\n\n1. In the Explorer window, hover over the Class.Lighting service or Class.Camera,\n   then click the &CirclePlus; button. A contextual menu displays.\n1. From the menu, insert one or more of the following post-processing effects:\n\n   - BloomEffect\n   - BlurEffect\n   - ColorCorrectionEffect\n   - DepthOfFieldEffect\n   - SunRaysEffect\n   - ColorGradingEffect\n\n1. Depending on your Studio settings, some effects may not appear. To increase\n   your rendering quality level:\n\n   1. Open Studio Settings.\n   2. In the left-side navigation, select Rendering, then the Editor Quality Level dropdown menu.\n   3. Set it to the highest level.\n\nBloom\n\nThe Class.BloomEffect effect exaggerates lights within your experience by simulating a camera viewing a bright light. When this effect has a high value, parts with light colors glow.\n\nBlur\n\nThe Class.BlurEffect effect applies a Gaussian blur to the entirety of the 3D world view. You can use this effect to blur the background when a player has a menu open, allowing them to focus on the most important details.\n\nColor correction\n\nThe Class.ColorCorrectionEffect effect adjusts color properties to enhance an environment's appearance. You can also use this effect to provide player feedback, such as tinting the screen red when their character's health is low.\n\nThe following list describes the primary Class.ColorCorrectionEffect properties:\n\n- Class.ColorCorrectionEffect.Brightness|Brightness — Sets the brightness of pixels.\n- Class.ColorCorrectionEffect.Contrast|Contrast — Sets the change in separation between dark and light colors.\n- Class.ColorCorrectionEffect.Saturation|Saturation — Sets the intensity of colors.\n- Class.ColorCorrectionEffect.TintColor|TintColor — Determines how much the RGB channels of pixels scale.\n\nDepth-of-field\n\nThe Class.DepthOfFieldEffect effect blurs parts of your experience that aren't in focus. You can use this effect to blur distant objects or to focus a player on specific parts of your experience, such as an item in a shop.\n\nSun rays\n\nThe Class.SunRaysEffect effect creates a halo of light with rays around the sun that move based on the Class.Lighting.ClockTime|ClockTime\nor Class.Lighting.TimeOfDay|TimeOfDay property. Objects between the player's camera and the sun shape this effect, allowing for realistic visuals of light and shadow.\n\nColor grading\n\nThe Class.ColorGradingEffect effect modifies how color values calculated by the renderer should be converted to the screen's color range, impacting the mood and appearance of your place.\n\nThis effect's primary property is Class.ColorGradingEffect.TonemapperPreset|TonemapperPreset. The following values are available:\n\n- Enum.TonemapperPreset.Default &mdash; Sets the tone mapper to use the post‑2019 Roblox appearance which provides vivid colors and high contrasts.\n- Enum.TonemapperPreset.Retro &mdash; Sets the tone mapper to imitate the pre‑2019 Roblox appearance. Colors look less saturated and there's less contrast between them.\n\nIf you wish to recreate a full pre‑2019 Roblox look for your experience, experiment with Enum.TonemapperPreset.Retro and set the brightness of all lights to a maximum of 1.0.",
    "source": "post-processing-effects.md"
}