{
    "title": "Create and publish experiences and places",
    "description": "Explains how to create and publish experiences.",
    "content": "When you open Studio and create a new experience, your project starts with a single place that players load into when they first join the experience. Experiences can have one or multiple places that each contain all components for that portion of the experience, including its specific environment, 3D objects, and scripts.\n\nPlaces are comparable to scenes in Unity or maps in Unreal Engine.\n\nMany creators create additional places within an experience to organize assets for different gameplay areas. For example, if you want players to join a dungeon before teleporting to either a vast desert or spooky island, you can organize the assets for each area into their own place.\n\nEvery place is represented by a data model that stores and organizes:\n\n- All objects that make up the 3D world of a place, such as its parts, meshes, terrain, and lighting.\n- All objects that can control runtime behavior, such as scripts.\n\nUnderstanding both the general structure of a place's data model, and how the Roblox engine uses it as the source of truth for a place's state is important for understanding where to store and configure different types of objects. For more information, see data model.\n\nCreate experiences\n\nWhen you create a new experience, it opens a start place that all players will load into when they join the experiences. The start place represents the overall experience until you add additional places for different gameplay areas.\n\nTo create an experience:\n\n1. Open Studio.\n2. In the Open a Template section, select a template with the objects you want to start working with for your experience, such as:\n\n   - Baseplate — Starts with a Class.SpawnLocation and a baseplate.\n   - Platformer — Starts with customizable platforms, coin pickups, and double-jump, dashing, rolling, and long jump character mechanics!\n   - Racing — Starts with a working racecar and customizable track objects.\n\nWhen Studio opens up the template, you now have Place1 that represents your overall experience.\n\nPublish experiences\n\nWhen you publish an experience, Roblox stores the data model of your start place as a .rblx file in the cloud. This is an important process because it connects the experience to your account, allowing you to access and work on it from any computer.\n\nBy default, new experiences are set to private, meaning that they are only accessible to you as the creator, to users with Edit or Playtest access, and to group members with the appropriate roles and permissions. When you are ready to go live to everyone, you can release your experience to the public and optionally mark it as a beta.\n\nWhen creating and collaborating on experiences as part of a group, the ability for group members to playtest/edit/publish experiences is, by default, dependent on their role permissions. However, group owners or members with sufficient permissions can adjust access on a per‑experience level. For more info, see configure experiences.\n\nTo publish an experience:\n\n1. In the top-left corner of your computer, click File ⟩ Publish to Roblox.\n2. In the Publish Game window, fill in the following fields:\n\n   - Name / Description — The experience name and a description that describes what a potential player should expect. See the metadata best practices dropdown at the bottom of this section for guidelines.\n   - Creator — The creator you'd like to attribute as the creator of the experience.\n\n\n     It's highly recommended that you create a group and publish a new experience under the group's account, not your personal account. Even if you're a solo creator, this allows you to expand your team over time, recruit playtesters, and operate as an independent studio.\n\n\n   - Devices — Each applicable device type that you want to support. The default options are practical for most new creators.\n\n3. Click Create.\n\nMetadata best practices\n\nYour experience's name and description create an important first impression and contribute to how easily players find your experience through Roblox's dynamic discovery systems.\n\nExperience name\n\nAll experiences should adhere to the following best practices for naming:\n\n- Keep the name consistent &ndash; Renaming an experience too often reduces the chances that players can find it using a previous name.\n\n- Avoid spamming &ndash; Frequent repetition of words or phrases may result in demotion of your experience.\n\nObby Madness\n\nObby Madness OBBY OBBY OBBY OBBY OBBY\n\n- Use decorations cautiously &ndash; Decorating the name with one or two well-placed emojis isn't harmful, but misplaced or excessive decorations can confuse players who quickly want to identify the experience.\n\n🌍 Evolution Simulator 🌍\n\n🐒🐬🐊 Ev🌍luti🌍n Simulator 🌷🍀🌿\n\nExperience description\n\nA well-written description promotes the genre and unique qualities of your experience while also providing the best context for both players and Roblox's dynamic discovery systems.\n\n- Summarize your experience &ndash; Summarize what your experience is about in the first sentence, as this is your opportunity to present the most accurate impression of its genre and content.\n\nCompete with racers around the world in some of the craziest courses you've ever seen!\n\nFight off hordes of zombies with bats, guns, swords, and a bunch of weapons hidden throughout challenging mazes.\n\n- Provide keywords &ndash; Include all keywords that may be relevant to your experience. This makes it easier for players and Roblox to understand the themes and genres presented in your experience.\n\nDo you enjoy being a sheriff? Join and rid our town of robbers and crooks! Arrest the bad guys, throw them in jail, and even have a guns-blazing shoot-out outside the saloon.\n\nOpen your own restaurant, make delicious food, get lots of customers, and expand! Earn experience along the way and learn more recipes. If you love cooking and starting your own business, this is your chance to become a tycoon!\n\n- Avoid spamming &ndash; Avoid repeating keywords or adding irrelevant keywords. This may result in demotion of your experience.\n\nPlay our fun granny obby game. Obby obby obby obby obby obby obby adopt me bloxburg arsenal ninja legends parkour tycoon battle disaster survival super hero simulator run jump gun rpg pokemon wild west space alien piggy baldi granny murder mystery prison life jail break mario zelda dungeon quest.\n\nCreate additional places\n\nAfter you have published your experience, you can add additional places for different gameplay areas. To create a new place within an existing experience:\n\n1. Open an existing place file or create a new place from any Studio template.\n2. Select File ⟩ Publish to Roblox As….\n3. In the Publish Game window, click the tile for the experience you'd like to add the place to.\n4. Select Add as a new place, then click Create.\n\nWhether you choose to have a single, large place or many smaller places is mostly personal preference. For more information, see design for performance.\n\nChange start place\n\nThe start place of an experience cannot be instantly swapped with another place, but you can overwrite the current start place.\n\nTo change the start place:\n\n1.  Save your current start place to a .rbxl file or to a new place within the experience.\n2. Go to the [Creator Dashboard][creatordashboard] and select the experience with the start place that you want to change.\n3. Go to Configure ⟩ Places.\n4. Click Edit in Studio for the intended new start place. Studio opens and loads that specific place.\n\n\n\n5. In the top-left corner of Studio, go to File ⟩ Publish to Roblox As….\n\n\n   Do not select Publish to Roblox as this would publish the place over itself.\n\n\n6. Click the tile for the same experience, then choose the current start place. Click Overwrite.\n\n\n\n7.  If the experience is live, it's recommended that you restart its servers.\n\nMake experience public\n\nBefore making a new experience public—or updating an existing public experience—you must meet at least one of the following requirements:\n\n- Have an account that is ID-verified or\n- Have made a purchase using real currency or a gift card since January 1, 2025\n\nYou must also complete the content maturity & compliance questionnaire for the specific experience.\n\nThese requirements apply to both publishing a new experience and updating an existing public experience, including:\n\n- Using Publish to or Publish as in Studio\n- Publishing a new version of a place within an existing experience\n- Setting your audience to Public or Community members\n\nYou do not need to meet these requirements if you keep your experience private or set the audience to Connections.\n\nYou can make up to 5 private experiences that have never been public before public per day. This limit resets daily. Making an experience that was already public private and then public again does not count toward this limit.\n\nBy default, new experiences are set to private, meaning that they are only accessible to you as the creator, to users with Edit or Playtest access, and to group members with the appropriate roles and permissions. To make your experience available to everyone on Roblox, you have to update its privacy settings.\n\nTo update your experience's privacy settings:\n\n1. In the [Creator Dashboard][creatordashboard], select the experience you want to make public.\n1. Go to Configure ⟩ Settings.\n1. Under Privacy, select Public.\n1.  Choose Enable Beta mode to omit the experience from Recommended For You in the Roblox client. Beta experiences are still public, but have more limited reach and exposure.\n\n\n   To widen your audience while still remaining in beta, click Create campaign to set up a sponsored ad. To learn more, see Ads Manager. If you enable sponsored ads, the experience analytics charts might show some users from Recommended For You.\n\n\n1. Click Save Changes.\n\nAfter you make your experience public, you can choose the scope of your audience:\n\n1. In the [Creator Dashboard][creatordashboard], select the experience you want to specify the audience for.\n1. Go to Audience ⟩ Access Settings.\n1. Under Join, select one of the following options:\n   - Public — available to all users on Roblox.\n   - Connections — available only to the experience owner's connections. This option only appears for non–group-owned experiences.\n   - Community members — available only to group members. This option only appears for group-owned experiences.\n1. Click Save Changes.\n\n[creatordashboard]: https://create.roblox.com/dashboard/creations",
    "source": "publish-experiences-and-places.md"
}