{
    "title": "ReplicatedFirst",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: ReplicatedFirst\ntype: class\nmemorycategory: Instances\nsummary: |\n  A container whose contents are replicated to all clients (but not back to the\n  server) first before anything else.\ndescription: |\n  ReplicatedFirst is a container whose contents are replicated to all clients\n  (but not back to the server) before anything else. It's most commonly used to\n  store Class.LocalScript|LocalScripts and other elements that are essential\n  for the experience's start such as\n  loading screens.\n\n  For objects that do not need to be replicated before anything else, use\n  the Class.ReplicatedStorage container instead.\n\n  There are some key considerations for running Class.LocalScript|LocalScripts\n  in ReplicatedFirst:\n\n  - Since its contents replicate before anything else in the experience,\n    Class.LocalScript|LocalScripts running in ReplicatedFirst will need to\n    wait for any objects they require to replicate using\n    Class.Instance:WaitForChild()\n  - Any objects that are to be used by a Class.LocalScript in\n    ReplicatedFirst should also be parented to ReplicatedFirst. Otherwise,\n    they may replicate to the client late, yielding the script and negating the\n    benefit of initial replication.\ncodesamples: []\ninherits:\n  - Instance\ndescendants: []\ntags:\n  - NotCreatable\n  - Service\ndeprecationmessage: ''\nproperties: []\nmethods:\n  - name: ReplicatedFirst:RemoveDefaultLoadingScreen\n    summary: |\n      Immediately removes the default Roblox loading screen.\n    description: |\n      Immediately removes the default Roblox loading screen. Note that if any\n      object has been placed in ReplicatedFirst, the default loading screen\n      will be removed after a few seconds regardless if this method has been\n      called or not.\n\n      You should not remove the default loading screen unless you want to\n      display your own. If you remove the default screen without a replacement,\n      players will be able to see geometry loading in the background.\n    codesamples: []\n    parameters: []\n    returns:\n      - type: ()\n        summary: ''\n    tags: []\n    deprecationmessage: ''\n    security: None\n    threadsafety: Unsafe\n    capabilities: []\nevents: []\ncallbacks: []",
    "source": "ReplicatedFirst.yaml"
}