{
    "title": "ReplicatedStorage",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: ReplicatedStorage\ntype: class\nmemorycategory: Instances\nsummary: |\n  A container service for objects that are replicated to all clients.\ndescription: |\n  Class.ReplicatedStorage is a general container service for objects that are\n  available to both the server and connected clients. It is ideal for\n  Class.ModuleScript, Class.RemoteFunction, Class.RemoteEvent, and other\n  objects that are useful to both server-side Class.Script|Scripts and\n  client-side Class.LocalScript|LocalScripts.\n\n  Objects parented to this service are fully replicated to clients, and normal\n  replication rules apply. Any changes that are made on the client persist but\n  aren't replicated to the server. Client changes may be overwritten if the\n  server does something that overwrites those changes.\n\n  Certain changes on the client, such as moving an object from the\n  Class.Workspace to Class.ReplicatedStorage, can lead to desynchronization\n  issues (for example, physics updates not being replicated to the object).\n\n  Class.LocalScript|LocalScripts do not run when parented to this service,\n  even if they are Class.BaseScript.Enabled|Enabled;\n  Class.LocalScript|LocalScripts have various other locations where they\n  eventually run on a Class.Player client such as\n  Class.StarterPlayerScripts, Class.StarterCharacterScripts, or\n  Class.StarterGui.\n\n  Similarly, Class.Script|Scripts do not run when parented to this service\n  unless you change their Enum.RunContext property from the default value of\n  Enum.RunContext.Legacy|Legacy. Server Class.Script|Scripts that run on\n  their own should be parented to Class.ServerScriptService instead.\n\n  If a Class.ModuleScript within this service is required by any other script,\n  it runs as normal. Such modules typically house code that is shared by the\n  server and client.\ncodesamples: []\ninherits:\n  - Instance\ndescendants: []\ntags:\n  - NotCreatable\n  - Service\ndeprecationmessage: ''\nproperties: []\nmethods: []\nevents: []\ncallbacks: []",
    "source": "ReplicatedStorage.yaml"
}