{
    "title": "Server scoring",
    "description": "How matchmaking uses scoring to match players to servers.",
    "content": "The scoring formula\n\nServers are scored using a weighted sum formula. There are four parts to this formula:\n\n- Attributes, which are data that describe players and servers, such as player age or server occupancy.\n- Signals, which transform attributes into numbers between 0 and 1.\n- Weights, which describe the relative importance of signals.\n- The server score, which measures the server's compatibility with the joining player.\n\nThe joining player is matched to the server with the highest server score.\n\nAttributes\n\nAttributes are data that describe players and servers. An attribute's value can be a number or a string. When an attribute's value is a string, it's called a categorical attribute. When an attribute's value is a number, it's called a numerical attribute.\n\nFor a full list of all available Roblox attributes, see Existing attributes. For more information about custom attributes, see Custom attributes.\n\nExample: Categorical and numerical attributes\n\n\n    Categorical attributes\n\n\n\n    Has Friends is a categorical attribute because its value is the string \"true\" when there is a preferred player on this server, and \"false\" when there are no preferred players on this server.\n\n\n    Language is a categorical attribute because its value is the player's language setting, such as \"Japanese\".\n\n\n\n    Numerical attributes\n\n\n\n    Age is a numerical attribute because its value is the player's age.\n\n\n    Occupancy is a numerical attribute because its value is the number of players currently in this server.\n\n\nSignals\n\nSignals transform attribute values into numbers between 0 and 1, called signal scores. A signal score of 1 predicts high player compatibility, while a signal score of 0 predicts low player compatibility. Depending on the attribute, transformations can include different aggregations, comparisons, and normalizations.\n\nFor a full list of existing Roblox signals, see Existing signals. For more information about custom signals, see Custom signals.\n\nExample: Two servers with different signal scores\n\nThe following table calculates Occupancy signal scores for two different server with capacity for 8 players:\n\n\n\n    Players in server\n    Occupancy score\n\n\n\n    Server A\n    2\n    2/8 = 0.25\n\n\n    Server B\n    6\n    6/8 = 0.75\n\n\nThe Occupancy signal scores Server B higher and considers it a better fit for the joining player.\n\nWeights\n\nA signal's weight describes that signal's importance relative to other signals. A higher weight increases the signal's contribution to the server score. The value after multiplying a signal score by its weight is called a weighted signal.\n\nSignals can't have negative weights. If a signal's weight is 0, that signal is not considered for scoring.\n\nExample: Weighting the Occupancy score\n\nThe following table calculates weighted Occupancy signal scores for a place with capacity for 8 players and an Occupancy signal weight of 2:\n\n\n\n    Players in server\n    Occupancy score\n    Weighted occupancy score\n\n\n\n    Server A\n    2\n    2/8 = 0.25\n    0.25  2 = 0.5\n\n\n    Server B\n    6\n    6/8 = 0.75\n    0.75  2 = 1.5\n\n\nExample: Two configurations with different weights\n\nDifferent weights can also make matchmaking choose different servers. The following table calculates the server scores of two servers with different matchmaking configurations. Configuration 2 has a higher weight for its Occupancy signal, and Server A has a connection of the joining player in it.\n\n\n\n\n    Friends\n    Occupancy\n\n\n\n\n\n    Weight\n    Score\n    Weight\n    Score\n    Total score\n\n\n\n    Config 1\n    Server A\n    1\n    1\n    5\n    0.25\n    1  1 + 5  0.25 = 2.25\n\n\n    Server B\n    1\n    0\n    5\n    0.75\n    1  0 + 5  0.75 = 3.75\n\n\n    Config 2\n    Server A\n    3\n    1\n    5\n    0.25\n    3  1 + 5  0.25 = 4.25\n\n\n    Server B\n    3\n    0\n    5\n    0.75\n    3  0 + 5  0.75 = 3.75\n\n\nServer score\n\nThe server score is calculated by the following weighted sum formula, which sums a server's weighted signal scores:\n\n$\\text{ServerScore} = \\text{WeightedSignalScore}1 + \\text{WeightedSignalScore}2 + \\ldots + \\text{WeightedSignalScore}n$\n\n$\\phantom{\\text{ServerScore}} = \\text{Weight}1 \\times \\text{SignalScore}1 + \\text{Weight}2 \\times \\text{SignalScore}2 + \\ldots + \\text{Weight}n \\times \\text{SignalScore}n$\n\nMatchmaking configurations\n\nA matchmaking configuration is the set of signals and weights used to score servers of a place. By default, all servers of all places are scored by the Roblox default configuration, meaning you don't need to customize or enable any settings in order to use it.\n\nThe Roblox default configuration includes the following signals and weights:\n\n\n    Signal\n    Weight\n\n\n\n\n    Friends\n    15\n\n\n    Latency\n    3\n\n\n    Text Chat\n    3\n\n\n    Occupancy\n    2\n\n\n    Play History\n    2\n\n\n    Language\n    2\n\n\n    Age\n    1\n\n\n    Voice Chat\n    1\n\n\n    Device Type\n    0\n\n\nIn the default Roblox configuration, the Friends signal's weight is greater than the sum of the weights of every other signal. This means that, if available, the joining player is always matched to servers with connections (or players on the same IP address) in them.\n\nThe Device Type signal exists in the default configuration but has a weight of 0, so it doesn't affect matchmaking decisions. You can adjust this weight when you customize matchmaking.\n\nFor more information about each Roblox signal, see Existing signals.\n\nAdvanced concepts\n\nThe following are more advanced concepts about the matchmaking process.\n\nNormalization\n\nSignals normalize attribute values to be numbers between 0 and 1. Numerical signals can be normalized by any positive number, called the normalizing factor. If the normalized value is greater than 1, it is clamped down to 1.\n\nExample: Designing the Age signal\n\nThe Age signal measures the difference between the average age of players in the server and the joining player's age.\n\n$$\\text{ageDifference} = |\\text{avgServerAge} - \\text{joiningPlayerAge}|$$\n\nServers with age differences beyond 25 are all considered equally incompatible with the player. For example, an age difference of 25 is no worse for a player than an age difference of 26, so both values should take the signal score to 0. In this case, 25 is considered the normalizing factor.\n\n$$\\text{normAgeDifference} = \\min(1, |\\text{avgServerAge} - \\text{joiningPlayerAge}| / 25)$$\n\nThe signal score is inversely related to the age difference, meaning that the signal score is higher when the age difference is smaller.\n\n$$\\text{ageDifferenceSignalScore} = 1 - \\text{normAgeDifference}$$\n\nThe following table shows Age signal scores with two different normalizing factors:\n\n\n    Age\n    Normalizing factor: 100\n    Normalizing factor: 25\n\n\n\n\n    50\n    0.5\n    0\n\n\n    25\n    0.75\n    0\n\n\n    12\n    0.88\n    0.52\n\n\n    5\n    0.95\n    0.8\n\n\n    0\n    1\n    1\n\n\nThe signal with a normalizing factor of 25 considers the 5-year and 12-year age differences to be farther apart. Smaller normalizing factors have the effect of amplifying marginal increases or decreases in age difference.\n\nWeight magnitudes\n\nA weight indicates the importance of a signal relative to other signals in a configuration. The relative magnitudes of weights determine signal importance, not their absolute magnitudes.\n\nExample: Relative vs absolute magnitude\n\nThe table below calculates the server scores of two servers with two different matchmaking configurations. Configuration 5 and Configuration 6 have Occupancy weights higher than their respective Friends weights. Server A has a connection of the joining player in it.\n\n\n\n\n    Friends\n    Occupancy\n\n\n\n\n\n\n    Weight\n    Score\n    Weight\n    Score\n    Total score\n\n\n    Config 5\n    Server A\n    10,000\n    1\n    15,000\n    0.25\n    10,000  1 + 15,000  0.25 = 13,750\n\n\n    Server B\n    10,000\n    0\n    15,000\n    0.75\n    10,000  0 + 15,000  0.75 = 11,250\n\n\n    Config 6\n    Server A\n    0.01\n    1\n    0.05\n    0.25\n    0.01  1 + 0.05  0.25 = 0.0225\n\n\n    Server B\n    0.01\n    0\n    0.05\n    0.75\n    0.01  0 + 0.05  0.75 = 0.0375\n\n\nServer A wins with Configuration 5 while Server B wins with Configuration 6. This is because Configuration 5's Occupancy weight is only 1.5x its Friends weight, while Configuration 6's Occupancy weight is 5x its Friends weight.\n\nDespite differences in absolute magnitudes, Configuration 6 prioritizes Occupancy over Friends more than Configuration 5 does.",
    "source": "scoring.md"
}