{
    "title": "ScreenInsets",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: ScreenInsets\ntype: enum\nsummary: |\n  Insets associated with various screen safe areas.\ndescription: |\n  This enum specifies screen edge insets that are associated with a particular\n  screen safe area. The insets are relative to the fullscreen area, meaning\n  the rectangular region that encompasses all visible pixels on the screen.\n\n\ncodesamples: []\ntags: []\ndeprecationmessage: ''\nitems:\n  - name: None\n    summary: |\n      No insets are added to the fullscreen area. This mode may result in UI\n      that is obscured or completely hidden by device notches and cutouts, so\n      you should only use it for a Class.ScreenGui that contains\n      non‑interactive content like background images.\n    value: 0\n    tags: []\n    deprecationmessage: ''\n  - name: DeviceSafeInsets\n    summary: |\n      Device safe area insets are added to the fullscreen area. The resulting\n      area is guaranteed to not be occluded by any device screen cutouts\n      such as the camera notch, although no inset is added for Roblox core UI\n      elements like the top bar buttons. As a result, it's recommended that you\n      use CoreUISafeInsets for a Class.ScreenGui whose contents should\n      remain unobscured by both device cutouts and core screen elements.\n    value: 1\n    tags: []\n    deprecationmessage: ''\n  - name: CoreUISafeInsets\n    summary: |\n      Core UI insets are added to the DeviceSafeInsets area, resulting in an\n      area guaranteed to be unobscured by both device screen cutouts and Roblox\n      core UI elements like the top bar buttons. This mode is recommended for\n      any Class.ScreenGui that contains interactive and/or important UI\n      elements such as buttons and status messages.\n    value: 2\n    tags: []\n    deprecationmessage: ''\n  - name: TopbarSafeInsets\n    summary: |\n      Top bar safe area insets are added to the DeviceSafeInsets area,\n      resulting in an area guaranteed to be unobscured by both device screen\n      cutouts and Roblox core UI elements like the experience controls. Unlike\n      CoreUISafeInsets, this area's position and size is dynamic and is\n      limited to the space available within the top bar area itself, outside of\n      CoreUISafeInsets. See the Class.GuiService.TopbarInset property which\n      represents the absolute size and position of the unobstructed area within\n      the top bar space.\n    value: 3\n    tags: []\n    deprecationmessage: ''",
    "source": "ScreenInsets.yaml"
}