{
    "title": "Sleep system",
    "description": "Explore how the sleep system automatically prevents unnecessary simulation of non-moving parts.",
    "content": "Each assembly in the Roblox Engine corresponds to a single rigid body. The position and velocity of each rigid body describe where it's located and how fast it's moving, and one of the primary engine tasks is to update the positions and velocities of each assembly.\n\nAssemblies can be connected together with mechanical constraints and mover constraints to form mechanisms such as cars or airplanes. As the number of assemblies and constraints in a mechanism increases, the time required to simulate the mechanism also increases. Fortunately, this increase is offset when the sleep system determines that the engine can skip simulation of non‑moving assemblies.\n\nSleep states\n\nEach assembly can be in one of three states: awake, sleeping, or sleep‑checking.\n\nAwake\n\nAn awake assembly is moving or accelerating, and is therefore simulated. Assemblies enter this state from situations outlined in sleeping and sleep‑checking, as well as additional wake situations.\n\nSleeping\n\nA sleeping assembly is neither moving nor accelerating, and is therefore not simulated.\n\nAn assembly is determined to be non-moving by checking its linear velocity and rotational velocity. If its linear velocity is less than the Linear Velocity threshold and its rotational velocity is less than the Rotational Velocity threshold, the assembly is considered to be non-moving.\n\nIn some cases, simply checking for non-movement would cause an assembly to incorrectly enter the sleeping state. For example, if a ball is thrown straight up, its velocity approaches zero as it reaches its maximum height, making it a candidate to sleep and never fall back down. To handle such cases, the engine considers an assembly to be accelerating if its linear acceleration or rotational acceleration are greater than the Linear Acceleration and Rotational Acceleration thresholds, respectively, and will prevent the assembly from falling asleep.\n\nIf an assembly falls asleep when you expect it to remain awake, it's commonly because the assembly is moving too slowly. In addition to automatic checks outlined in sleep‑checking and sleeping, you can forcibly wake up an assembly through the conditions outlined in additional wake situations.\n\nSleep-checking\n\nA non-moving assembly that shares a constraint with at least one awake neighboring assembly is put into the sleep-checking state and is not simulated. On each worldstep, a sleep-checking assembly checks whether:\n\n- Its linear acceleration is greater than the Wake Linear Acceleration threshold.\n- Its rotational acceleration is greater than the Wake Rotational Acceleration threshold.\n- A neighboring assembly's linear velocity is greater than the Neighbor Linear Velocity threshold.\n- A neighboring assembly's rotational velocity is greater than the Neighbor Rotational Velocity threshold.\n\nIf any of these conditions is true, or under any of the additional wake situations, the sleep-checking assembly enters the awake state.\n\nThreshold reference\n\nThe following table provides the various velocity and acceleration thresholds used to determine if an assembly is moving or accelerating.\n\n\n\t\tThreshold\n\t\tValue\n\t\tState change\n\n\n\n\t\tLinear Velocity\n\t\t0.33 studs/s\n\t\tawake &rang; sleeping\n\n\n\t\tRotational Velocity\n\t\t0.42 studs/s\n\t\tawake &rang; sleeping\n\n\n\t\tLinear Acceleration\n\t\t0.24 studs/s&sup2;\n\t\tawake &rang; sleeping\n\n\n\t\tRotational Acceleration\n\t\t0.24 studs/s&sup2;\n\t\tawake &rang; sleeping\n\n\n\t\tNeighbor Linear Velocity\n\t\t0.48 studs/s\n\t\tsleep-checking &rang; awake\n\n\n\t\tNeighbor Rotational Velocity\n\t\t0.59 studs/s\n\t\tsleep-checking &rang; awake\n\n\n\t\tWake Linear Acceleration\n\t\t16.9 studs/s&sup2;\n\t\tawake &rang; sleeping\n\n\n\t\tWake Rotational Acceleration\n\t\t16.9 studs/s&sup2;\n\t\tawake &rang; sleeping\n\n\nRotational velocity and acceleration thresholds reflect the velocity and acceleration of a point located on the assembly bounding sphere (a sphere that contains all of the parts in an assembly) that moves rigidly with the assembly.\n\nFor a given angular velocity, the rotational velocity of an assembly is proportional to the assembly bounding sphere radius. This means that larger assemblies can rotate at a lower angular velocity without falling asleep.\n\nAdditional wake situations\n\nIn addition to situations outlined in sleep‑checking and sleeping, an assembly enters the awake state when:\n\n- It collides with another assembly moving faster than 1 studs/s.\n- Any physics-related property of any Class.BasePart within the assembly changes, including:\n\n  - Class.BasePart.Anchored|Anchored\n  - Class.BasePart.AssemblyLinearVelocity|AssemblyLinearVelocity/Class.BasePart.AssemblyAngularVelocity|AssemblyAngularVelocity\n  - Class.BasePart.CanCollide|CanCollide/Class.BasePart.CanTouch|CanTouch\n  - Class.BasePart.CustomPhysicalProperties|CustomPhysicalProperties\n  - Class.BasePart.EnableFluidForces|EnableFluidForces\n  - Class.BasePart.Massless|Massless\n  - Class.BasePart.RootPriority|RootPriority\n\n- A non-zero impulse is applied to any Class.BasePart within the assembly via Class.BasePart:ApplyImpulse()|ApplyImpulse(), Class.BasePart:ApplyImpulseAtPosition()|ApplyImpulseAtPosition(), or Class.BasePart:ApplyAngularImpulse()|ApplyAngularImpulse().\n\n- Any physics-related property changes on the Class.Workspace that would affect the assembly, including:\n\n  - Class.Workspace.Gravity|Gravity\n  - Class.Workspace.FluidForces|FluidForces\n  - Class.Workspace.GlobalWind|GlobalWind\n  - Class.Workspace.AirDensity|AirDensity\n\n- A new Class.Constraint is created with an Class.Attachment that is parented to a Class.BasePart within the assembly.\n\n- Any property changes for a Class.Constraint with an Class.Attachment that is parented to a Class.BasePart within the assembly.\n\n- The Class.Motor.CurrentAngle|CurrentAngle property changes for a Class.Motor that is connected to a Class.BasePart within the assembly.\n\n- The assembly contains a Class.VehicleSeat with a seated player character.\n\n- The assembly is within the Class.Explosion.BlastRadius|BlastRadius of an Class.Explosion.\n\nDebug visualization\n\nDuring playtesting, you can visualize assembly sleep states by toggling on Awake parts from the Visualization Options widget in the upper‑right corner of the 3D viewport.\n\nOnce enabled, simulated parts will be outlined by their current sleep state, with awake parts outlined in red, sleep‑checking parts outlined in orange, and sleeping parts un‑outlined.\n\n\n  Simulated parts outlined by the color representing their current sleep state",
    "source": "sleep-system.md"
}