{
    "title": "StreamingIntegrityMode",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: StreamingIntegrityMode\ntype: enum\nsummary: |\n  Determines how a user's client should handle not having enough content\n  streamed in.\ndescription: |\n  This enum is used to control Class.Workspace.StreamingIntegrityMode\n  behavior. The default behavior is currently equivalent to Disabled but may\n  change in the future. For all modes, the replication focus defaults to be the\n  local character model unless explicitly set via\n  Class.Player.ReplicationFocus.\n\n  Most experiences should use PauseOutsideLoadedArea, however if your\n  experience relies on raycasts, or otherwise requires a certain amount of\n  content to be loaded in, then MinimumRadiusPause might be a better choice.\n\n  Note that MinimumRadiusPause and PauseOutsideLoadedArea both set the\n  Class.Player.GameplayPaused property when their respective pause logic is\n  triggered, and a default message is displayed on the client. The default pause\n  UI can be overridden as outlined in\n  Instance streaming.\ncodesamples: []\ntags: []\ndeprecationmessage: ''\nitems:\n  - name: Default\n    summary: |\n      Default behavior (currently equivalent to Disabled).\n    value: 0\n    tags: []\n    deprecationmessage: ''\n  - name: Disabled\n    summary: |\n      Simulation of the replication focus is never paused, regardless of the\n      amount of content streamed in on the client.\n    value: 1\n    tags: []\n    deprecationmessage: ''\n  - name: MinimumRadiusPause\n    summary: |\n      All client-side simulation is paused when content is not streamed in up to\n      the minimum radius.\n    value: 2\n    tags: []\n    deprecationmessage: ''\n  - name: PauseOutsideLoadedArea\n    summary: |\n      Simulation of the replication focus is paused when any part of its\n      bounding box is not in a streamed-in area.\n    value: 3\n    tags: []\n    deprecationmessage: ''",
    "source": "StreamingIntegrityMode.yaml"
}