{
    "title": "Text filtering",
    "description": "Text filtering prevents users from seeing inappropriate language and blocks personally identifiable information.",
    "content": "Applied to various sources and inputs, text filtering prevents users from seeing inappropriate language and personally identifiable information such as phone numbers. Roblox automatically filters common text outputs such as messages that have passed through in-experience text chat, but you are responsible for filtering any displayed text that you don't have explicit control over.\n\nBecause filtering is crucial for a safe environment, Roblox actively moderates the content of experiences to make sure they meet community standards. If Roblox receives reports or automatically detects that your experience doesn't apply text filtering, then the system removes the experience until you add filtering.\n\nFilter scenarios\n\nText can be gathered and/or displayed to users in a variety of scenarios, including:\n\n- An experience that gathers users' text input through Class.TextBox entries, a custom GUI with buttons such as a keyboard/keypad interface, or an interactive keyboard model in the 3D space.\n\n- An experience that generates words from random characters and displays them to users, as there's a chance it will create inappropriate words.\n\n- An experience that connects to an external web server to fetch content that is displayed in-experience. Often you will not have control over the content of the external site and a third party can edit the information.\n\n- An experience that stores text such as users' pet names using data stores, where the stored text might include inappropriate words that should be filtered when retrieving them.\n\nFiltering process\n\nClass.TextService:FilterStringAsync() filters in-experience text by taking a string of text and the Class.Player.UserId|UserId of the user who created the text as input. It returns a Class.TextFilterResult object which has two additional methods that you can call in different scenarios:\n\n- Class.TextFilterResult:GetNonChatStringForBroadcastAsync() for filtering text visible to all users in an experience, such as for a dialog that lets a user write a message on a sign that's visible to all users on the server.\n- Class.TextFilterResult:GetNonChatStringForUserAsync() to display filtered text for one specific user, based on age and other details.\n\nIn the context of Class.TextBox input, the following example gathers input on the Class.TextBox.FocusLost|FocusLost event and sends it to the server through a Class.RemoteEvent. On the server, it is filtered first through Class.TextService:FilterStringAsync()|FilterStringAsync() and then Class.TextFilterResult:GetNonChatStringForBroadcastAsync()|GetNonChatStringForBroadcastAsync() with the intention that the text will be displayed to all users on a server‑side object such as a Class.SurfaceGui in the 3D world.\n\nDo not filter text in real time \"per character entered\" into a Class.TextBox, as doing so yields for text that's only visible to the user typing it. Instead, filter the entered text after the user submits it.\n\nlua title=\"Filtering Text Input - Client Script\"\nlocal ReplicatedStorage = game:GetService(\"ReplicatedStorage\")\n\nlocal textBox = script.Parent\ntextBox.ClearTextOnFocus = false\ntextBox.PlaceholderText = \"...\"\ntextBox.TextXAlignment = Enum.TextXAlignment.Left\ntextBox.TextScaled = true\n\n-- RemoteEvent to send text input to server for filtering\nlocal inputRemoteEvent = ReplicatedStorage:FindFirstChild(\"InputRemoteEvent\")\n\n-- Event handler for focus lost and enter being pressed\nlocal function onFocusLost(enterPressed, inputObject)\n\tif enterPressed then\n\t\tprint(\"SUBMITTED:\", textBox.Text)\n\t\tif inputRemoteEvent then\n\t\t\tinputRemoteEvent:FireServer(textBox.Text)\n\t\tend\n\tend\nend\n\ntextBox.FocusLost:Connect(onFocusLost)\n\nlua title=\"Filtering Text Input - Server Script\"\nlocal TextService = game:GetService(\"TextService\")\nlocal ReplicatedStorage = game:GetService(\"ReplicatedStorage\")\n\n-- RemoteEvent to receive text input from client for filtering\nlocal inputRemoteEvent = ReplicatedStorage:FindFirstChild(\"InputRemoteEvent\")\n\nlocal function getFilterResult(text, fromUserId)\n\tlocal filterResult\n\tlocal success, errorMessage = pcall(function()\n\t\tfilterResult = TextService:FilterStringAsync(text, fromUserId)\n\tend)\n\n\tif success then\n\t\treturn filterResult\n\telse\n\t\twarn(\"Error generating TextFilterResult:\", errorMessage)\n\tend\nend\n\n-- Fired when client submits input from the TextBox\nlocal function onInputReceived(player, text)\n\tif text ~= \"\" then\n\t\tlocal filterResult = getFilterResult(text, player.UserId)\n\t\tif filterResult then\n\t\t\tlocal success, filteredText = pcall(function()\n\t\t\t\treturn filterResult:GetNonChatStringForBroadcastAsync()\n\t\t\tend)\n\n\t\t\tif success then\n\t\t\t\tprint(\"FILTERED:\", filteredText)\n\t\t\telse\n\t\t\t\twarn(\"Error filtering text!\")\n\t\t\tend\n\t\tend\n\tend\nend\n\ninputRemoteEvent.OnServerEvent:Connect(onInputReceived)",
    "source": "text-filtering.md"
}