{
    "title": "Textures and decals",
    "description": "Textures and decals are images you can place on object surfaces.",
    "content": "A Class.Texture is an image you can place on any face of a part or union that repeats both horizontally and vertically on the size of the surface. In contrast, a Class.Decal is an image that stretches to fit the area of a part or union's surface. After you\nadd a Class.Texture or Class.Decal object to a part or union, you can:\n\n- Change the texture or decal Class.Decal.Color3|Color3 property to set a color tint using RGB color codes.\n\n- Change the texture or decal Class.Decal.Transparency|Transparency property to a value between the default of 0 (fully visible) and 1 (invisible).\n\n- For a texture, set its scale and offset.\n\n\n\n\t\tTexture image\n\n\n\n\n\t\tTexture applied to a part (repeating)\n\n\n\n\n\t\tDecal image\n\n\n\n\n\t\tDecal applied to a part (stretched)\n\n\nCreate textures or decals\n\nTo create a texture or decal, you must add either a Class.Texture or Class.Decal object to a part or union. You can import images for textures and decals to Studio for use between experiences, and distribute them to the Creator Store. Once you import the image, Studio assigns it a unique asset ID.\n\nEvery texture or decal image that you create and import to Roblox must adhere to the Community Rules and Terms of Use.\n\nTo add a texture or decal to a part or union:\n\n1. In the Explorer window, add a Class.Texture or Class.Decal to the part or union. An empty texture or decal object displays on the part or union with orange outlining.\n\n2. In the Properties window, navigate to the Class.FaceInstance.Face|Face property and choose a face (Enum.NormalId|Top, Enum.NormalId|Bottom, Enum.NormalId|Front, Enum.NormalId|Back, Enum.NormalId|Left, or Enum.NormalId|Right).\n\n   -  To assist in choosing the correct face, right-click the part/union and select Show Orientation Indicator. This displays a circle 🅕, a blue line attached to the object's front face, and a green arrow that points in the direction of the object's top face.\n\n\n\n3. Select the Class.Decal.ColorMapContent|ColorMapContent property and apply an image through any of the following methods:\n\n   - Select any texture or decal you've uploaded previously.\n   - Enter an asset ID into the field.\n\n4.  Set a color tint by clicking the small box to the left of the Class.Decal.Color3|Color3 property or by entering a RGB color code.\n\n\n\n\n\n\n\n\n\n\n\n\n\n       Class.Decal.Color3|Color3: [255, 255, 255]\n\n\n\n       Class.Decal.Color3|Color3: [255, 0, 100]\n\n\n\n5.  Set the Class.Decal.Transparency|Transparency property to any value between the default of 0 (fully visible) and 1 (invisible).\n\n\n\n\n       Class.Decal.Transparency|Transparency: 0\n\n\n\n       Class.Decal.Transparency|Transparency: 0.6\n\n\n\nCustomize textures\n\nUnlike decals, textures provide further functionality to scale, offset, and animate the source image.\n\nScale textures\n\nThe size of the part doesn't affect the texture. Instead, scaling a part only increases or decreases the number of times the texture repeats.\n\nThe Class.Texture.StudsPerTileU|StudsPerTileU and Class.Texture.StudsPerTileV|StudsPerTileV properties determine the size of each \"tile\" in studs. Class.Texture.StudsPerTileU|StudsPerTileU determines the texture's horizontal size while Class.Texture.StudsPerTileV|StudsPerTileV determines the texture's vertical size.\n\nOffset textures\n\nIf you want more control over a texture's position, offset the texture by adjusting the Class.Texture.OffsetStudsU|OffsetStudsU (horizontal) and Class.Texture.OffsetStudsV|OffsetStudsV (vertical) properties. This is also helpful for animation.\n\nAnimate textures\n\nUsing Class.TweenService, you can tween texture properties like Class.Texture.OffsetStudsU|OffsetStudsU and Class.Texture.StudsPerTileV|StudsPerTileV to achieve animated surfaces. For example, if you apply two fog textures to one container and animate them with the following script, you can achieve the appearance of a layered moving fog.\n\n\n  Two animated textures near the floor to simulate a moving fog effect\n\nlua\nlocal TweenService = game:GetService(\"TweenService\")\n\nlocal texture1 = script.Parent.Texture1\nlocal texture2 = script.Parent.Texture2\n\nlocal tweenInfo1 = TweenInfo.new(8, Enum.EasingStyle.Sine, Enum.EasingDirection.InOut, -1)\nlocal tween1 = TweenService:Create(texture1, tweenInfo1, {OffsetStudsV=50})\nlocal tweenInfo2 = TweenInfo.new(7, Enum.EasingStyle.Sine, Enum.EasingDirection.InOut, -1, true)\nlocal tween2 = TweenService:Create(texture2, tweenInfo2, {OffsetStudsU=50, StudsPerTileU=55, StudsPerTileV=45})\n\ntween1:Play()\ntween2:Play()",
    "source": "textures-decals.md"
}