{
    "title": "In-experience tools",
    "description": "Create in-experience tools for your players.",
    "content": "In-experience Class.Tool|Tools are interactive tools that players can equip in sessions, such as weapons, magic wands, flashlights, keys, and more. You can design tools and include them in a player's inventory or place them around the world as pickups.\n\nCreate an in-experience tool\n\nThe Class.Tool object is the basis of any tool in Roblox, so you'll need to create one. It's easier to preview how a tool looks by designing it in the Class.Workspace, and later you can make it an inventory item or an earned/purchased item.\n\n1. In the Explorer hierarchy, hover over Class.Workspace, click the &CirclePlus; button, and insert a Class.Tool.\n\n\n\n2. With the new Class.Tool selected, access the Properties window and customize how the tool will appear in the player's inventory:\n\n   - Class.Tool.TextureId|TextureId — Specifies the image asset ID for the tool in a player's inventory.\n   - Class.Tool.ToolTip|ToolTip — The on-hover tooltip name for the tool in a player's inventory.\n\n\n\n3. Decide whether the tool will be a physical tool in the 3D environment (most common) or a non‑physical tool that simply occupies a player's inventory and responds to their input.\n\nPhysical tool\n\nAfter creating the Class.Tool instance for a physical tool, you'll need to add parts/meshes to compose its appearance in the 3D world. You'll also need to include a handle which player characters grip.\n\nAdd parts/meshes\n\nIn-experience tools can consist of one or more Class.Part|Parts and/or Class.MeshPart|MeshParts. If you construct the tool of multiple pieces, remember to connect them all together using Class.WeldConstraint|WeldConstraints or other mechanical constraints so that the tool stays intact as a unit while the player carries it around.\n\nWhen constructing tools, make sure that no parts are Class.BasePart.Anchored|Anchored. If you anchor the tool in 3D space, player characters will get stuck in place when they pick up or equip the tool.\n\nIf you want to place collectible tools as pickups around the 3D world and anchor them in specific places, such as floating slightly above the ground, you can anchor them but you'll need to add a Class.Script to each tool which unanchors its parts upon collection. See collectible tools for details.\n\nSet the handle\n\nTo enable players to carry tools around, one part of the tool needs to be named Handle. This is where the tool will attach to the character model's RightHand part (R15) or Right Arm part (R6).\n\nIf the tool is composed of just one Class.MeshPart, simply name that part Handle. Otherwise, you can include a separate part named Handle as a direct child of the parent Class.Tool and then attach it to another part with a Class.WeldConstraint or mechanical constraint.\n\nThe following example shows a tool with three instances: the Handle mesh, a Class.RopeConstraint, and a lantern mesh which hangs from the rope.\n\nMake sure to include only one part named Handle. If you include multiple parts named Handle, one will be randomly chosen as the attachment point for the character's hand, potentially causing issues such as the character holding a sword's blade instead of its hilt.\n\nAdjust the grip position/orientation\n\nThe tool's Class.Tool.Grip|Grip property is a Datatype.CFrame which specifies how the tool is positioned and oriented relative to the character holding it.\n\nSince the ideal grip position/orientation is different for every tool, you'll need to experiment with the values until your tool's grip looks correct. The following example shows possible incorrect and correct Class.Tool.Grip|Grip settings for the hanging lantern:\n\n\n\n    Lantern dragging on ground with Class.Tool.Grip|Grip.Position of (0, -2, 0) and Class.Tool.Grip|Grip.Orientation of (-90, 0, 0)\n\n\n\n    Lantern in front of character with Class.Tool.Grip|Grip.Position of (0, -1.5, 0) and Class.Tool.Grip|Grip.Orientation of (25, 0, 0)\n\n\nNon-physical tool\n\nA non-physical Class.Tool simply occupies a player's inventory and responds to their input. For example, a roleplaying experience might feature a series of magical spells that player's can \"cast\" through their inventory.\n\nNon-physical tools don't require any 3D composition and do not utilize a Handle part, so you should disable the tool's Class.Tool.RequiresHandle|RequiresHandle property:\n\nAdd tools to an experience\n\nOnce you finish creating your in-experience tool, you'll need to place it in the correct area of the Explorer hierarchy. Where you place the tool in the hierarchy depends on its intended usage.\n\nPlayer inventory\n\nIf you want all players to start out with a tool in their inventory, put it inside the Class.StarterPack container. When any player spawns, the system copies the tool to their Class.Backpack. From there, the player can equip the tool by clicking its inventory icon or by pressing the associated hotkey such as 1 or 2.\n\nNote that tools are copied to the player's inventory (Class.Backpack) in the order they were added to Class.StarterPack. For a more controlled ordering, you can add a Class.LocalScript to Class.StarterPack which temporarily moves the tools to Class.ReplicatedStorage then re‑parents them to Class.Backpack in the order specified in the order table.\n\nlua title=\"Reorder Inventory\"\nlocal ReplicatedStorage = game:GetService(\"ReplicatedStorage\")\n\nlocal order = {\"WaterSpell\", \"FireSpell\", \"AirSpell\", \"EarthSpell\"}\nlocal backpack = script.Parent\n\nfor , item in backpack:GetChildren() do\n\tif item:IsA(\"Tool\") then\n\t\titem.Parent = ReplicatedStorage\n\tend\nend\n\n-- Re-parent tools to backpack in the specified order\nfor i = 1, #order do\n\tlocal tool = ReplicatedStorage:FindFirstChild(order[i])\n\tif tool then\n\t\ttool.Parent = backpack\n\tend\nend\n\nCollectible tool\n\nIf you want to allow players to collect physical tools as they explore the 3D world, place the tools in the Class.Workspace just like normal 3D objects. Collected tools will be automatically equipped and added to the player's inventory (you do not need to add extra collision detection for characters to grab the tool).\n\nAs noted in the add parts/meshes section, tool parts should not typically be Class.BasePart.Anchored|Anchored, since player characters will get stuck in place when they pick up or equip an anchored tool. However, if you want to anchor a collectible tool to a specific place in the 3D world, such as floating slightly above the ground, you can add the following Class.Script to the tool to unanchor its parts upon collection.\n\nlua title=\"Unanchor Tool on Equip/Collect\"\nlocal tool = script.Parent\n\ntool.Equipped:Connect(function()\n\tfor , part in tool:GetDescendants() do\n\t\tif part:IsA(\"BasePart\") and part.Anchored then\n\t\t\tpart.Anchored = false\n\t\tend\n\tend\nend)\n\nEarned/purchased tool\n\nIf you want to set tools as awards for when players accomplish tasks, or offer tools for sale in an in‑experience store, put those tools inside Class.ReplicatedStorage. From there, you can Class.Instance:Clone()|Clone() a tool to the player's Class.Backpack at the proper time.\n\nlua title=\"Clone Tool to Player's Inventory\"\nlocal Players = game:GetService(\"Players\")\nlocal ReplicatedStorage = game:GetService(\"ReplicatedStorage\")\n\nlocal player = Players.LocalPlayer\nlocal backpack = player:WaitForChild(\"Backpack\")\n\n-- Create a clone of the tool\nlocal tool = ReplicatedStorage:FindFirstChild(\"WaterSpell\")\nif tool then\n\tlocal clone = tool:Clone()\n\tclone.Parent = backpack  -- Adds clone to the player's backpack\nend\n\nImplement tool effects\n\nAfter adding tools to your experience, you can implement scripts to enable players to use their tools and perform the desired actions. The following tool‑specific events indicate the state of the tool and the player's input with it.\n\n- Class.Tool.Equipped|Equipped() — Fires when the player selects the tool from their backpack.\n- Class.Tool.Unequipped|Unequipped() — Fires when the player switches tools or drops the tool.\n- Class.Tool.Activated|Activated() — Fires when the player starts activating the tool (clicks, taps, or presses the back‑right trigger on a gamepad).\n- Class.Tool.Deactivated|Deactivated() — Fires when the player stops the activation input (releases the button or touch).\n\nlua title=\"Tool Events Template\"\nlocal tool = script.Parent\n\nlocal function onEquip()\n\tprint(tool.Name, \"tool equipped\")\nend\nlocal function onUnequip()\n\tprint(tool.Name, \"tool unequipped\")\nend\nlocal function onActivate()\n\tprint(tool.Name, \"tool activated\")\nend\nlocal function onDeactivate()\n\tprint(tool.Name, \"tool deactivated\")\nend\n\ntool.Equipped:Connect(onEquip)\ntool.Unequipped:Connect(onUnequip)\ntool.Activated:Connect(onActivate)\ntool.Deactivated:Connect(onDeactivate)\n\nTool events only fire in client‑side Class.LocalScript|LocalScripts because only the player's device knows when input happens. As a result, most tools require both a Class.LocalScript and a server‑side Class.Script where each handles certain aspects of the tool's behavior and a Class.RemoteEvent passes information from the client to the server (see remote events and callbacks for more information).\n\nAs follows are example tools and their behaviors managed by either a Class.LocalScript or a Class.Script:\n\n\n\n      Tool\n      Class.LocalScript\n      Class.Script\n\n\n\n\n      Creator's Wand\n      Detects where the player activates the tool (Class.Tool.Activated|Activated()).\n      Creates a new part at the location within the 3D world where the player touched or clicked.\n\n\n      Invisibility Cloak\n      Detects when the player equips the tool (Class.Tool.Equipped|Equipped()) or unequips the tool (Class.Tool.Unequipped|Unequipped()).\n      Makes the player invisible to all other players while the cloak is equipped and restores the player to full visibility when the cloak is unequipped.\n\n\n      Mega‑Bow\n      Detects how long the player activates the tool (time between Class.Tool.Activated|Activated() and Class.Tool.Deactivated|Deactivated()).\n      Shoots a magical arrow with greater or lesser power, depending on the detected activation time.",
    "source": "tools.md"
}