{
    "title": "Roblox for Unity developers",
    "description": "If you're an experienced Unity developer, use this page to get oriented with Roblox.",
    "content": "import ScriptTypes from './includes/engine-comparisons/script-types.md'\nimport CodeSample from './includes/engine-comparisons/fishing-pole-code-sample.md'\nimport ScriptLocations from './includes/engine-comparisons/script-locations.md'\nimport Transforms from './includes/engine-comparisons/transforms.md'\n\nThis page contains information to help experienced Unity developers get started with Roblox, including basic orientation, a conceptual comparison, and key differences between the two platforms.\n\nGet oriented\n\nUnity's Hierarchy window and Roblox Studio's Explorer are the primary windows for organizing elements in 3D scenes:\n\n- Both allow you to manage and organize objects (for example, characters and environmental assets).\n- Both use a tree structure for the parent-child relationships between objects.\n\nHowever, the Hierarchy window has no predefined structure, whereas the Explorer window has a strict structure. It might help to think of the Explorer window as a combination of Unity's Hierarchy and Project windows, with the Class.Workspace folder as the most recognizable element.\n\nSimilarly, the Roblox Studio Asset Manager and Toolbox overlap with the Unity Project window. The Asset Manager lets you manage all assets within your experience, whereas the Toolbox lets you access any assets you've published. The Toolbox also lets you search the Creator Store for assets from Roblox or the community, similar to the Unity Asset Store.\n\nPhilosophical differences\n\nRoblox is a \"simulation engine\" rather than a traditional game engine. Unity GameObjects and Roblox Class.Part|Parts both serve as the fundamental building blocks for creating objects in a 3D environment, but in practice, the two are quite different:\n\n- Representation: GameObjects in Unity are a higher-level concept for any object in a scene, whereas Parts in Roblox are designed to represent physical objects like wooden blocks and plastic spheres, rather than abstract geometry like primitive objects in Unity.\n- Physics: To perform physics simulations in Unity, you attach components like Rigidbody and Collider to a GameObject. In Roblox, physics are built into the Parts data type; the engine handles interactions automatically.\n\nYou can see the difference immediately if you create a GameObject and a Part. The GameObject has nothing more than a position, rotation, and scale. The Part has that same information—plus a material and color, values for reflectance and transparency, mass and shape, and much more. Turning a Part into something more akin to an empty GameObject means removing a lot of built-in properties. Conversely, you can make a GameObject that looks a lot like a Part by adding MeshFilter, MeshRenderer, Collider, and Rigidbody components to it.\n\nFrom a scripting perspective, GameObject is most similar to the Roblox Class.Instance, the base class for all other Roblox classes, but because you don't (and can't) create objects of type Instance, the comparison isn't especially practical.\n\nAnother comparison is the Unity GameObject to the Roblox Class.Model. Models act as a container for a collection of interconnected parts in the same way that you might establish a parent-child relationship between many GameObjects in Unity. You specify one of the model's parts as its primary part to define the pivot point. Models also hold scripts, animations, sound effects, prompts, constraints, particle emitters, and more.\n\nFor example, a Unity GameObject might have components for ParticleSystem, Physics3D, SpringConstraint, and a script. In the Hierarchy window, you see a single GameObject named SpringyFireball. The Inspector window shows the collection of components and properties.\n\nIn Roblox, a comparable SpringyFireball model in the Explorer window might look something like this:\n\ntext\nModel\n|- ParticleEmitter\n|- MeshPart\n|- SpringConstraint\n|- ClickDetector\n|  |- Script\n\nRoblox's physics-by-default philosophy extends to the process of building 3D models. In Roblox, welding multiple parts together into an assembly is an excellent way to quickly build things, because Roblox treats the welded parts as a single rigid body. This approach isn't available in Unity.\n\nRather than using standard metric units for length and mass, Roblox uses notional units called studs and Roblox Mass Units (RMUs). For approximate metric conversions and recommendations around use, see Units.\n\nLocation matters\n\nRoblox experiences are multiplayer by default, so Roblox Studio includes many different storage locations with specific behaviors. For example, a script might run when you put it in Class.ReplicatedStorage, but not when you put it into Class.StarterPlayerScripts. For more information, see Client-server runtime and Object organization.\n\nScripting\n\nUnity doesn't have the concept of different script types. If you choose to make a multiplayer game, Unity uses its networking libraries to indicate when a GameObject (and its scripts) should be exclusive to the server.\n\nIn Unity, much of the engine's functionality is available through the methods of MonoBehaviour. For example, to run code before the render loop, you add code to the Update() method. To handle physics collision events, you add code to the OnCollideEnter() method.\n\nRoblox scripts are more event-driven. You access similar functionality by subscribing to services and listening for updates.\n\nC# and Luau\n\nFor scripting, Unity uses C#. Roblox uses Luau, a scripting language derived from Lua 5.1.\n\nCompared to C#, Luau is gradually typed and generally has a less verbose syntax. In larger projects, however, gradual typing can introduce categories of bugs that strongly typed languages like C# avoid, so consider enabling strict type checking in Roblox scripts.\n\nFor basic syntax differences between the scripting languages, see Luau and C# comparison.\n\nLuau code sample\n\nThe Roblox script can be relatively concise because Roblox has many built-in assumptions: a Class.Player with a Class.Humanoid character connected to the server and can equip Class.Tool|Tools. These assumptions don't exist in Unity, so the implementation would be very different.\n\nAssets\n\nUnity and Roblox both support importing custom meshes and models in .fbx format. Certain types of assets may require specific configurations and export settings from your third-party modeling software. For more information, see the following pages:\n\n- 3D Importer\n- General specifications\n- Blender and Maya export requirements\n\nIn Unity, objects import into your Assets directory, visible in the Project window. In Roblox, assets import into your Class.Workspace and into the Toolbox or Asset Manager.\n\nRoblox also offers an open-source Blender plugin to streamline the import process.\n\nTransforms\n\nCollaboration\n\nIn Unity, you collaborate with standard version control systems or paid services like Unity Version Control.\n\nRoblox files live in the cloud (although you can export copies), so Roblox Studio provides built-in collaboration workflows for simultaneous editing, group management, permissions, script drafting, and more. See Collaboration.\n\nCloud syncing provides further benefits with packages, the Roblox equivalent of Unity prefabs. Converting an asset or asset hierarchy to a package helps with local reusability, but also with collaboration. When you or your collaborators publish a new version of a package, you can quickly update existing instances of that package within an experience or set them to auto-update.\n\nPlugins\n\nSimilar to Unity tools, Roblox Studio supports plugins, which can simplify or give you additional control over various aspects of the development process. Plugins are available in the Creator Store, just like assets, many for free.\n\nGlossary\n\n| Unity | Roblox | Notes |\n| :--- | :--- | :--- |\n| Scene | Place | |\n| GameObject | Class.Part or Class.Model | See Philosophical differences. |\n| Prefab | Package | |\n| Transform | Datatype.CFrame | Datatype.CFrame doesn't include scale information. See Transforms. |\n| Hierarchy | Explorer | |\n| Inspector | Properties |\n| Scene view | 3D viewport | |\n| Game view | 3D viewport | The viewport transitions into a gameplay view when you test your experience. |\n| Project window | Asset Manager or Toolbox | |\n| Terrain Inspector | Terrain Editor | |\n| Spawn point | Class.SpawnLocation | |\n| Console | Output | |\n| Asset Store | Creator Store | |\n| Overlays | Toolbar | |\n| Tool | Plugin | |",
    "source": "unity.md"
}