{
    "title": "UserInputState",
    "description": "",
    "content": "This file is automatically generated. Please don't edit it manually.\nTo submit a bug report on the content, see\nhttps://devforum.roblox.com/c/bug-reports/documentation-issues/72\n\nname: UserInputState\ntype: enum\nsummary: |\n  This enum describes the state of an input that is currently or was recently\n  performed.\ndescription: |\n  The UserInputState enum describes the state of an input that is currently or\n  was recently performed. It is used by the Class.InputObject.UserInputState\n  property of the same name, as well as various Class.UserInputService and\n  Class.GuiObject events.\n\n  Depending on the Enum.UserInputType, input may follow states differently:\n\n  - Simple button and key presses generally follow a simple Begin to End\n    flow. Analog gamepad trigger buttons are similar to button presses but will\n    use Change as the trigger pressure changes.\n  - Mouse movement generally follows Begin (mouse-over) to Change (mouse\n    movement) to End (mouse-leave).\n  - Touch input behaves somewhat similarly to mouse movement. Begin and End\n    occur when the user starts or ends touching the screen, respectively. The\n    same Class.InputObject is used for the same touch point.\n  - Gamepad thumbstick controls will cause Change to occur each frame the\n    position changes.\ncodesamples: []\ntags: []\ndeprecationmessage: ''\nitems:\n  - name: Begin\n    summary: |\n      Occurs when an Class.InputObject starts to interact with the experience.\n      For example, a mouse button down, a key down, or when the player begins\n      touching the screen.\n    value: 0\n    tags: []\n    deprecationmessage: ''\n  - name: Change\n    summary: |\n      Occurs each frame an Class.InputObject has already begun interacting\n      with the experience and part of its state is changing. For example,\n      movement of the mouse position, a gamepad thumbstick movement, an analog\n      gamepad trigger button change, or screen touch point change.\n    value: 1\n    tags: []\n    deprecationmessage: ''\n  - name: End\n    summary: |\n      Occurs when an Class.InputObject finishes interacting with the\n      experience. For example, a mouse button up, a key up, or when the player\n      stops touching the screen.\n    value: 2\n    tags: []\n    deprecationmessage: ''\n  - name: Cancel\n    summary: |\n      A special circumstance state that indicates this input is no longer\n      relevant, particularly with Class.ContextActionService. For example,\n      binding two action-handling functions will cause the first to Cancel if\n      an input was already in-progress when the second was bound.\n    value: 3\n    tags: []\n    deprecationmessage: ''\n  - name: None\n    summary: |\n      A state that should never be seen in an experience; essentially just marks\n      the end of the enum.\n    value: 4\n    tags: []\n    deprecationmessage: ''",
    "source": "UserInputState.yaml"
}