{
    "title": "Variables",
    "description": "A name that holds a value.",
    "content": "A variable is a name that holds a value. Variable values can be numbers, strings, booleans, data types, and more.\n\nName variables\n\nVariable names can be any non-reserved string of letters, digits, and underscores that don't start with a digit.\n\nlua\nLETTERS   -- valid\na1        -- valid\nvarname  -- valid\ntest     -- valid\n\nif        -- NOT valid\n25th      -- NOT valid\n\nVariable names are case-sensitive, so TestVar and TESTVAR are different names. Avoid naming variables with an underscore and all uppercase letters, such as VERSION, because Luau may reserve them for internal global variables.\n\nBest practices\n\nIt's best practice to spell out words fully. Abbreviations generally make code easier to write, but harder to read. Following common naming practices when naming your variables can help you and others understand their meaning or purpose:\n\n- Use PascalCase names for class and enum-like objects.\n- Use PascalCase names for all Roblox APIs. camelCase APIs are mostly deprecated.\n- Use camelCase names for local variables, member values, and functions.\n- Use LOUDSNAKECASE names for local constants (variables with values that you don't expect to change).\n- Don't capitalize entire acronyms within names. For example, write aJsonVariable or MakeHttpCall.\n\nReserved names\n\nLuau reserves the following keywords, so you can't use them to name variables or functions:\n\n- and\n- for\n- or\n- break\n- function\n- repeat\n- do\n- if\n- return\n- else\n- in\n- then\n- elseif\n- local\n- true\n- end\n- nil\n- until\n- false\n- not\n- while\n\nAssign values\n\nTo create a variable and assign a value to it, use the = operator. Put the variable on the left of the = and the value on the right. If you don't put a value, the value is nil.\n\nVariables can have global or local scopes. They have global scope by default, but it's almost always better to create them with local scope because Luau accesses local variables faster than global ones. To give a variable local scope, put the keyword local before a variable's name when you assign a value to it. For more information on Scope in Luau, see Scope.\n\nlua\nlocal nilVar\nlocal x = 10\nlocal word = \"Hello\"\nlocal boolean = true\n\nprint(nilVar) -- nil\nprint(x) -- 10\nprint(word) -- Hello\nprint(boolean) -- true\n\nAssign values to multiple variables\n\nYou can assign values to multiple variables in one line by separating each variable-value pair with a comma. If you have more variables than values, then Luau assigns nil to the extra variables. If you have more values than variables, Luau doesn't assign the extra values to any variables.\n\nlua\nlocal a, b, c = 1, 2, 3\nlocal d, e, f = 4, 5 -- extra variable\nlocal g, h = 7, 8, 9 -- extra value\n\nprint(a, b, c) -- 1, 2, 3\nprint(d, e, f) -- 4, 5, nil\nprint(g, h) -- 7, 8\n\nChange values\n\nTo change a value of a variable, assign another value to it.\n\nlua\nlocal x, y = 10, 20\nprint(x) -- 10\nprint(y) -- 20\n\nlocal x = 1000\nlocal y = 2000\nprint(x) -- 1000\nprint(y) -- 2000",
    "source": "variables.md"
}