{
    "title": "Video frames",
    "description": "Video assets used on VideoFrame instances allow for video playback in experiences.",
    "content": "import BetaAlert from '../includes/beta-features/beta-alert.md'\n\nVideo assets used in Class.VideoFrame instances allow for video playback in experiences. You can upload videos that you're certain you have permission to use, such as videos you make yourself, and the asset privacy system automatically ensures that the IDs of your uploaded videos can't be accessed by users without the proper permissions.\n\nUpload videos\n\nIf you're a 13+ ID verified user, you can upload videos through the Asset Manager, the Creator Dashboard, or the Open Cloud API. You can upload a video as long as it meets the following requirements:\n\n- You have the legal rights to use the video asset.\n- It adheres to the Roblox Community Standards and Terms of Use.\n- It's 5 minutes or less in either .mp4 or .mov format.\n- Its resolution is less than or equal to 4096&times;2160.\n- It's less than 3.75 GB.\n\nVideos that don't meet these requirements are rejected. Alpha channels are not supported and will be ignored. When uploading videos, consider the following:\n\n- Each video upload costs 2,000 Robux.\n- You can upload a maximum of 20 videos a day.\n\nPlay videos\n\nA Class.VideoFrame must be parented to a Class.ScreenGui, Class.SurfaceGui, or Class.BillboardGui in order to be playable. Currently, a maximum of two videos can play simultaneously.\n\nTo play a video in your experience without code:\n\n1. Create a Class.ScreenGui as outlined in On-Screen UI Containers, or a Class.SurfaceGui or Class.BillboardGui as outlined in In-Experience UI Containers.\n2. Insert a video from the Toolbox or Asset Manager. A new Class.VideoFrame object is inserted for the video.\n3. Parent the Class.VideoFrame to the container.\n\n\n\n4. With the new Class.VideoFrame selected, enable its Looped and Playing properties in the Properties window.\n\n\n\nIf you want to play a video in your experience with code, paste the following code into a Class.Script within Class.ServerScriptService to create a Class.Part and play the video on its front surface.\n\nlua\nlocal Workspace = game:GetService(\"Workspace\")\n\nlocal screenPart = Instance.new(\"Part\")\nscreenPart.Size = Vector3.new(16, 9, 1)\nscreenPart.Position = Vector3.new(0, 8, -20)\nscreenPart.Orientation = Vector3.new(0, 180, 0)\nscreenPart.Anchored = true\nscreenPart.Parent = Workspace\n\nlocal surfaceGui = Instance.new(\"SurfaceGui\")\nsurfaceGui.Parent = screenPart\n\nlocal videoFrame = Instance.new(\"VideoFrame\")\nvideoFrame.Size = UDim2.new(1, 0, 1, 0)\nvideoFrame.Parent = surfaceGui\n\nvideoFrame.Looped = true\nvideoFrame.Video = \"rbxassetid://5608384572\"  -- Replace with your video's asset ID\n\nwhile not videoFrame.IsLoaded do\n\tvideoFrame.Loaded:Wait()\nend\n\nvideoFrame:Play()",
    "source": "video-frames.md"
}